coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/**************************************************************************//**
 * @file     NUC400Series.h
 * @version  V1.00
 * $Revision: 45 $
 * $Date: 14/01/14 10:47a $
 * @brief    NUC400 series peripheral access layer header file.
 *           This file contains all the peripheral register's definitions,
 *           bits definitions and memory mapping for NuMicro NUC400 series MCU.
 * @note
 * Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
/**
   \mainpage NuMicro NUC400 Series MCU Driver Reference Guide
   *
   * <b>Introduction</b>
   *
   * This user manual describes the usage of NUC400 Series MCU device driver
   *
   * <b>Disclaimer</b>
   *
   * The Software is furnished "AS IS", without warranty as to performance or results, and
   * the entire risk as to performance or results is assumed by YOU. Nuvoton disclaims all
   * warranties, express, implied or otherwise, with regard to the Software, its use, or
   * operation, including without limitation any and all warranties of merchantability, fitness
   * for a particular purpose, and non-infringement of intellectual property rights.
   *
   * <b>Important Notice</b>
   *
   * Nuvoton Products are neither intended nor warranted for usage in systems or equipment,
   * any malfunction or failure of which may cause loss of human life, bodily injury or severe
   * property damage. Such applications are deemed, "Insecure Usage".
   *
   * Insecure usage includes, but is not limited to: equipment for surgical implementation,
   * atomic energy control instruments, airplane or spaceship instruments, the control or
   * operation of dynamic, brake or safety systems designed for vehicular use, traffic signal
   * instruments, all types of safety devices, and other applications intended to support or
   * sustain life.
   *
   * All Insecure Usage shall be made at customer's risk, and in the event that third parties
   * lay claims to Nuvoton as a result of customer's Insecure Usage, customer shall indemnify
   * the damages and liabilities thus incurred by Nuvoton.
   *
   * Please note that all data and specifications are subject to change without notice. All the
   * trademarks of products and companies mentioned in this datasheet belong to their respective
   * owners.
   *
   * <b>Copyright Notice</b>
   *
   * Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.
   */
/**
  * \page pg1 NuMicro NUC400 BSP Directory Structure
  * The NUC400 board supporting package (BSP) contains CMSIS 3.01 under the "Library\CMSIS" directory,
  * Peripheral standard driver under the "Library\StdDriver" directory, USB host library under the
  * "Library\UsbHostLib" directory, and smartcard 7816-3 library under the "Library\SmartcardLib" directory.
  *
  * There are also sample codes which demonstrate the usage of standard drivers, lwIP network protocol
  * stack, uC/OS-II, uC/OS-III, and FreeRTOS under the "SampleCode" directory.
  *
  * The "ThirdParty" directory contains third party source code, including fatfs, lwIP, and FreeRTOS.
  * Due to license issue, uC/OS-II and uC/OS-III source code are not included and the directory is empty.
  * The source code could be downloaded from Micrium official website.
  *
  * The BSP directory structure is shown in following figures.
  *
  * \image html dir.jpg "BSP Directory Structure"
  * \image latex dir.jpg "BSP Directory Structure"
  * <BR>
  * \image html samplecode.jpg "BSP Sample Code Directory Structure"
  * \image latex samplecode.jpg "BSP Sample Code Directory Structure"
  * <BR>
  * \image html thirdparty.jpg "BSP Third Party Directory Structure"
  * \image latex thirdparty.jpg "BSP Third Party Directory Structure"
  *
  * \page pg2 Revision History
  *
  * <b>Revision 1.00.000</b>
  * \li Added CAN, SD, SC, SCUART driver and samples.
  * \li Added smartcard 7816-3 library.
  * \li Added NUC472 Tiny Board sample.
  * \li Renamed I2C_GetClockBusFreq() to I2C_GetBusClockFreq().
  * \li Renamed I2C_SetClockBusFreq() to I2C_SetBusClockFreq().
  * \li Renamed I2C_SetSlaveMask() to I2C_SetSlaveAddrMask().
  * \li Minor bug fix.
  *
  * <b>Revision 0.10.000</b>
  * \li Added I2S, PDMA driver.
  * \li Added Learning Board and Standard Driver samples.
  * \li Added FreeRTOS lwIP sample.
  *
  * <b>Revision 0.09.000</b>
  * \li Added CAP, EBI, I2C, PWM, SPI, USBD, USBH drivers and samples.
  * \li Added uCOS-II and uCOS-III samples.
  * \li Added FreeRTOS source code and sample.
  *
  * <b>Revision 0.08.000</b>
  * \li Preliminary release.
*/
#ifndef __NUC400SERIES_H__
#define __NUC400SERIES_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup NUC400_Definitions NUC400 Definitions
  This file defines all structures and symbols for NUC400:
    - registers and bit fields
    - peripheral base address
    - peripheral ID
    - Peripheral definitions
  @{
*/


/******************************************************************************/
/*                Processor and Core Peripherals                              */
/******************************************************************************/
/** @addtogroup NUC400_CMSIS Device CMSIS Definitions
  Configuration of the Cortex-M4 Processor and Core Peripherals
  @{
*/

/**
 * @details  Interrupt Number Definition.
 */
typedef enum IRQn {
    /******  Cortex-M4 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn           = -14,      /*!<  2 Non Maskable Interrupt                        */
    MemoryManagement_IRQn         = -12,      /*!<  4 Memory Management Interrupt                   */
    BusFault_IRQn                 = -11,      /*!<  5 Bus Fault Interrupt                           */
    UsageFault_IRQn               = -10,      /*!<  6 Usage Fault Interrupt                         */
    SVCall_IRQn                   = -5,       /*!< 11 SV Call Interrupt                             */
    DebugMonitor_IRQn             = -4,       /*!< 12 Debug Monitor Interrupt                       */
    PendSV_IRQn                   = -2,       /*!< 14 Pend SV Interrupt                             */
    SysTick_IRQn                  = -1,       /*!< 15 System Tick Interrupt                         */

    /******  NUC400 Specific Interrupt Numbers ********************************************************/

