coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M# Processor and Core Peripherals */
#define __CM4_REV                 0x0201    /*!< Core Revision r2p1                               */
#define __NVIC_PRIO_BITS          4         /*!< Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used     */
#define __MPU_PRESENT             1         /*!< MPU present or not                               */
#define __FPU_PRESENT             1         /*!< FPU present or not                               */

/*@}*/ /* end of group NUC400_CMSIS */


#include "core_cm4.h"                       /* Cortex-M4 processor and core peripherals           */
#include "system_NUC400Series.h"            /* NUC400 System include file                         */
#include <stdint.h>

/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/
/** @addtogroup NUC400_Peripherals NUC400 Peripherals
  NUC400 Device Specific Peripheral registers structures
  @{
*/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif


/*------------- Global Control Register (GCR) -----------------------------*/
/** @addtogroup NUC400_GCR NUC400 Global Control Register (GCR)
  @{
*/
/**
  * @brief GCR register map
  */
typedef struct {
    __I  uint32_t PDID;                       /*!< Offset: 0x0000   Part Device Identification Number Register         */
    __IO uint32_t RSTSRC;                     /*!< Offset: 0x0004   System Reset Source Register                       */
    __IO uint32_t IPRSTC1;                    /*!< Offset: 0x0008   IP Reset Control Register 1                        */
    __IO uint32_t IPRSTC2;                    /*!< Offset: 0x000C   IP Reset Control Register 2                        */
    __IO uint32_t IPRSTC3;                    /*!< Offset: 0x0010   IP Reset Control Register 3                        */
    __IO uint32_t ITESTCR;                    /*!< Offset: 0x0014   I/O self test mode for PWM and QEI test            */
    __IO uint32_t BODCR;                      /*!< Offset: 0x0018   Brown-Out Detector Control Register                */
    __IO uint32_t TEMPCR;                     /*!< Offset: 0x001C   Temperature Sensor Control Register                */
    __IO uint32_t VCID;                       /*!< Offset: 0x0020   Hardware version control Register                  */
    __IO uint32_t PORCR;                      /*!< Offset: 0x0024   Power-On-Reset Controller Register                 */
    __IO uint32_t VREFCR;                     /*!< Offset: 0x0028   ADC VREF control Register                          */
    __IO uint32_t USBPHYCR;                   /*!< Offset: 0x002C   USB PHY Control Register                           */
    __IO uint32_t GPA_MFPL;                   /*!< Offset: 0x0030   GPIOA low byte multiple function control Register  */
    __IO uint32_t GPA_MFPH;                   /*!< Offset: 0x0034   GPIOA high byte multiple function control Register */
    __IO uint32_t GPB_MFPL;                   /*!< Offset: 0x0038   GPIOB low byte multiple function control Register  */
    __IO uint32_t GPB_MFPH;                   /*!< Offset: 0x003C   GPIOB high byte multiple function control Register */
    __IO uint32_t GPC_MFPL;                   /*!< Offset: 0x0040   GPIOC low byte multiple function control Register  */
    __IO uint32_t GPC_MFPH;                   /*!< Offset: 0x0044   GPIOC high byte multiple function control Register */
    __IO uint32_t GPD_MFPL;                   /*!< Offset: 0x0048   GPIOD low byte multiple function control Register  */
    __IO uint32_t GPD_MFPH;                   /*!< Offset: 0x004C   GPIOD high byte multiple function control Register */
    __IO uint32_t GPE_MFPL;                   /*!< Offset: 0x0050   GPIOE low byte multiple function control Register  */
    __IO uint32_t GPE_MFPH;                   /*!< Offset: 0x0054   GPIOE high byte multiple function control Register */
    __IO uint32_t GPF_MFPL;                   /*!< Offset: 0x0058   GPIOF low byte multiple function control Register  */
    __IO uint32_t GPF_MFPH;                   /*!< Offset: 0x005C   GPIOF high byte multiple function control Register */
    __IO uint32_t GPG_MFPL;                   /*!< Offset: 0x0060   GPIOG low byte multiple function control Register  */
    __IO uint32_t GPG_MFPH;                   /*!< Offset: 0x0064   GPIOG high byte multiple function control Register */
    __IO uint32_t GPH_MFPL;                   /*!< Offset: 0x0068   GPIOH low byte multiple function control Register  */
    __IO uint32_t GPH_MFPH;                   /*!< Offset: 0x006C   GPIOH high byte multiple function control Register */
    __IO uint32_t GPI_MFPL;                   /*!< Offset: 0x0070   GPIOI low byte multiple function control Register  */
    __IO uint32_t GPI_MFPH;                   /*!< Offset: 0x0074   GPIOI high byte multiple function control Register */
    uint32_t RESERVED3[18];              /*!< Offset: 0x0078 ~ 0x00BC  Reserved                                   */
    __IO uint32_t SRAMF_INTCR;                /*!< Offset: 0x00C0   SRAM interrupt enable control  register            */
    __IO uint32_t SRAMF;                      /*!< Offset: 0x00C4   SRAM parity check error Flag                       */
    __IO uint32_t SRAMF_ADDR;                 /*!< Offset: 0x00C8   SRAM parity check error first address1             */
    __IO uint32_t SRAMF_ADDR2;                /*!< Offset: 0x00CC   SRAM parity check error first address2             */
    uint32_t RESERVED4[8];               /*!< Offset: 0x00D0 ~ 0x00EC  Reserved                                   */
    __IO uint32_t IRCTRIMCTL;                 /*!< Offset: 0x00F0   IRC Trim Control Register                          */
    __IO uint32_t IRCTRIMIEM;                 /*!< Offset: 0x00F4   IRC Trim Interrupt Enable Register                 */
    __IO uint32_t IRCTRIMINT;                 /*!< Offset: 0x00F8   IRC Trim Interrupt Status Register                 */
    uint32_t RESERVED6;                  /*!< Offset: 0x00FC   Reserved                                           */
    __IO uint32_t REGWRPROT;                  /*!< Offset: 0x0100   Register Write-Protection Control Register         */
} GCR_T;

/* SYS PDID Bit Field Definitions */
#define SYS_PDID_PDID_Pos    0                                     /*!< SYS PDID: PDID Position */
#define SYS_PDID_PDID_Msk    (1ul<<SYS_PDID_PDID_Pos)              /*!< SYS PDID: PDID Mask */
/* SYS RSTSRC Bit Field Definitions */
#define SYS_RSTSRC_RSTS_POR_Pos        0                                          /*!< SYS RSTSRC: RSTS_POR Position */
#define SYS_RSTSRC_RSTS_POR_Msk        (1ul<<SYS_RSTSRC_RSTS_POR_Pos)             /*!< SYS RSTSRC: RSTS_POR Mask */

#define SYS_RSTSRC_RSTS_RESET_Pos    1                                             /*!< SYS RSTSRC: RSTS_RESET Position */
#define SYS_RSTSRC_RSTS_RESET_Msk    (1ul<<SYS_RSTSRC_RSTS_RESET_Pos)              /*!< SYS RSTSRC: RSTS_RESET Mask */

#define SYS_RSTSRC_RSTS_WDT_Pos        2                                          /*!< SYS RSTSRC: RSTS_WDT Position */
#define SYS_RSTSRC_RSTS_WDT_Msk        (1ul<<SYS_RSTSRC_RSTS_WDT_Pos)             /*!< SYS RSTSRC: RSTS_WDT Mask */

#define SYS_RSTSRC_RSTS_LVR_Pos        3                                          /*!< SYS RSTSRC: RSTS_LVR Position */
#define SYS_RSTSRC_RSTS_LVR_Msk        (1ul<<SYS_RSTSRC_RSTS_LVR_Pos)             /*!< SYS RSTSRC: RSTS_LVR Mask */

#define SYS_RSTSRC_RSTS_BOD_Pos        4                                          /*!< SYS RSTSRC: RSTS_BOD Position */
#define SYS_RSTSRC_RSTS_BOD_Msk        (1ul<<SYS_RSTSRC_RSTS_BOD_Pos)             /*!< SYS RSTSRC: RSTS_BOD Mask */

#define SYS_RSTSRC_RSTS_SYS_Pos        5                                          /*!< SYS RSTSRC: RSTS_SYS Position */
#define SYS_RSTSRC_RSTS_SYS_Msk        (1ul<<SYS_RSTSRC_RSTS_SYS_Pos)             /*!< SYS RSTSRC: RSTS_SYS Mask */

#define SYS_RSTSRC_RSTS_CPU_Pos        7                                          /*!< SYS RSTSRC: RSTS_CPU Position */
#define SYS_RSTSRC_RSTS_CPU_Msk        (1ul<<SYS_RSTSRC_RSTS_CPU_Pos)             /*!< SYS RSTSRC: RSTS_CPU Mask */

#define SYS_RSTSRC_CPUINST_Pos        8                                          /*!< SYS RSTSRC: CPUINST Position */
#define SYS_RSTSRC_CPUINST_Msk        (1ul<<SYS_RSTSRC_CPUINST_Pos)              /*!< SYS RSTSRC: CPUINST Mask */


/* SYS IPRSTC1 Bit Field Definitions */
#define SYS_IPRSTC1_CHIP_RST_Pos        0                                          /*!< SYS IPRSTC1: CHIP_RST Position */
#define SYS_IPRSTC1_CHIP_RST_Msk        (1ul<<SYS_IPRSTC1_CHIP_RST_Pos)            /*!< SYS IPRSTC1: CHIP_RST Mask */

