coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SYS_IPRSTC1_CPU_RST_Pos            1                                          /*!< SYS IPRSTC1: CPU_RST Position */
#define SYS_IPRSTC1_CPU_RST_Msk            (1ul<<SYS_IPRSTC1_CPU_RST_Pos)             /*!< SYS IPRSTC1: CPU_RST Mask */

#define SYS_IPRSTC1_PDMA_RST_Pos        2                                          /*!< SYS IPRSTC1: PDMA Position */
#define SYS_IPRSTC1_PDMA_RST_Msk        (1ul<<SYS_IPRSTC1_PDMA_RST_Pos)              /*!< SYS IPRSTC1: PDMA Mask */

#define SYS_IPRSTC1_EBI_RST_Pos            3                                          /*!< SYS IPRSTC1: EBI_RST Position */
#define SYS_IPRSTC1_EBI_RST_Msk            (1ul<<SYS_IPRSTC1_EBI_RST_Pos)              /*!< SYS IPRSTC1: EBI_RST Mask */

#define SYS_IPRSTC1_UHC_RST_Pos            4                                              /*!< SYS IPRSTC1: UHC_RST Position */
#define SYS_IPRSTC1_UHC_RST_Msk            (1ul<<SYS_IPRSTC1_UHC_RST_Pos)                 /*!< SYS IPRSTC1: UHC_RST Mask */

#define SYS_IPRSTC1_EMAC_RST_Pos            5                                          /*!< SYS IPRSTC1: EMAC_RST Position */
#define SYS_IPRSTC1_EMAC_RST_Msk            (1ul<<SYS_IPRSTC1_EMAC_RST_Pos)            /*!< SYS IPRSTC1: EMAC_RST Mask */

#define SYS_IPRSTC1_SD_RST_Pos        6                                          /*!< SYS IPRSTC1: SD_RST Position */
#define SYS_IPRSTC1_SD_RST_Msk        (1ul<<SYS_IPRSTC1_SD_RST_Pos)              /*!< SYS IPRSTC1: SD_RST Mask */

#define SYS_IPRSTC1_CRC_RST_Pos            7                                          /*!< SYS IPRSTC1: CRC_RST Position */
#define SYS_IPRSTC1_CRC_RST_Msk            (1ul<<SYS_IPRSTC1_CRC_RST_Pos)             /*!< SYS IPRSTC1: CRC_RST Mask */

#define SYS_IPRSTC1_CAP_RST_Pos        8                                          /*!< SYS IPRSTC1: CAP_RST Position */
#define SYS_IPRSTC1_CAP_RST_Msk        (1ul<<SYS_IPRSTC1_CAP_RST_Pos)             /*!< SYS IPRSTC1: CAP_RST Mask */

#define SYS_IPRSTC1_SPACC_RST_Pos        12                                          /*!< SYS IPRSTC1: SPACC_RST Position */
#define SYS_IPRSTC1_SPACC_RST_Msk        (1ul<<SYS_IPRSTC1_SPACC_RST_Pos)            /*!< SYS IPRSTC1: SPACC_RST Mask */

/* SYS IPRSTC2 Bit Field Definitions */
#define SYS_IPRSTC2_GPIO_RST_Pos        1                                          /*!< SYS IPRSTC2: GPIO_RST Position */
#define SYS_IPRSTC2_GPIO_RST_Msk        (1ul<<SYS_IPRSTC2_GPIO_RST_Pos)              /*!< SYS IPRSTC2: GPIO_RST Mask */

#define SYS_IPRSTC2_TMR0_RST_Pos        2                                          /*!< SYS IPRSTC2: TMR0_RST Position */
#define SYS_IPRSTC2_TMR0_RST_Msk        (1ul<<SYS_IPRSTC2_TMR0_RST_Pos)              /*!< SYS IPRSTC2: TMR0_RST Mask */

#define SYS_IPRSTC2_TMR1_RST_Pos        3                                          /*!< SYS IPRSTC2: TMR1_RST Position */
#define SYS_IPRSTC2_TMR1_RST_Msk        (1ul<<SYS_IPRSTC2_TMR1_RST_Pos)              /*!< SYS IPRSTC2: TMR1_RST Mask */

#define SYS_IPRSTC2_TMR2_RST_Pos        4                                          /*!< SYS IPRSTC2: TMR2_RST Position */
#define SYS_IPRSTC2_TMR2_RST_Msk        (1ul<<SYS_IPRSTC2_TMR2_RST_Pos)              /*!< SYS IPRSTC2: TMR2_RST Mask */

#define SYS_IPRSTC2_TMR3_RST_Pos        5                                          /*!< SYS IPRSTC2: TMR3_RST Position */
#define SYS_IPRSTC2_TMR3_RST_Msk        (1ul<<SYS_IPRSTC2_TMR3_RST_Pos)              /*!< SYS IPRSTC2: TMR3_RST Mask */

#define SYS_IPRSTC2_ACMP_RST_Pos        7                                          /*!< SYS IPRSTC2: ACMP_RST Position */
#define SYS_IPRSTC2_ACMP_RST_Msk        (1ul<<SYS_IPRSTC2_ACMP_RST_Pos)              /*!< SYS IPRSTC2: ACMP_RST Mask */

#define SYS_IPRSTC2_I2C0_RST_Pos        8                                          /*!< SYS IPRSTC2: I2C0_RST Position */
#define SYS_IPRSTC2_I2C0_RST_Msk        (1ul<<SYS_IPRSTC2_I2C0_RST_Pos)              /*!< SYS IPRSTC2: I2C0_RST Mask */

#define SYS_IPRSTC2_I2C1_RST_Pos        9                                          /*!< SYS IPRSTC2: I2C1_RST Position */
#define SYS_IPRSTC2_I2C1_RST_Msk        (1ul<<SYS_IPRSTC2_I2C1_RST_Pos)              /*!< SYS IPRSTC2: I2C1_RST Mask */

#define SYS_IPRSTC2_I2C2_RST_Pos        10                                          /*!< SYS IPRSTC2: I2C2_RST Position */
#define SYS_IPRSTC2_I2C2_RST_Msk        (1ul<<SYS_IPRSTC2_I2C2_RST_Pos)              /*!< SYS IPRSTC2: I2C2_RST Mask */

#define SYS_IPRSTC2_I2C3_RST_Pos        11                                          /*!< SYS IPRSTC2: I2C3_RST Position */
#define SYS_IPRSTC2_I2C3_RST_Msk        (1ul<<SYS_IPRSTC2_I2C3_RST_Pos)              /*!< SYS IPRSTC2: I2C3_RST Mask */

#define SYS_IPRSTC2_SPI0_RST_Pos        12                                          /*!< SYS IPRSTC2: SPI0_RST Position */
#define SYS_IPRSTC2_SPI0_RST_Msk        (1ul<<SYS_IPRSTC2_SPI0_RST_Pos)              /*!< SYS IPRSTC2: SPI0_RST Mask */

#define SYS_IPRSTC2_SPI1_RST_Pos        13                                          /*!< SYS IPRSTC2: SPI1_RST Position */
#define SYS_IPRSTC2_SPI1_RST_Msk        (1ul<<SYS_IPRSTC2_SPI1_RST_Pos)              /*!< SYS IPRSTC2: SPI1_RST Mask */

#define SYS_IPRSTC2_SPI2_RST_Pos        14                                          /*!< SYS IPRSTC2: SPI2_RST Position */
#define SYS_IPRSTC2_SPI2_RST_Msk        (1ul<<SYS_IPRSTC2_SPI2_RST_Pos)              /*!< SYS IPRSTC2: SPI2_RST Mask */

#define SYS_IPRSTC2_SPI3_RST_Pos        15                                          /*!< SYS IPRSTC2: SPI3_RST Position */
#define SYS_IPRSTC2_SPI3_RST_Msk        (1ul<<SYS_IPRSTC2_SPI3_RST_Pos)              /*!< SYS IPRSTC2: SPI3_RST Mask */

#define SYS_IPRSTC2_UART0_RST_Pos        16                                          /*!< SYS IPRSTC2: UART0_RST Position */
#define SYS_IPRSTC2_UART0_RST_Msk        (1ul<<SYS_IPRSTC2_UART0_RST_Pos)              /*!< SYS IPRSTC2: UART0_RST Mask */

#define SYS_IPRSTC2_UART1_RST_Pos        17                                          /*!< SYS IPRSTC2: UART1_RST Position */
#define SYS_IPRSTC2_UART1_RST_Msk        (1ul<<SYS_IPRSTC2_UART1_RST_Pos)              /*!< SYS IPRSTC2: UART1_RST Mask */

#define SYS_IPRSTC2_UART2_RST_Pos        18                                          /*!< SYS IPRSTC2: UART2_RST Position */
#define SYS_IPRSTC2_UART2_RST_Msk        (1ul<<SYS_IPRSTC2_UART2_RST_Pos)              /*!< SYS IPRSTC2: UART2_RST Mask */

#define SYS_IPRSTC2_UART3_RST_Pos        19                                          /*!< SYS IPRSTC2: UART3_RST Position */
#define SYS_IPRSTC2_UART3_RST_Msk        (1ul<<SYS_IPRSTC2_GUART3_RST_Pos)              /*!< SYS IPRSTC2: UART3_RST Mask */

#define SYS_IPRSTC2_UART4_RST_Pos        20                                          /*!< SYS IPRSTC2: UART4_RST Position */
#define SYS_IPRSTC2_UART4_RST_Msk        (1ul<<SYS_IPRSTC2_UART4_RST_Pos)              /*!< SYS IPRSTC2: UART4_RST Mask */

#define SYS_IPRSTC2_UART5_RST_Pos        21                                          /*!< SYS IPRSTC2: UART5_RST Position */
#define SYS_IPRSTC2_UART5_RST_Msk        (1ul<<SYS_IPRSTC2_UART5_RST_Pos)              /*!< SYS IPRSTC2: UART5_RST Mask */

#define SYS_IPRSTC2_CAN0_RST_Pos        24                                          /*!< SYS IPRSTC2: CAN0_RST Position */
#define SYS_IPRSTC2_CAN0_RST_Msk        (1ul<<SYS_IPRSTC2_CAN0_RST_Pos)              /*!< SYS IPRSTC2: CAN0_RST Mask */

