coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SYS_IPRSTC2_CAN1_RST_Pos        25                                          /*!< SYS IPRSTC2: CAN1_RST Position */
#define SYS_IPRSTC2_CAN1_RST_Msk        (1ul<<SYS_IPRSTC2_CAN1_RST_Pos)              /*!< SYS IPRSTC2: CAN1_RST Mask */

#define SYS_IPRSTC2_OTG_RST_Pos            26                                          /*!< SYS IPRSTC2: OTG_RST Position */
#define SYS_IPRSTC2_OTG_RST_Msk            (1ul<<SYS_IPRSTC2_OTG_RST_Pos)              /*!< SYS IPRSTC2: OTG_RST Mask */

#define SYS_IPRSTC2_USBD_RST_Pos        27                                          /*!< SYS IPRSTC2: USBD_RST Position */
#define SYS_IPRSTC2_USBD_RST_Msk        (1ul<<SYS_IPRSTC2_USBD_RST_Pos)              /*!< SYS IPRSTC2: USBD_RST Mask */

#define SYS_IPRSTC2_ADC_RST_Pos            28                                          /*!< SYS IPRSTC2: ADC_RST Position */
#define SYS_IPRSTC2_ADC_RST_Msk            (1ul<<SYS_IPRSTC2_ADC_RST_Pos)              /*!< SYS IPRSTC2: ADC_RST Mask */

#define SYS_IPRSTC2_I2S_RST_Pos            29                                          /*!< SYS IPRSTC2: I2S_RST Position */
#define SYS_IPRSTC2_I2S_RST_Msk        (1ul<<SYS_IPRSTC2_I2S_RST_Pos)              /*!< SYS IPRSTC2: I2S_RST Mask */

#define SYS_IPRSTC2_I2S1_RST_Pos        30                                          /*!< SYS IPRSTC2: I2S1_RST Position */
#define SYS_IPRSTC2_I2S1_RST_Msk        (1ul<<SYS_IPRSTC2_I2S1_RST_Pos)              /*!< SYS IPRSTC2: I2S1_RST Mask */

#define SYS_IPRSTC2_PS2_RST_Pos            31                                          /*!< SYS IPRSTC2: PS2_RST Position */
#define SYS_IPRSTC2_PS2_RST_Msk            (1ul<<SYS_IPRSTC2_PS2_RST_Pos)              /*!< SYS IPRSTC2: PS2_RST Mask */

/* SYS IPRSTC3 Bit Field Definitions */
#define SYS_IPRSTC3_SC0_RST_Pos        0                                          /*!< SYS IPRSTC3: SC0_RST Position */
#define SYS_IPRSTC3_SC0_RST_Msk        (1ul<<SYS_IPRSTC3_SC0_RST_Pos)              /*!< SYS IPRSTC3: SC0_RST Mask */

#define SYS_IPRSTC3_SC1_RST_Pos        1                                          /*!< SYS IPRSTC3: SC1_RST Position */
#define SYS_IPRSTC3_SC1_RST_Msk        (1ul<<SYS_IPRSTC3_SC1_RST_Pos)              /*!< SYS IPRSTC3: SC1_RST Mask */

#define SYS_IPRSTC3_SC2_RST_Pos        2                                          /*!< SYS IPRSTC3: SC2_RST Position */
#define SYS_IPRSTC3_SC2_RST_Msk        (1ul<<SYS_IPRSTC3_SC2_RST_Pos)              /*!< SYS IPRSTC3: SC2_RST Mask */

#define SYS_IPRSTC3_SC3_RST_Pos        3                                          /*!< SYS IPRSTC3: SC3_RST Position */
#define SYS_IPRSTC3_SC3_RST_Msk        (1ul<<SYS_IPRSTC3_SC3_RST_Pos)              /*!< SYS IPRSTC3: SC3_RST Mask */

#define SYS_IPRSTC3_SC4_RST_Pos        4                                          /*!< SYS IPRSTC3: SC4_RST Position */
#define SYS_IPRSTC3_SC4_RST_Msk        (1ul<<SYS_IPRSTC3_SC4_RST_Pos)              /*!< SYS IPRSTC3: SC4_RST Mask */

#define SYS_IPRSTC3_SC5_RST_Pos        5                                          /*!< SYS IPRSTC3: SC5_RST Position */
#define SYS_IPRSTC3_SC5_RST_Msk        (1ul<<SYS_IPRSTC3_SC5_RST_Pos)              /*!< SYS IPRSTC3: SC5_RST Mask */

#define SYS_IPRSTC3_I2C4_RST_Pos        8                                          /*!< SYS IPRSTC3: I2C4_RST Position */
#define SYS_IPRSTC3_I2C4_RST_Msk        (1ul<<SYS_IPRSTC3_I2C4_RST_Pos)              /*!< SYS IPRSTC3: I2C4_RST Mask */

#define SYS_IPRSTC3_PWM0_RST_Pos        16                                          /*!< SYS IPRSTC3: PWM0_RST Position */
#define SYS_IPRSTC3_PWM0_RST_Msk        (1ul<<SYS_IPRSTC3_PWM0_RST_Pos)              /*!< SYS IPRSTC3: PWM0_RST Mask */

#define SYS_IPRSTC3_PWM1_RST_Pos        17                                          /*!< SYS IPRSTC3: PWM1_RST Position */
#define SYS_IPRSTC3_PWM1_RST_Msk        (1ul<<SYS_IPRSTC3_PWM0_RST_Pos)              /*!< SYS IPRSTC3: PWM1_RST Mask */

#define SYS_IPRSTC3_QEI0_RST_Pos        22                                          /*!< SYS IPRSTC3: QEI0_RST Position */
#define SYS_IPRSTC3_QEI0_RST_Msk        (1ul<<SYS_IPRSTC3_QEI0_RST_Pos)              /*!< SYS IPRSTC3: QEI0_RST Mask */

#define SYS_IPRSTC3_QEI1_RST_Pos        23                                          /*!< SYS IPRSTC3: QEI1_RST Position */
#define SYS_IPRSTC3_QEI1_RST_Msk        (1ul<<SYS_IPRSTC3_QEI1_RST_Pos)              /*!< SYS IPRSTC3: QEI1_RST Mask */

#define SYS_IPRSTC3_EPWM0_RST_Pos        24                                          /*!< SYS IPRSTC3: EPWM0_RST Position */
#define SYS_IPRSTC3_EPWM0_RST_Msk        (1ul<<SYS_IPRSTC3_EPWM1_RST_Pos)              /*!< SYS IPRSTC3: EPWM0_RST Mask */

#define SYS_IPRSTC3_EPWM1_RST_Pos        25                                          /*!< SYS IPRSTC3: EPWM1_RST Position */
#define SYS_IPRSTC3_EPWM1_RST_Msk        (1ul<<SYS_IPRSTC3_EPWM1_RST_Pos)              /*!< SYS IPRSTC3: EPWM1_RST Mask */

#define SYS_IPRSTC3_ECAP0_RST_Pos        26                                          /*!< SYS IPRSTC3: ECAP0_RST Position */
#define SYS_IPRSTC3_ECAP0_RST_Msk        (1ul<<SYS_IPRSTC3_ECAP0_RST_Pos)              /*!< SYS IPRSTC3: ECAP0_RST Mask */

#define SYS_IPRSTC3_ECAP1_RST_Pos        27                                          /*!< SYS IPRSTC3: ECAP0_RST Position */
#define SYS_IPRSTC3_ECAP1_RST_Msk        (1ul<<SYS_IPRSTC3_ECAP1_RST_Pos)              /*!< SYS IPRSTC3: ECAP0_RST Mask */

/* SYS BODCR Bit Field Definitions */
#define SYS_BODCR_BOD_EN_Pos        0                                              /*!< SYS BODCR: BOD_EN Position */
#define SYS_BODCR_BOD_EN_Msk        (1ul<<SYS_BODCR_BOD_EN_Pos)                      /*!< SYS BODCR: BOD_EN Mask */

#define SYS_BODCR_BOD_VL_Pos        1                                              /*!< SYS BODCR: BOD_VL Position */
#define SYS_BODCR_BOD_VL_Msk        (0x3ul<<SYS_BODCR_BOD_VL_Pos)                      /*!< SYS BODCR: BOD_VL Mask */

#define SYS_BODCR_BOD_RSTEN_Pos        3                                              /*!< SYS BODCR: BOD_RSTEN Position */
#define SYS_BODCR_BOD_RSTEN_Msk        (1ul<<SYS_BODCR_BOD_RSTEN_Pos)                      /*!< SYS BODCR: BOD_RSTEN Mask */

#define SYS_BODCR_BOD_INTF_Pos        4                                              /*!< SYS BODCR: BOD_INTF Position */
#define SYS_BODCR_BOD_INTF_Msk        (1ul<<SYS_BODCR_BOD_INTF_Pos)                      /*!< SYS BODCR: BOD_INTF Mask */

#define SYS_BODCR_BOD_LPM_Pos        5                                              /*!< SYS BODCR: BOD_LPM Position */
#define SYS_BODCR_BOD_LPM_Msk        (1ul<<SYS_BODCR_BOD_LPM_Pos)                      /*!< SYS BODCR: BOD_LPM Mask */

#define SYS_BODCR_BOD_OUT_Pos        6                                              /*!< SYS BODCR: BOD_OUT Position */
#define SYS_BODCR_BOD_OUT_Msk        (1ul<<SYS_BODCR_BOD_OUT_Pos)                      /*!< SYS BODCR: BOD_OUT Mask */

#define SYS_BODCR_LVR_EN_Pos        7                                              /*!< SYS BODCR: LVR_EN Position */
#define SYS_BODCR_LVR_EN_Msk        (1ul<<SYS_BODCR_BOD_EN_Pos)                      /*!< SYS BODCR: LVR_EN Mask */

/* SYS TEMPCR Bit Field Definitions */
#define SYS_TEMPCR_VTEMP_EN_Pos        0                                              /*!< SYS TEMPCR: VTEMP_EN Position */
#define SYS_TEMPCR_VTEMP_EN_Msk        (1ul<<SYS_TEMPCR_VTEMP_EN_Pos)                  /*!< SYS TEMPCR: VTEMP_EN Mask */

