coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* SYS VCID Bit Field Definitions */
#define SYS_VCID_VCID_Pos        0                                                  /*!< SYS VCID: VCID Position */
#define SYS_VCID_VCID_Msk        (0xFFFFul<<SYS_VCID_VCID_Pos)                          /*!< SYS VCID: VCID Mask */

/* SYS PORCR Bit Field Definitions */
#define SYS_PORCR_POR_DIS_CODE_Pos        0                                          /*!< SYS PORCR: POR_DIS_CODE Position */
#define SYS_PORCR_POR_DIS_CODE_Msk        (0xFFFFul<<SYS_VCID_POR_DIS_CODE_Pos)          /*!< SYS PORCR: POR_DIS_CODE Mask */

/* SYS VREFCR Bit Field Definitions */
#define SYS_VREFCR_VREF_ENG_Pos        0                                              /*!< SYS VREFCR: VREF_ENG Position */
#define SYS_VREFCR_VREF_ENG_Msk        (1ul<<SYS_VREFCR_VREF_ENG_Pos)                  /*!< SYS VREFCR: VREF_ENG Mask */

#define SYS_VREFCR_VREF_ENREG_Pos        1                                          /*!< SYS VREFCR: VREF_ENREG Position */
#define SYS_VREFCR_VREF_ENREG_Msk        (1ul<<SYS_VREFCR_VREF_ENREG_Pos)              /*!< SYS VREFCR: VREF_ENREG Mask */

#define SYS_VREFCR_VREF_SEL_Pos        2                                              /*!< SYS VREFCR: VREF_SEL Position */
#define SYS_VREFCR_VREF_SEL_Msk        (0x3ul<<SYS_VREFCR_VREF_SEL_Pos)                  /*!< SYS VREFCR: VREF_SEL Mask */

#define SYS_VREFCR_ADC_VREFSEL_Pos        4                                          /*!< SYS VREFCR: ADC_VREFSEL Position */
#define SYS_VREFCR_ADC_VREFSEL_Msk        (1ul<<SYS_VREFCR_ADC_VREFSEL_Pos)              /*!< SYS VREFCR: ADC_VREFSEL Mask */

#define SYS_VREFCR_ADC_SEL_Pos        8                                              /*!< SYS VREFCR: ADC_SEL Position */
#define SYS_VREFCR_ADC_SEL_Msk        (1ul<<SYS_VREFCR_ADC_SEL_Pos)                      /*!< SYS VREFCR: ADC_SEL Mask */

#define SYS_VREFCR_PWM_MODE_Pos        9                                              /*!< SYS VREFCR: PWM_MODE Position */
#define SYS_VREFCR_PWM_MODE_Msk        (1ul<<SYS_VREFCR_PWM_MODE_Pos)                  /*!< SYS VREFCR: PWM_MODE Mask */

/* SYS USBPHYCR Bit Field Definitions */
#define SYS_USBPHYCR_OTG_ROLE_Pos       0                                       /*!< SYS USBPHYCR: USB Role Option Position */
#define SYS_USBPHYCR_OTG_ROLE_Msk       (3ul<<SYS_USBPHYCR_OTG_ROLE_Pos)        /*!< SYS USBPHYCR: USB Role Option Mask */

#define SYS_USBPHYCR_OTG_V33_EN_Pos     8                                       /*!< SYS USBPHYCR: LDO33 Enable Control Position */
#define SYS_USBPHYCR_OTG_V33_EN_Msk     (1ul<<SYS_USBPHYCR_OTG_V33_EN_Pos)      /*!< SYS USBPHYCR: LDO33 Enable Control Mask */

/* SYS GPA_MFPL Bit Field Definitions */
#define SYS_GPA_MFPL_PA0_MFP_Pos 0                                                                        /*!< SYS GPA_MFPL: PA0_MFP Position */
#define SYS_GPA_MFPL_PA0_MFP_Msk    (0xFul<<SYS_GPA_MFPL_PA0_MFP_Pos)            /*!< SYS GPA_MFPL: PA0_MFP Mask  */

#define SYS_GPA_MFPL_PA1_MFP_Pos 4                                                                        /*!< SYS GPA_MFPL: PA1_MFP Position */
#define SYS_GPA_MFPL_PA1_MFP_Msk    (0xFul<<SYS_GPA_MFPL_PA1_MFP_Pos)            /*!< SYS GPA_MFPL: PA1_MFP Mask  */

#define SYS_GPA_MFPL_PA2_MFP_Pos 8                                                                        /*!< SYS GPA_MFPL: PA2_MFP Position */
#define SYS_GPA_MFPL_PA2_MFP_Msk    (0xFul<<SYS_GPA_MFPL_PA2_MFP_Pos)            /*!< SYS GPA_MFPL: PA2_MFP Mask */

#define SYS_GPA_MFPL_PA3_MFP_Pos 12                                                                        /*!< SYS GPA_MFPL: PA3_MFP Position */
#define SYS_GPA_MFPL_PA3_MFP_Msk    (0xFul<<SYS_GPA_MFPL_PA3_MFP_Pos)            /*!< SYS GPA_MFPL: PA3_MFP Mask */

#define SYS_GPA_MFPL_PA4_MFP_Pos 16                                                                        /*!< SYS GPA_MFPL: PA4_MFP Position */
#define SYS_GPA_MFPL_PA4_MFP_Msk    (0xFul<<SYS_GPA_MFPL_PA4_MFP_Pos)            /*!< SYS GPA_MFPL: PA4_MFP Mask */

#define SYS_GPA_MFPL_PA5_MFP_Pos 20                                                                        /*!< SYS GPA_MFPL: PA5_MFP Position */
#define SYS_GPA_MFPL_PA5_MFP_Msk    (0xFul<<SYS_GPA_MFPL_PA5_MFP_Pos)            /*!< SYS GPA_MFPL: PA5_MFP Mask */

#define SYS_GPA_MFPL_PA6_MFP_Pos 24                                                                        /*!< SYS GPA_MFPL: PA6_MFP Position */
#define SYS_GPA_MFPL_PA6_MFP_Msk    (0xFul<<SYS_GPA_MFPL_PA6_MFP_Pos)            /*!< SYS GPA_MFPL: PA6_MFP Mask */

#define SYS_GPA_MFPL_PA7_MFP_Pos 28                                                                        /*!< SYS GPA_MFPL: PA7_MFP Position */
#define SYS_GPA_MFPL_PA7_MFP_Msk    (0xFul<<SYS_GPA_MFPL_PA7_MFP_Pos)            /*!< SYS GPA_MFPL: PA7_MFP Mask */

/* SYS GPA_MFPH Bit Field Definitions */
#define SYS_GPA_MFPH_PA8_MFP_Pos 0                                                                        /*!< SYS GPA_MFPH: PA8_MFP Position */
#define SYS_GPA_MFPH_PA8_MFP_Msk    (0xFul<<SYS_GPA_MFPH_PA8_MFP_Pos)            /*!< SYS GPA_MFPH: PA8_MFP Mask  */

#define SYS_GPA_MFPH_PA9_MFP_Pos 4                                                                        /*!< SYS GPA_MFPH: PA9_MFP Position */
#define SYS_GPA_MFPH_PA9_MFP_Msk    (0xFul<<SYS_GPA_MFPH_PA9_MFP_Pos)            /*!< SYS GPA_MFPH: PA9_MFP Mask  */

#define SYS_GPA_MFPH_PA10_MFP_Pos 8                                                                        /*!< SYS GPA_MFPH: PA10_MFP Position */
#define SYS_GPA_MFPH_PA10_MFP_Msk    (0xFul<<SYS_GPA_MFPH_PA10_MFP_Pos)        /*!< SYS GPA_MFPH: PA10_MFP Mask */

#define SYS_GPA_MFPH_PA11_MFP_Pos 12                                                                    /*!< SYS GPA_MFPH: PA11_MFP Position */
#define SYS_GPA_MFPH_PA11_MFP_Msk    (0xFul<<SYS_GPA_MFPH_PA11_MFP_Pos)        /*!< SYS GPA_MFPH: PA11_MFP Mask */

#define SYS_GPA_MFPH_PA12_MFP_Pos 16                                                                    /*!< SYS GPA_MFPH: PA12_MFP Position */
#define SYS_GPA_MFPH_PA12_MFP_Msk    (0xFul<<SYS_GPA_MFPH_PA12_MFP_Pos)        /*!< SYS GPA_MFPH: PA12_MFP Mask */

#define SYS_GPA_MFPH_PA13_MFP_Pos 20                                                                    /*!< SYS GPA_MFPH: PA13_MFP Position */
#define SYS_GPA_MFPH_PA13_MFP_Msk    (0xFul<<SYS_GPA_MFPH_PA13_MFP_Pos)        /*!< SYS GPA_MFPH: PA13_MFP Mask */

#define SYS_GPA_MFPH_PA14_MFP_Pos 24                                                                    /*!< SYS GPA_MFPH: PA14_MFP Position */
#define SYS_GPA_MFPH_PA14_MFP_Msk    (0xFul<<SYS_GPA_MFPH_PA14_MFP_Pos)        /*!< SYS GPA_MFPH: PA14_MFP Mask */

#define SYS_GPA_MFPH_PA15_MFP_Pos 28                                                                    /*!< SYS GPA_MFPH: PA15_MFP Position */
#define SYS_GPA_MFPH_PA15_MFP_Msk    (0xFul<<SYS_GPA_MFPH_PA15_MFP_Pos)        /*!< SYS GPA_MFPH: PA15_MFP Mask */

/* SYS GPB_MFPL Bit Field Definitions */
#define SYS_GPB_MFPL_PB0_MFP_Pos 0                                                                        /*!< SYS GPB_MFPL: PB0_MFP Position */
#define SYS_GPB_MFPL_PB0_MFP_Msk    (0xFul<<SYS_GPB_MFPL_PB0_MFP_Pos)            /*!< SYS GPB_MFPL: PB0_MFP Mask  */

#define SYS_GPB_MFPL_PB1_MFP_Pos 4                                                                        /*!< SYS GPB_MFPL: PB1_MFP Position */
#define SYS_GPB_MFPL_PB1_MFP_Msk    (0xFul<<SYS_GPB_MFPL_PB1_MFP_Pos)            /*!< SYS GPB_MFPL: PB1_MFP Mask  */

#define SYS_GPB_MFPL_PB2_MFP_Pos 8                                                                        /*!< SYS GPB_MFPL: PB2_MFP Position */
#define SYS_GPB_MFPL_PB2_MFP_Msk    (0xFul<<SYS_GPB_MFPL_PB2_MFP_Pos)            /*!< SYS GPB_MFPL: PB2_MFP Mask */

#define SYS_GPB_MFPL_PB3_MFP_Pos 12                                                                        /*!< SYS GPB_MFPL: PB3_MFP Position */
#define SYS_GPB_MFPL_PB3_MFP_Msk    (0xFul<<SYS_GPB_MFPL_PB3_MFP_Pos)            /*!< SYS GPB_MFPL: PB3_MFP Mask */

#define SYS_GPB_MFPL_PB4_MFP_Pos 16                                                                        /*!< SYS GPB_MFPL: PB4_MFP Position */
#define SYS_GPB_MFPL_PB4_MFP_Msk    (0xFul<<SYS_GPB_MFPL_PB4_MFP_Pos)            /*!< SYS GPB_MFPL: PB4_MFP Mask */

#define SYS_GPB_MFPL_PB5_MFP_Pos 20                                                                        /*!< SYS GPB_MFPL: PB5_MFP Position */
#define SYS_GPB_MFPL_PB5_MFP_Msk    (0xFul<<SYS_GPB_MFPL_PB5_MFP_Pos)            /*!< SYS GPB_MFPL: PB5_MFP Mask */

#define SYS_GPB_MFPL_PB6_MFP_Pos 24                                                                        /*!< SYS GPB_MFPL: PB6_MFP Position */
#define SYS_GPB_MFPL_PB6_MFP_Msk    (0xFul<<SYS_GPB_MFPL_PB6_MFP_Pos)            /*!< SYS GPB_MFPL: PB6_MFP Mask */

#define SYS_GPB_MFPL_PB7_MFP_Pos 28                                                                        /*!< SYS GPB_MFPL: PB7_MFP Position */
#define SYS_GPB_MFPL_PB7_MFP_Msk    (0xFul<<SYS_GPB_MFPL_PB7_MFP_Pos)            /*!< SYS GPB_MFPL: PB7_MFP Mask */

