coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* SYS GPB_MFPH Bit Field Definitions */
#define SYS_GPB_MFPH_PB8_MFP_Pos 0                                                                        /*!< SYS GPB_MFPH: PB8_MFP Position */
#define SYS_GPB_MFPH_PB8_MFP_Msk    (0xFul<<SYS_GPB_MFPH_PB8_MFP_Pos)            /*!< SYS GPB_MFPH: PB8_MFP Mask  */

#define SYS_GPB_MFPH_PB9_MFP_Pos 4                                                                        /*!< SYS GPB_MFPH: PB9_MFP Position */
#define SYS_GPB_MFPH_PB9_MFP_Msk    (0xFul<<SYS_GPB_MFPH_PB9_MFP_Pos)            /*!< SYS GPB_MFPH: PB9_MFP Mask  */

#define SYS_GPB_MFPH_PB10_MFP_Pos 8                                                                        /*!< SYS GPB_MFPH: PB10_MFP Position */
#define SYS_GPB_MFPH_PB10_MFP_Msk    (0xFul<<SYS_GPB_MFPH_PB10_MFP_Pos)        /*!< SYS GPB_MFPH: PB10_MFP Mask */

#define SYS_GPB_MFPH_PB11_MFP_Pos 12                                                                    /*!< SYS GPB_MFPH: PB11_MFP Position */
#define SYS_GPB_MFPH_PB11_MFP_Msk    (0xFul<<SYS_GPB_MFPH_PB11_MFP_Pos)        /*!< SYS GPB_MFPH: PB11_MFP Mask */

#define SYS_GPB_MFPH_PB12_MFP_Pos 16                                                                    /*!< SYS GPB_MFPH: PB12_MFP Position */
#define SYS_GPB_MFPH_PB12_MFP_Msk    (0xFul<<SYS_GPB_MFPH_PB12_MFP_Pos)        /*!< SYS GPB_MFPH: PB12_MFP Mask */

#define SYS_GPB_MFPH_PB13_MFP_Pos 20                                                                    /*!< SYS GPB_MFPH: PB13_MFP Position */
#define SYS_GPB_MFPH_PB13_MFP_Msk    (0xFul<<SYS_GPB_MFPH_PB13_MFP_Pos)        /*!< SYS GPB_MFPH: PB13_MFP Mask */

#define SYS_GPB_MFPH_PB14_MFP_Pos 24                                                                    /*!< SYS GPB_MFPH: PB14_MFP Position */
#define SYS_GPB_MFPH_PB14_MFP_Msk    (0xFul<<SYS_GPB_MFPH_PB14_MFP_Pos)        /*!< SYS GPB_MFPH: PB14_MFP Mask */

#define SYS_GPB_MFPH_PB15_MFP_Pos 28                                                                    /*!< SYS GPB_MFPH: PB15_MFP Position */
#define SYS_GPB_MFPH_PB15_MFP_Msk    (0xFul<<SYS_GPB_MFPH_PB15_MFP_Pos)        /*!< SYS GPB_MFPH: PB15_MFP Mask */

/* SYS GPC_MFPL Bit Field Definitions */
#define SYS_GPC_MFPL_PC0_MFP_Pos 0                                                                        /*!< SYS GPC_MFPL: PC0_MFP Position */
#define SYS_GPC_MFPL_PC0_MFP_Msk    (0xFul<<SYS_GPC_MFPL_PC0_MFP_Pos)            /*!< SYS GPC_MFPL: PC0_MFP Mask  */

#define SYS_GPC_MFPL_PC1_MFP_Pos 4                                                                        /*!< SYS GPC_MFPL: PC1_MFP Position */
#define SYS_GPC_MFPL_PC1_MFP_Msk    (0xFul<<SYS_GPC_MFPL_PC1_MFP_Pos)            /*!< SYS GPC_MFPL: PC1_MFP Mask  */

#define SYS_GPC_MFPL_PC2_MFP_Pos 8                                                                        /*!< SYS GPC_MFPL: PC2_MFP Position */
#define SYS_GPC_MFPL_PC2_MFP_Msk    (0xFul<<SYS_GPC_MFPL_PC2_MFP_Pos)            /*!< SYS GPC_MFPL: PC2_MFP Mask */

#define SYS_GPC_MFPL_PC3_MFP_Pos 12                                                                        /*!< SYS GPC_MFPL: PC3_MFP Position */
#define SYS_GPC_MFPL_PC3_MFP_Msk    (0xFul<<SYS_GPC_MFPL_PC3_MFP_Pos)            /*!< SYS GPC_MFPL: PC3_MFP Mask */

#define SYS_GPC_MFPL_PC4_MFP_Pos 16                                                                        /*!< SYS GPC_MFPL: PC4_MFP Position */
#define SYS_GPC_MFPL_PC4_MFP_Msk    (0xFul<<SYS_GPC_MFPL_PC4_MFP_Pos)            /*!< SYS GPC_MFPL: PC4_MFP Mask */

#define SYS_GPC_MFPL_PC5_MFP_Pos 20                                                                        /*!< SYS GPC_MFPL: PC5_MFP Position */
#define SYS_GPC_MFPL_PC5_MFP_Msk    (0xFul<<SYS_GPC_MFPL_PC5_MFP_Pos)            /*!< SYS GPC_MFPL: PC5_MFP Mask */

#define SYS_GPC_MFPL_PC6_MFP_Pos 24                                                                        /*!< SYS GPC_MFPL: PC6_MFP Position */
#define SYS_GPC_MFPL_PC6_MFP_Msk    (0xFul<<SYS_GPC_MFPL_PC6_MFP_Pos)            /*!< SYS GPC_MFPL: PC6_MFP Mask */

#define SYS_GPC_MFPL_PC7_MFP_Pos 28                                                                        /*!< SYS GPC_MFPL: PC7_MFP Position */
#define SYS_GPC_MFPL_PC7_MFP_Msk    (0xFul<<SYS_GPC_MFPL_PC7_MFP_Pos)            /*!< SYS GPC_MFPL: PC7_MFP Mask */

/* SYS GPC_MFPH Bit Field Definitions */
#define SYS_GPC_MFPH_PC8_MFP_Pos 0                                                                        /*!< SYS GPC_MFPH: PC8_MFP Position */
#define SYS_GPC_MFPH_PC8_MFP_Msk    (0xFul<<SYS_GPC_MFPH_PC8_MFP_Pos)            /*!< SYS GPC_MFPH: PC8_MFP Mask  */

#define SYS_GPC_MFPH_PC9_MFP_Pos 4                                                                        /*!< SYS GPC_MFPH: PC9_MFP Position */
#define SYS_GPC_MFPH_PC9_MFP_Msk    (0xFul<<SYS_GPC_MFPH_PC9_MFP_Pos)            /*!< SYS GPC_MFPH: PC9_MFP Mask  */

#define SYS_GPC_MFPH_PC10_MFP_Pos 8                                                                        /*!< SYS GPC_MFPH: PC10_MFP Position */
#define SYS_GPC_MFPH_PC10_MFP_Msk    (0xFul<<SYS_GPC_MFPH_PC10_MFP_Pos)        /*!< SYS GPC_MFPH: PC10_MFP Mask */

#define SYS_GPC_MFPH_PC11_MFP_Pos 12                                                                    /*!< SYS GPC_MFPH: PC11_MFP Position */
#define SYS_GPC_MFPH_PC11_MFP_Msk    (0xFul<<SYS_GPC_MFPH_PC11_MFP_Pos)        /*!< SYS GPC_MFPH: PC11_MFP Mask */

#define SYS_GPC_MFPH_PC12_MFP_Pos 16                                                                    /*!< SYS GPC_MFPH: PC12_MFP Position */
#define SYS_GPC_MFPH_PC12_MFP_Msk    (0xFul<<SYS_GPC_MFPH_PC12_MFP_Pos)        /*!< SYS GPC_MFPH: PC12_MFP Mask */

#define SYS_GPC_MFPH_PC13_MFP_Pos 20                                                                    /*!< SYS GPC_MFPH: PC13_MFP Position */
#define SYS_GPC_MFPH_PC13_MFP_Msk    (0xFul<<SYS_GPC_MFPH_PC13_MFP_Pos)        /*!< SYS GPC_MFPH: PC13_MFP Mask */

#define SYS_GPC_MFPH_PC14_MFP_Pos 24                                                                    /*!< SYS GPC_MFPH: PC14_MFP Position */
#define SYS_GPC_MFPH_PC14_MFP_Msk    (0xFul<<SYS_GPC_MFPH_PC14_MFP_Pos)        /*!< SYS GPC_MFPH: PC14_MFP Mask */

