coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SYS_GPC_MFPH_PC15_MFP_Pos 28                                                                    /*!< SYS GPC_MFPH: PC15_MFP Position */
#define SYS_GPC_MFPH_PC15_MFP_Msk    (0xFul<<SYS_GPC_MFPH_PC15_MFP_Pos)        /*!< SYS GPC_MFPH: PC15_MFP Mask */

/* SYS GPD_MFPL Bit Field Definitions */
#define SYS_GPD_MFPL_PD0_MFP_Pos 0                                                                        /*!< SYS GPD_MFPL: PD0_MFP Position */
#define SYS_GPD_MFPL_PD0_MFP_Msk    (0xFul<<SYS_GPD_MFPL_PD0_MFP_Pos)            /*!< SYS GPD_MFPL: PD0_MFP Mask  */

#define SYS_GPD_MFPL_PD1_MFP_Pos 4                                                                        /*!< SYS GPD_MFPL: PD1_MFP Position */
#define SYS_GPD_MFPL_PD1_MFP_Msk    (0xFul<<SYS_GPD_MFPL_PD1_MFP_Pos)            /*!< SYS GPD_MFPL: PD1_MFP Mask  */

#define SYS_GPD_MFPL_PD2_MFP_Pos 8                                                                        /*!< SYS GPD_MFPL: PD2_MFP Position */
#define SYS_GPD_MFPL_PD2_MFP_Msk    (0xFul<<SYS_GPD_MFPL_PD2_MFP_Pos)            /*!< SYS GPD_MFPL: PD2_MFP Mask */

#define SYS_GPD_MFPL_PD3_MFP_Pos 12                                                                        /*!< SYS GPD_MFPL: PD3_MFP Position */
#define SYS_GPD_MFPL_PD3_MFP_Msk    (0xFul<<SYS_GPD_MFPL_PD3_MFP_Pos)            /*!< SYS GPD_MFPL: PD3_MFP Mask */

#define SYS_GPD_MFPL_PD4_MFP_Pos 16                                                                        /*!< SYS GPD_MFPL: PD4_MFP Position */
#define SYS_GPD_MFPL_PD4_MFP_Msk    (0xFul<<SYS_GPD_MFPL_PD4_MFP_Pos)            /*!< SYS GPD_MFPL: PD4_MFP Mask */

#define SYS_GPD_MFPL_PD5_MFP_Pos 20                                                                        /*!< SYS GPD_MFPL: PD5_MFP Position */
#define SYS_GPD_MFPL_PD5_MFP_Msk    (0xFul<<SYS_GPD_MFPL_PD5_MFP_Pos)            /*!< SYS GPD_MFPL: PD5_MFP Mask */

#define SYS_GPD_MFPL_PD6_MFP_Pos 24                                                                        /*!< SYS GPD_MFPL: PD6_MFP Position */
#define SYS_GPD_MFPL_PD6_MFP_Msk    (0xFul<<SYS_GPD_MFPL_PD6_MFP_Pos)            /*!< SYS GPD_MFPL: PD6_MFP Mask */

#define SYS_GPD_MFPL_PD7_MFP_Pos 28                                                                        /*!< SYS GPD_MFPL: PD7_MFP Position */
#define SYS_GPD_MFPL_PD7_MFP_Msk    (0xFul<<SYS_GPD_MFPL_PD7_MFP_Pos)            /*!< SYS GPD_MFPL: PD7_MFP Mask */

/* SYS GPD_MFPH Bit Field Definitions */
#define SYS_GPD_MFPH_PD8_MFP_Pos 0                                                                        /*!< SYS GPD_MFPH: PD8_MFP Position */
#define SYS_GPD_MFPH_PD8_MFP_Msk    (0xFul<<SYS_GPD_MFPH_PD8_MFP_Pos)            /*!< SYS GPD_MFPH: PD8_MFP Mask  */

#define SYS_GPD_MFPH_PD9_MFP_Pos 4                                                                        /*!< SYS GPD_MFPH: PD9_MFP Position */
#define SYS_GPD_MFPH_PD9_MFP_Msk    (0xFul<<SYS_GPD_MFPH_PD9_MFP_Pos)            /*!< SYS GPD_MFPH: PD9_MFP Mask  */

#define SYS_GPD_MFPH_PD10_MFP_Pos 8                                                                        /*!< SYS GPD_MFPH: PD10_MFP Position */
#define SYS_GPD_MFPH_PD10_MFP_Msk    (0xFul<<SYS_GPD_MFPH_PD10_MFP_Pos)        /*!< SYS GPD_MFPH: PD10_MFP Mask */

#define SYS_GPD_MFPH_PD11_MFP_Pos 12                                                                    /*!< SYS GPD_MFPH: PD11_MFP Position */
#define SYS_GPD_MFPH_PD11_MFP_Msk    (0xFul<<SYS_GPD_MFPH_PD11_MFP_Pos)        /*!< SYS GPD_MFPH: PD11_MFP Mask */

#define SYS_GPD_MFPH_PD12_MFP_Pos 16                                                                    /*!< SYS GPD_MFPH: PD12_MFP Position */
#define SYS_GPD_MFPH_PD12_MFP_Msk    (0xFul<<SYS_GPD_MFPH_PD12_MFP_Pos)        /*!< SYS GPD_MFPH: PD12_MFP Mask */

#define SYS_GPD_MFPH_PD13_MFP_Pos 20                                                                    /*!< SYS GPD_MFPH: PD13_MFP Position */
#define SYS_GPD_MFPH_PD13_MFP_Msk    (0xFul<<SYS_GPD_MFPH_PD13_MFP_Pos)        /*!< SYS GPD_MFPH: PD13_MFP Mask */

#define SYS_GPD_MFPH_PD14_MFP_Pos 24                                                                    /*!< SYS GPD_MFPH: PD14_MFP Position */
#define SYS_GPD_MFPH_PD14_MFP_Msk    (0xFul<<SYS_GPD_MFPH_PD14_MFP_Pos)        /*!< SYS GPD_MFPH: PD14_MFP Mask */

#define SYS_GPD_MFPH_PD15_MFP_Pos 28                                                                    /*!< SYS GPD_MFPH: PD15_MFP Position */
#define SYS_GPD_MFPH_PD15_MFP_Msk    (0xFul<<SYS_GPD_MFPH_PD15_MFP_Pos)        /*!< SYS GPD_MFPH: PD15_MFP Mask */

/* SYS GPE_MFPL Bit Field Definitions */
#define SYS_GPE_MFPL_PE0_MFP_Pos 0                                                                        /*!< SYS GPE_MFPL: PE0_MFP Position */
#define SYS_GPE_MFPL_PE0_MFP_Msk    (0xFul<<SYS_GPE_MFPL_PE0_MFP_Pos)            /*!< SYS GPE_MFPL: PE0_MFP Mask  */

#define SYS_GPE_MFPL_PE1_MFP_Pos 4                                                                        /*!< SYS GPE_MFPL: PE1_MFP Position */
#define SYS_GPE_MFPL_PE1_MFP_Msk    (0xFul<<SYS_GPE_MFPL_PE1_MFP_Pos)            /*!< SYS GPE_MFPL: PE1_MFP Mask  */

#define SYS_GPE_MFPL_PE2_MFP_Pos 8                                                                        /*!< SYS GPE_MFPL: PE2_MFP Position */
#define SYS_GPE_MFPL_PE2_MFP_Msk    (0xFul<<SYS_GPE_MFPL_PE2_MFP_Pos)            /*!< SYS GPE_MFPL: PE2_MFP Mask */

#define SYS_GPE_MFPL_PE3_MFP_Pos 12                                                                        /*!< SYS GPE_MFPL: PE3_MFP Position */
#define SYS_GPE_MFPL_PE3_MFP_Msk    (0xFul<<SYS_GPE_MFPL_PE3_MFP_Pos)            /*!< SYS GPE_MFPL: PE3_MFP Mask */

#define SYS_GPE_MFPL_PE4_MFP_Pos 16                                                                        /*!< SYS GPE_MFPL: PE4_MFP Position */
#define SYS_GPE_MFPL_PE4_MFP_Msk    (0xFul<<SYS_GPE_MFPL_PE4_MFP_Pos)            /*!< SYS GPE_MFPL: PE4_MFP Mask */

#define SYS_GPE_MFPL_PE5_MFP_Pos 20                                                                        /*!< SYS GPE_MFPL: PE5_MFP Position */
#define SYS_GPE_MFPL_PE5_MFP_Msk    (0xFul<<SYS_GPE_MFPL_PE5_MFP_Pos)            /*!< SYS GPE_MFPL: PE5_MFP Mask */

