coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SYS_GPE_MFPL_PE6_MFP_Pos 24                                                                        /*!< SYS GPE_MFPL: PE6_MFP Position */
#define SYS_GPE_MFPL_PE6_MFP_Msk    (0xFul<<SYS_GPE_MFPL_PE6_MFP_Pos)            /*!< SYS GPE_MFPL: PE6_MFP Mask */

#define SYS_GPE_MFPL_PE7_MFP_Pos 28                                                                        /*!< SYS GPE_MFPL: PE7_MFP Position */
#define SYS_GPE_MFPL_PE7_MFP_Msk    (0xFul<<SYS_GPE_MFPL_PE7_MFP_Pos)            /*!< SYS GPE_MFPL: PE7_MFP Mask */

/* SYS GPE_MFPH Bit Field Definitions */
#define SYS_GPE_MFPH_PE8_MFP_Pos 0                                                                        /*!< SYS GPE_MFPH: PE8_MFP Position */
#define SYS_GPE_MFPH_PE8_MFP_Msk    (0xFul<<SYS_GPE_MFPH_PE8_MFP_Pos)            /*!< SYS GPE_MFPH: PE8_MFP Mask  */

#define SYS_GPE_MFPH_PE9_MFP_Pos 4                                                                        /*!< SYS GPE_MFPH: PE9_MFP Position */
#define SYS_GPE_MFPH_PE9_MFP_Msk    (0xFul<<SYS_GPE_MFPH_PE9_MFP_Pos)            /*!< SYS GPE_MFPH: PE9_MFP Mask  */

#define SYS_GPE_MFPH_PE10_MFP_Pos 8                                                                        /*!< SYS GPE_MFPH: PE10_MFP Position */
#define SYS_GPE_MFPH_PE10_MFP_Msk    (0xFul<<SYS_GPE_MFPH_PE10_MFP_Pos)        /*!< SYS GPE_MFPH: PE10_MFP Mask */

#define SYS_GPE_MFPH_PE11_MFP_Pos 12                                                                    /*!< SYS GPE_MFPH: PE11_MFP Position */
#define SYS_GPE_MFPH_PE11_MFP_Msk    (0xFul<<SYS_GPE_MFPH_PE11_MFP_Pos)        /*!< SYS GPE_MFPH: PE11_MFP Mask */

#define SYS_GPE_MFPH_PE12_MFP_Pos 16                                                                    /*!< SYS GPE_MFPH: PE12_MFP Position */
#define SYS_GPE_MFPH_PE12_MFP_Msk    (0xFul<<SYS_GPE_MFPH_PE12_MFP_Pos)        /*!< SYS GPE_MFPH: PE12_MFP Mask */

#define SYS_GPE_MFPH_PE13_MFP_Pos 20                                                                    /*!< SYS GPE_MFPH: PE13_MFP Position */
#define SYS_GPE_MFPH_PE13_MFP_Msk    (0xFul<<SYS_GPE_MFPH_PE13_MFP_Pos)        /*!< SYS GPE_MFPH: PE13_MFP Mask */

#define SYS_GPE_MFPH_PE14_MFP_Pos 24                                                                    /*!< SYS GPE_MFPH: PE14_MFP Position */
#define SYS_GPE_MFPH_PE14_MFP_Msk    (0xFul<<SYS_GPE_MFPH_PE14_MFP_Pos)        /*!< SYS GPE_MFPH: PE14_MFP Mask */

#define SYS_GPE_MFPH_PE15_MFP_Pos 28                                                                    /*!< SYS GPE_MFPH: PE15_MFP Position */
#define SYS_GPE_MFPH_PE15_MFP_Msk    (0xFul<<SYS_GPE_MFPH_PE15_MFP_Pos)        /*!< SYS GPE_MFPH: PE15_MFP Mask */

/* SYS GPF_MFPL Bit Field Definitions */
#define SYS_GPF_MFPL_PF0_MFP_Pos 0                                                                        /*!< SYS GPF_MFPL: PF0_MFP Position */
#define SYS_GPF_MFPL_PF0_MFP_Msk    (0xFul<<SYS_GPF_MFPL_PF0_MFP_Pos)            /*!< SYS GPF_MFPL: PF0_MFP Mask  */

#define SYS_GPF_MFPL_PF1_MFP_Pos 4                                                                        /*!< SYS GPF_MFPL: PF1_MFP Position */
#define SYS_GPF_MFPL_PF1_MFP_Msk    (0xFul<<SYS_GPF_MFPL_PF1_MFP_Pos)            /*!< SYS GPF_MFPL: PF1_MFP Mask  */

#define SYS_GPF_MFPL_PF2_MFP_Pos 8                                                                        /*!< SYS GPF_MFPL: PF2_MFP Position */
#define SYS_GPF_MFPL_PF2_MFP_Msk    (0xFul<<SYS_GPF_MFPL_PF2_MFP_Pos)            /*!< SYS GPF_MFPL: PF2_MFP Mask */

#define SYS_GPF_MFPL_PF3_MFP_Pos 12                                                                        /*!< SYS GPF_MFPL: PF3_MFP Position */
#define SYS_GPF_MFPL_PF3_MFP_Msk    (0xFul<<SYS_GPF_MFPL_PF3_MFP_Pos)            /*!< SYS GPF_MFPL: PF3_MFP Mask */

#define SYS_GPF_MFPL_PF4_MFP_Pos 16                                                                        /*!< SYS GPF_MFPL: PF4_MFP Position */
#define SYS_GPF_MFPL_PF4_MFP_Msk    (0xFul<<SYS_GPF_MFPL_PF4_MFP_Pos)            /*!< SYS GPF_MFPL: PF4_MFP Mask */

#define SYS_GPF_MFPL_PF5_MFP_Pos 20                                                                        /*!< SYS GPF_MFPL: PF5_MFP Position */
#define SYS_GPF_MFPL_PF5_MFP_Msk    (0xFul<<SYS_GPF_MFPL_PF5_MFP_Pos)            /*!< SYS GPF_MFPL: PF5_MFP Mask */

#define SYS_GPF_MFPL_PF6_MFP_Pos 24                                                                        /*!< SYS GPF_MFPL: PF6_MFP Position */
#define SYS_GPF_MFPL_PF6_MFP_Msk    (0xFul<<SYS_GPF_MFPL_PF6_MFP_Pos)            /*!< SYS GPF_MFPL: PF6_MFP Mask */

#define SYS_GPF_MFPL_PF7_MFP_Pos 28                                                                        /*!< SYS GPF_MFPL: PF7_MFP Position */
#define SYS_GPF_MFPL_PF7_MFP_Msk    (0xFul<<SYS_GPF_MFPL_PF7_MFP_Pos)            /*!< SYS GPF_MFPL: PF7_MFP Mask */

/* SYS GPF_MFPH Bit Field Definitions */
#define SYS_GPF_MFPH_PF8_MFP_Pos 0                                                                        /*!< SYS GPF_MFPH: PF8_MFP Position */
#define SYS_GPF_MFPH_PF8_MFP_Msk    (0xFul<<SYS_GPF_MFPH_PF8_MFP_Pos)            /*!< SYS GPF_MFPH: PF8_MFP Mask  */

#define SYS_GPF_MFPH_PF9_MFP_Pos 4                                                                        /*!< SYS GPF_MFPH: PF9_MFP Position */
#define SYS_GPF_MFPH_PF9_MFP_Msk    (0xFul<<SYS_GPF_MFPH_PF9_MFP_Pos)            /*!< SYS GPF_MFPH: PF9_MFP Mask  */

#define SYS_GPF_MFPH_PF10_MFP_Pos 8                                                                        /*!< SYS GPF_MFPH: PF10_MFP Position */
#define SYS_GPF_MFPH_PF10_MFP_Msk    (0xFul<<SYS_GPF_MFPH_PF10_MFP_Pos)        /*!< SYS GPF_MFPH: PF10_MFP Mask */

#define SYS_GPF_MFPH_PF11_MFP_Pos 12                                                                    /*!< SYS GPF_MFPH: PF11_MFP Position */
#define SYS_GPF_MFPH_PF11_MFP_Msk    (0xFul<<SYS_GPF_MFPH_PF11_MFP_Pos)        /*!< SYS GPF_MFPH: PF11_MFP Mask */

#define SYS_GPF_MFPH_PF12_MFP_Pos 16                                                                    /*!< SYS GPF_MFPH: PF12_MFP Position */
#define SYS_GPF_MFPH_PF12_MFP_Msk    (0xFul<<SYS_GPF_MFPH_PF12_MFP_Pos)        /*!< SYS GPF_MFPH: PF12_MFP Mask */

#define SYS_GPF_MFPH_PF13_MFP_Pos 20                                                                    /*!< SYS GPF_MFPH: PF13_MFP Position */
#define SYS_GPF_MFPH_PF13_MFP_Msk    (0xFul<<SYS_GPF_MFPH_PF13_MFP_Pos)        /*!< SYS GPF_MFPH: PF13_MFP Mask */

#define SYS_GPF_MFPH_PF14_MFP_Pos 24                                                                    /*!< SYS GPF_MFPH: PF14_MFP Position */
#define SYS_GPF_MFPH_PF14_MFP_Msk    (0xFul<<SYS_GPF_MFPH_PF14_MFP_Pos)        /*!< SYS GPF_MFPH: PF14_MFP Mask */

#define SYS_GPF_MFPH_PF15_MFP_Pos 28                                                                    /*!< SYS GPF_MFPH: PF15_MFP Position */
#define SYS_GPF_MFPH_PF15_MFP_Msk    (0xFul<<SYS_GPF_MFPH_PF15_MFP_Pos)        /*!< SYS GPF_MFPH: PF15_MFP Mask */

/* SYS GPG_MFPL Bit Field Definitions */
#define SYS_GPG_MFPL_PG0_MFP_Pos 0                                                                        /*!< SYS GPG_MFPL: PG0_MFP Position */
#define SYS_GPG_MFPL_PG0_MFP_Msk    (0xFul<<SYS_GPG_MFPL_PG0_MFP_Pos)            /*!< SYS GPG_MFPL: PG0_MFP Mask  */

#define SYS_GPG_MFPL_PG1_MFP_Pos 4                                                                        /*!< SYS GPG_MFPL: PG1_MFP Position */
#define SYS_GPG_MFPL_PG1_MFP_Msk    (0xFul<<SYS_GPG_MFPL_PG1_MFP_Pos)            /*!< SYS GPG_MFPL: PG1_MFP Mask  */

#define SYS_GPG_MFPL_PG2_MFP_Pos 8                                                                        /*!< SYS GPG_MFPL: PG2_MFP Position */
#define SYS_GPG_MFPL_PG2_MFP_Msk    (0xFul<<SYS_GPG_MFPL_PG2_MFP_Pos)            /*!< SYS GPG_MFPL: PG2_MFP Mask */

#define SYS_GPG_MFPL_PG3_MFP_Pos 12                                                                        /*!< SYS GPG_MFPL: PG3_MFP Position */
#define SYS_GPG_MFPL_PG3_MFP_Msk    (0xFul<<SYS_GPG_MFPL_PG3_MFP_Pos)            /*!< SYS GPG_MFPL: PG3_MFP Mask */

#define SYS_GPG_MFPL_PG4_MFP_Pos 16                                                                        /*!< SYS GPG_MFPL: PG4_MFP Position */
#define SYS_GPG_MFPL_PG4_MFP_Msk    (0xFul<<SYS_GPG_MFPL_PG4_MFP_Pos)            /*!< SYS GPG_MFPL: PG4_MFP Mask */

