coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SYS_GPG_MFPL_PG5_MFP_Pos 20                                                                        /*!< SYS GPG_MFPL: PG5_MFP Position */
#define SYS_GPG_MFPL_PG5_MFP_Msk    (0xFul<<SYS_GPG_MFPL_PG5_MFP_Pos)            /*!< SYS GPG_MFPL: PG5_MFP Mask */

#define SYS_GPG_MFPL_PG6_MFP_Pos 24                                                                        /*!< SYS GPG_MFPL: PG6_MFP Position */
#define SYS_GPG_MFPL_PG6_MFP_Msk    (0xFul<<SYS_GPG_MFPL_PG6_MFP_Pos)            /*!< SYS GPG_MFPL: PG6_MFP Mask */

#define SYS_GPG_MFPL_PG7_MFP_Pos 28                                                                        /*!< SYS GPG_MFPL: PG7_MFP Position */
#define SYS_GPG_MFPL_PG7_MFP_Msk    (0xFul<<SYS_GPG_MFPL_PG7_MFP_Pos)            /*!< SYS GPG_MFPL: PG7_MFP Mask */

/* SYS GPG_MFPH Bit Field Definitions */
#define SYS_GPG_MFPH_PG8_MFP_Pos 0                                                                        /*!< SYS GPG_MFPH: PG8_MFP Position */
#define SYS_GPG_MFPH_PG8_MFP_Msk    (0xFul<<SYS_GPG_MFPH_PG8_MFP_Pos)            /*!< SYS GPG_MFPH: PG8_MFP Mask  */

#define SYS_GPG_MFPH_PG9_MFP_Pos 4                                                                        /*!< SYS GPG_MFPH: PG9_MFP Position */
#define SYS_GPG_MFPH_PG9_MFP_Msk    (0xFul<<SYS_GPG_MFPH_PG9_MFP_Pos)            /*!< SYS GPG_MFPH: PG9_MFP Mask  */

#define SYS_GPG_MFPH_PG10_MFP_Pos 8                                                                        /*!< SYS GPG_MFPH: PG10_MFP Position */
#define SYS_GPG_MFPH_PG10_MFP_Msk    (0xFul<<SYS_GPG_MFPH_PG10_MFP_Pos)        /*!< SYS GPG_MFPH: PG10_MFP Mask */

#define SYS_GPG_MFPH_PG11_MFP_Pos 12                                                                    /*!< SYS GPG_MFPH: PG11_MFP Position */
#define SYS_GPG_MFPH_PG11_MFP_Msk    (0xFul<<SYS_GPG_MFPH_PG11_MFP_Pos)        /*!< SYS GPG_MFPH: PG11_MFP Mask */

#define SYS_GPG_MFPH_PG12_MFP_Pos 16                                                                    /*!< SYS GPG_MFPH: PG12_MFP Position */
#define SYS_GPG_MFPH_PG12_MFP_Msk    (0xFul<<SYS_GPG_MFPH_PG12_MFP_Pos)        /*!< SYS GPG_MFPH: PG12_MFP Mask */

#define SYS_GPG_MFPH_PG13_MFP_Pos 20                                                                    /*!< SYS GPG_MFPH: PG13_MFP Position */
#define SYS_GPG_MFPH_PG13_MFP_Msk    (0xFul<<SYS_GPG_MFPH_PG13_MFP_Pos)        /*!< SYS GPG_MFPH: PG13_MFP Mask */

#define SYS_GPG_MFPH_PG14_MFP_Pos 24                                                                    /*!< SYS GPG_MFPH: PG14_MFP Position */
#define SYS_GPG_MFPH_PG14_MFP_Msk    (0xFul<<SYS_GPG_MFPH_PG14_MFP_Pos)        /*!< SYS GPG_MFPH: PG14_MFP Mask */

#define SYS_GPG_MFPH_PG15_MFP_Pos 28                                                                    /*!< SYS GPG_MFPH: PG15_MFP Position */
#define SYS_GPG_MFPH_PG15_MFP_Msk    (0xFul<<SYS_GPG_MFPH_PG15_MFP_Pos)        /*!< SYS GPG_MFPH: PG15_MFP Mask */

/* SYS GPH_MFPL Bit Field Definitions */
#define SYS_GPH_MFPL_PH0_MFP_Pos 0                                                                        /*!< SYS GPH_MFPL: PH0_MFP Position */
#define SYS_GPH_MFPL_PH0_MFP_Msk    (0xFul<<SYS_GPH_MFPL_PH0_MFP_Pos)            /*!< SYS GPH_MFPL: PH0_MFP Mask  */

#define SYS_GPH_MFPL_PH1_MFP_Pos 4                                                                        /*!< SYS GPH_MFPL: PH1_MFP Position */
#define SYS_GPH_MFPL_PH1_MFP_Msk    (0xFul<<SYS_GPH_MFPL_PH1_MFP_Pos)            /*!< SYS GPH_MFPL: PH1_MFP Mask  */

#define SYS_GPH_MFPL_PH2_MFP_Pos 8                                                                        /*!< SYS GPH_MFPL: PH2_MFP Position */
#define SYS_GPH_MFPL_PH2_MFP_Msk    (0xFul<<SYS_GPH_MFPL_PH2_MFP_Pos)            /*!< SYS GPH_MFPL: PH2_MFP Mask */

#define SYS_GPH_MFPL_PH3_MFP_Pos 12                                                                        /*!< SYS GPH_MFPL: PH3_MFP Position */
#define SYS_GPH_MFPL_PH3_MFP_Msk    (0xFul<<SYS_GPH_MFPL_PH3_MFP_Pos)            /*!< SYS GPH_MFPL: PH3_MFP Mask */

#define SYS_GPH_MFPL_PH4_MFP_Pos 16                                                                        /*!< SYS GPH_MFPL: PH4_MFP Position */
#define SYS_GPH_MFPL_PH4_MFP_Msk    (0xFul<<SYS_GPH_MFPL_PH4_MFP_Pos)            /*!< SYS GPH_MFPL: PH4_MFP Mask */

#define SYS_GPH_MFPL_PH5_MFP_Pos 20                                                                        /*!< SYS GPH_MFPL: PH5_MFP Position */
#define SYS_GPH_MFPL_PH5_MFP_Msk    (0xFul<<SYS_GPH_MFPL_PH5_MFP_Pos)            /*!< SYS GPH_MFPL: PH5_MFP Mask */

#define SYS_GPH_MFPL_PH6_MFP_Pos 24                                                                        /*!< SYS GPH_MFPL: PH6_MFP Position */
#define SYS_GPH_MFPL_PH6_MFP_Msk    (0xFul<<SYS_GPH_MFPL_PH6_MFP_Pos)            /*!< SYS GPH_MFPL: PH6_MFP Mask */

#define SYS_GPH_MFPL_PH7_MFP_Pos 28                                                                        /*!< SYS GPH_MFPL: PH7_MFP Position */
#define SYS_GPH_MFPL_PH7_MFP_Msk    (0xFul<<SYS_GPH_MFPL_PH7_MFP_Pos)            /*!< SYS GPH_MFPL: PH7_MFP Mask */

/* SYS GPH_MFPH Bit Field Definitions */
#define SYS_GPH_MFPH_PH8_MFP_Pos 0                                                                        /*!< SYS GPH_MFPH: PH8_MFP Position */
#define SYS_GPH_MFPH_PH8_MFP_Msk    (0xFul<<SYS_GPH_MFPH_PH8_MFP_Pos)            /*!< SYS GPH_MFPH: PH8_MFP Mask  */

#define SYS_GPH_MFPH_PH9_MFP_Pos 4                                                                        /*!< SYS GPH_MFPH: PH9_MFP Position */
#define SYS_GPH_MFPH_PH9_MFP_Msk    (0xFul<<SYS_GPH_MFPH_PH9_MFP_Pos)            /*!< SYS GPH_MFPH: PH9_MFP Mask  */

#define SYS_GPH_MFPH_PH10_MFP_Pos 8                                                                        /*!< SYS GPH_MFPH: PH10_MFP Position */
#define SYS_GPH_MFPH_PH10_MFP_Msk    (0xFul<<SYS_GPH_MFPH_PH10_MFP_Pos)        /*!< SYS GPH_MFPH: PH10_MFP Mask */

#define SYS_GPH_MFPH_PH11_MFP_Pos 12                                                                    /*!< SYS GPH_MFPH: PH11_MFP Position */
#define SYS_GPH_MFPH_PH11_MFP_Msk    (0xFul<<SYS_GPH_MFPH_PH11_MFP_Pos)        /*!< SYS GPH_MFPH: PH11_MFP Mask */

