coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SYS_GPH_MFPH_PH12_MFP_Pos 16                                                                    /*!< SYS GPH_MFPH: PH12_MFP Position */
#define SYS_GPH_MFPH_PH12_MFP_Msk    (0xFul<<SYS_GPH_MFPH_PH12_MFP_Pos)        /*!< SYS GPH_MFPH: PH12_MFP Mask */

#define SYS_GPH_MFPH_PH13_MFP_Pos 20                                                                    /*!< SYS GPH_MFPH: PH13_MFP Position */
#define SYS_GPH_MFPH_PH13_MFP_Msk    (0xFul<<SYS_GPH_MFPH_PH13_MFP_Pos)        /*!< SYS GPH_MFPH: PH13_MFP Mask */

#define SYS_GPH_MFPH_PH14_MFP_Pos 24                                                                    /*!< SYS GPH_MFPH: PH14_MFP Position */
#define SYS_GPH_MFPH_PH14_MFP_Msk    (0xFul<<SYS_GPH_MFPH_PH14_MFP_Pos)        /*!< SYS GPH_MFPH: PH14_MFP Mask */

#define SYS_GPH_MFPH_PH15_MFP_Pos 28                                                                    /*!< SYS GPH_MFPH: PH15_MFP Position */
#define SYS_GPH_MFPH_PH15_MFP_Msk    (0xFul<<SYS_GPH_MFPH_PH15_MFP_Pos)        /*!< SYS GPH_MFPH: PH15_MFP Mask */

/* SYS GPI_MFPL Bit Field Definitions */
#define SYS_GPI_MFPL_PI0_MFP_Pos 0                                                                        /*!< SYS GPI_MFPL: PI0_MFP Position */
#define SYS_GPI_MFPL_PI0_MFP_Msk    (0xFul<<SYS_GPI_MFPL_PI0_MFP_Pos)            /*!< SYS GPI_MFPL: PI0_MFP Mask  */

#define SYS_GPI_MFPL_PI1_MFP_Pos 4                                                                        /*!< SYS GPI_MFPL: PI1_MFP Position */
#define SYS_GPI_MFPL_PI1_MFP_Msk    (0xFul<<SYS_GPI_MFPL_PI1_MFP_Pos)            /*!< SYS GPI_MFPL: PI1_MFP Mask  */

#define SYS_GPI_MFPL_PI2_MFP_Pos 8                                                                        /*!< SYS GPI_MFPL: PI2_MFP Position */
#define SYS_GPI_MFPL_PI2_MFP_Msk    (0xFul<<SYS_GPI_MFPL_PI2_MFP_Pos)            /*!< SYS GPI_MFPL: PI2_MFP Mask */

#define SYS_GPI_MFPL_PI3_MFP_Pos 12                                                                        /*!< SYS GPI_MFPL: PI3_MFP Position */
#define SYS_GPI_MFPL_PI3_MFP_Msk    (0xFul<<SYS_GPI_MFPL_PI3_MFP_Pos)            /*!< SYS GPI_MFPL: PI3_MFP Mask */

#define SYS_GPI_MFPL_PI4_MFP_Pos 16                                                                        /*!< SYS GPI_MFPL: PI4_MFP Position */
#define SYS_GPI_MFPL_PI4_MFP_Msk    (0xFul<<SYS_GPI_MFPL_PI4_MFP_Pos)            /*!< SYS GPI_MFPL: PI4_MFP Mask */

#define SYS_GPI_MFPL_PI5_MFP_Pos 20                                                                        /*!< SYS GPI_MFPL: PI5_MFP Position */
#define SYS_GPI_MFPL_PI5_MFP_Msk    (0xFul<<SYS_GPI_MFPL_PI5_MFP_Pos)            /*!< SYS GPI_MFPL: PI5_MFP Mask */

#define SYS_GPI_MFPL_PI6_MFP_Pos 24                                                                        /*!< SYS GPI_MFPL: PI6_MFP Position */
#define SYS_GPI_MFPL_PI6_MFP_Msk    (0xFul<<SYS_GPI_MFPL_PI6_MFP_Pos)            /*!< SYS GPI_MFPL: PI6_MFP Mask */

#define SYS_GPI_MFPL_PI7_MFP_Pos 28                                                                        /*!< SYS GPI_MFPL: PI7_MFP Position */
#define SYS_GPI_MFPL_PI7_MFP_Msk    (0xFul<<SYS_GPI_MFPL_PI7_MFP_Pos)            /*!< SYS GPI_MFPL: PI7_MFP Mask */

/* SYS GPI_MFPH Bit Field Definitions */
#define SYS_GPI_MFPH_PI8_MFP_Pos 0                                                                        /*!< SYS GPI_MFPH: PI8_MFP Position */
#define SYS_GPI_MFPH_PI8_MFP_Msk    (0xFul<<SYS_GPI_MFPH_PI8_MFP_Pos)            /*!< SYS GPI_MFPH: PI8_MFP Mask  */

#define SYS_GPI_MFPH_PI9_MFP_Pos 4                                                                        /*!< SYS GPI_MFPH: PI9_MFP Position */
#define SYS_GPI_MFPH_PI9_MFP_Msk    (0xFul<<SYS_GPI_MFPH_PI9_MFP_Pos)            /*!< SYS GPI_MFPH: PI9_MFP Mask  */

#define SYS_GPI_MFPH_PI10_MFP_Pos 8                                                                        /*!< SYS GPI_MFPH: PI10_MFP Position */
#define SYS_GPI_MFPH_PI10_MFP_Msk    (0xFul<<SYS_GPI_MFPH_PI10_MFP_Pos)        /*!< SYS GPI_MFPH: PI10_MFP Mask */

#define SYS_GPI_MFPH_PI11_MFP_Pos 12                                                                    /*!< SYS GPI_MFPH: PI11_MFP Position */
#define SYS_GPI_MFPH_PI11_MFP_Msk    (0xFul<<SYS_GPI_MFPH_PI11_MFP_Pos)        /*!< SYS GPI_MFPH: PI11_MFP Mask */

#define SYS_GPI_MFPH_PI12_MFP_Pos 16                                                                    /*!< SYS GPI_MFPH: PI12_MFP Position */
#define SYS_GPI_MFPH_PI12_MFP_Msk    (0xFul<<SYS_GPI_MFPH_PI12_MFP_Pos)        /*!< SYS GPI_MFPH: PI12_MFP Mask */

#define SYS_GPI_MFPH_PI13_MFP_Pos 20                                                                    /*!< SYS GPI_MFPH: PI13_MFP Position */
#define SYS_GPI_MFPH_PI13_MFP_Msk    (0xFul<<SYS_GPI_MFPH_PI13_MFP_Pos)        /*!< SYS GPI_MFPH: PI13_MFP Mask */

#define SYS_GPI_MFPH_PI14_MFP_Pos 24                                                                    /*!< SYS GPI_MFPH: PI14_MFP Position */
#define SYS_GPI_MFPH_PI14_MFP_Msk    (0xFul<<SYS_GPI_MFPH_PI14_MFP_Pos)        /*!< SYS GPI_MFPH: PI14_MFP Mask */

#define SYS_GPI_MFPH_PI15_MFP_Pos 28                                                                    /*!< SYS GPI_MFPH: PI15_MFP Position */
#define SYS_GPI_MFPH_PI15_MFP_Msk    (0xFul<<SYS_GPI_MFPH_PI15_MFP_Pos)        /*!< SYS GPI_MFPH: PI15_MFP Mask */

/* SYS SRAMFINTCR Bit Field Definitions */
#define SYS_SRAMFINTCR_SRAMFINTEN_Pos 0                                                                            /*!< SYS SRAMFINTCR: SRAMFINTEN Position */
#define SYS_SRAMFINTCR_SRAMFINTEN_Msk    (1ul<<SYS_SRAMFINTCR_SRAMFINTEN_Pos)        /*!< SYS SRAMFINTCR: SRAMFINTEN Mask */

/* SYS SRAMF Bit Field Definitions */
#define SYS_SRAMF_SRAMF0_Pos 0                                                                                /*!< SYS SRAMF: SRAMF0 Position */
#define SYS_SRAMF_SRAMF0_Msk    (1ul<<SYS_SRAMF_SRAMF0_Pos)                                /*!< SYS SRAMF: SRAMF0 Mask */

#define SYS_SRAMF_SRAMF1_Pos 1                                                                                /*!< SYS SRAMF: SRAMF1 Position */
#define SYS_SRAMF_SRAMF1_Msk    (1ul<<SYS_SRAMF_SRAMF1_Pos)                                /*!< SYS SRAMF: SRAMF1 Mask */

/* SYS SRAMF_ADDR Bit Field Definitions */
#define SYS_SRAM0F_ADDR_SRAM0F_ADDR_Pos 0                                                                                                /*!< SYS SRAM0F_ADDR: SRAM0F_ADDR Position */
#define SYS_SRAM0F_ADDR_SRAM0F_ADDR_Msk    (0xFFFFFFFFul<<SYS_SRAM0F_ADDR_SRAM0F_ADDR_Pos)        /*!< SYS SRAM0F_ADDR: SRAM0F_ADDR Mask */

/* SYS SRAMF_ADDR2 Bit Field Definitions */
#define SYS_SRAM1F_ADDR_SRAM1F_ADDR_Pos 0                                                                                                /*!< SYS SRAM1F_ADDR: SRAM1F_ADDR Position */
#define SYS_SRAM1F_ADDR_SRAM1F_ADDR_Msk    (0xFFFFFFFFul<<SYS_SRAM1F_ADDR_SRAM1F_ADDR_Pos)        /*!< SYS SRAM1F_ADDR: SRAM1F_ADDR Mask */

/* SYS IRCTRIMCTL Bit Field Definitions */
#define SYS_IRCTRIMCTL_TRIM_SEL_Pos 0                                                                                                    /*!< SYS IRCTRIMCTL: TRIM_SEL Position */
#define SYS_IRCTRIMCTL_TRIM_SEL_Msk    (0x3ul<<SYS_IRCTRIMCTL_TRIM_SEL_Pos)                                /*!< SYS IRCTRIMCTL: TRIM_SEL Mask */

#define SYS_IRCTRIMCTL_TRIM_LOOP_Pos 4                                                                                                /*!< SYS IRCTRIMCTL: TRIM_LOOP Position */
#define SYS_IRCTRIMCTL_TRIM_LOOP_Msk    (0x3ul<<SYS_IRCTRIMCTL_TRIM_LOOP_Pos)                            /*!< SYS IRCTRIMCTL: TRIM_LOOP Mask */

#define SYS_IRCTRIMCTL_TRIM_RETRY_CNT_Pos 6                                                                                        /*!< SYS IRCTRIMCTL: TRIM_RETRY_CNT Position */
#define SYS_IRCTRIMCTL_TRIM_RETRY_CNT_Msk    (0x3ul<<SYS_IRCTRIMCTL_TRIM_RETRY_CNT_Pos)        /*!< SYS IRCTRIMCTL: TRIM_RETRY_CNT Mask */

#define SYS_IRCTRIMCTL_CLKERR_STOP_EN_Pos 8                                                                                        /*!< SYS IRCTRIMCTL: CLKERR_STOP_EN Position */
#define SYS_IRCTRIMCTL_CLKERR_STOP_EN_Msk    (1ul<<SYS_IRCTRIMCTL_CLKERR_STOP_EN_Pos)            /*!< SYS IRCTRIMCTL: CLKERR_STOP_EN Mask */
/* SYS IRCTRIMIEN Bit Field Definitions */
#define SYS_IRCTRIMIEN_TRIM_FAIL_IEN_Pos 1                                                                                        /*!< SYS IRCTRIMIEN: TRIM_FAIL_IEN Position */
#define SYS_IRCTRIMIEN_TRIM_FAIL_IEN_Msk    (1ul<<SYS_IRCTRIMIEN_TRIM_FAIL_IEN_Pos)                /*!< SYS IRCTRIMIEN: TRIM_FAIL_IEN Mask */

#define SYS_IRCTRIMIEN_CLKERR_IEN_Pos 2                                                                                                /*!< SYS IRCTRIMIEN: CLKERR_IEN Position */
#define SYS_IRCTRIMIEN_CLKERR_IEN_Msk    (1ul<<SYS_IRCTRIMIEN_CLKERR_IEN_Pos)                            /*!< SYS IRCTRIMIEN: CLKERR_IEN Mask */

