coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* SYS IRCTRIMINT Bit Field Definitions */
#define SYS_IRCTRIMINT_FREQ_LOCK_Pos 0                                                                                                /*!< SYS IRCTRIMINT: FREQ_LOCK Position */
#define SYS_IRCTRIMINT_FREQ_LOCK_Msk    (1ul<<SYS_IRCTRIMINT_FREQ_LOCK_Pos)                                /*!< SYS IRCTRIMINT: FREQ_LOCK Mask */

#define SYS_IRCTRIMINT_TRIM_FAIL_INT_Pos 1                                                                                        /*!< SYS IRCTRIMINT: TRIM_FAIL_INT Position */
#define SYS_IRCTRIMINT_TRIM_FAIL_INT_Msk    (1ul<<SYS_IRCTRIMINT_TRIM_FAIL_INT_Pos)                /*!< SYS IRCTRIMINT: TRIM_FAIL_INT Mask */

#define SYS_IRCTRIMINT_CLKERR_INT_Pos 2                                                                                                /*!< SYS IRCTRIMINT: CLKERR_INT Position */
#define SYS_IRCTRIMINT_CLKERR_INT_Msk    (1ul<<SYS_IRCTRIMINT_CLKERR_INT_Pos)                            /*!< SYS IRCTRIMINT: CLKERR_INT Mask */

/* SYS REGWRPROT Bit Field Definitions */
#define SYS_REGWRPROT_REGPROTDIS_Pos 0                                                                                                /*!< SYS REGWRPROT: REGPROTDIS Position */
#define SYS_REGWRPROT_REGPROTDIS_Msk    (1ul<<SYS_REGWRPROT_REGPROTDIS_Pos)                            /*!< SYS REGWRPROT: REGPROTDIS Mask */

#define SYS_REGWRPROT_REGWRPROT_Pos 1                                                                                                /*!< SYS REGWRPROT: REGWRPROT Position */
#define SYS_REGWRPROT_REGWRPROT_Msk    (0x7Ful<<SYS_REGWRPROT_REGWRPROT_Pos)                            /*!< SYS REGWRPROT: REGWRPROT Mask */


/*@}*/ /* end of group NUC400_GCR */


/*------------- Clock Control Register (CLK) -----------------------------*/
/** @addtogroup NUC400_CLK NUC400 Clock Control Register (CLK)
  @{
*/
typedef struct {
    __IO uint32_t PWRCON;                        /*!< Offset: 0x0000   System Power Down Register                          */
    __IO uint32_t AHBCLK;                        /*!< Offset: 0x0004   AHB Devices Clock Enable Control Register          */
    __IO uint32_t APBCLK0;                    /*!< Offset: 0x0008   APB Devices Clock Enable Control Register          */
    __IO uint32_t APBCLK1;                    /*!< Offset: 0x000C   APB Devices Clock Enable Control Register 1        */
    __IO uint32_t CLKSEL0;                    /*!< Offset: 0x0010   Clock Source Select Control Register 0             */
    __IO uint32_t CLKSEL1;                    /*!< Offset: 0x0014   Clock Source Select Control Register 1             */
    __IO uint32_t CLKSEL2;                    /*!< Offset: 0x0018   Clock Source Select Control Register 2             */
    __IO uint32_t CLKSEL3;                    /*!< Offset: 0x001C   Clock Source Select Control Register 3             */
    __IO uint32_t CLKDIV0;                    /*!< Offset: 0x0020   Clock Divider Number Register    0                     */
    __IO uint32_t CLKDIV1;                    /*!< Offset: 0x0024   Clock Divider Number Register    1                     */
    __IO uint32_t CLKDIV2;                    /*!< Offset: 0x0028   Clock Divider Number Register    2                     */
    __IO uint32_t CLKDIV3;                    /*!< Offset: 0x002C   Clock Divider Number Register    3                     */
    uint32_t RESERVED0[4];                /*!< Offset: 0x0030 ~ 0x003C  Reserved                                   */
    __IO uint32_t PLLCON;                        /*!< Offset: 0x0040   PLL Control Register                                 */
    __IO uint32_t PLL2CON;                    /*!< Offset: 0x0044   PLL2 Control Register                                 */
    uint32_t RESERVED1[2];                /*!< Offset: 0x0048 ~ 0x004C  Reserved                                   */
    __IO uint32_t CLKSTATUS;                    /*!< Offset: 0x0050   Clock Status Monitor Register                      */
    uint32_t RESERVED2[3];                /*!< Offset: 0x0054 ~ 0x005C  Reserved                                   */
    __IO uint32_t FRQDIV;                        /*!< Offset: 0x0060   Frequency Divider Control Register                 */
    uint32_t RESERVED3[3];                /*!< Offset: 0x0064 ~ 0x006C  Reserved                                   */
    __IO uint32_t CLKFCR;                           /*!< Offset: 0x0070   Clock Stop Detector Control Register               */
    uint32_t RESERVED4[31];                /*!< Offset: 0x0074 ~ 0x00EC  Reserved                                   */
    __IO uint32_t CLKTRIM;                        /*!< Offset: 0x00F0   TRIM control  register                             */
} CLK_T;

/* CLK PWRCON Bit Field Definitions */
#define CLK_PWRCON_HXT_EN_Pos    0                                          /*!< CLK PWRCON: XTL12M_EN Position */
#define CLK_PWRCON_HXT_EN_Msk    (1ul<<CLK_PWRCON_HXT_EN_Pos)              /*!< CLK PWRCON: XTL12M_EN Mask */

#define CLK_PWRCON_LXT_EN_Pos    1                                          /*!< CLK PWRCON: XTL32K_EN Position */
#define CLK_PWRCON_LXT_EN_Msk    (1ul<<CLK_PWRCON_LXT_EN_Pos)              /*!< CLK PWRCON: XTL32K_EN Mask */

#define CLK_PWRCON_HIRC_EN_Pos    2                                          /*!< CLK PWRCON: OSC22M_EN Position */
#define CLK_PWRCON_HIRC_EN_Msk    (1ul<<CLK_PWRCON_HIRC_EN_Pos)              /*!< CLK PWRCON: OSC22M_EN Mask */

#define CLK_PWRCON_LIRC_EN_Pos    3                                          /*!< CLK PWRCON: OSC10K_EN Position */
#define CLK_PWRCON_LIRC_EN_Msk    (1ul<<CLK_PWRCON_LIRC_EN_Pos)              /*!< CLK PWRCON: OSC10K_EN Mask */

#define CLK_PWRCON_PD_WU_DLY_Pos    4                                          /*!< CLK PWRCON: PD_WU_DLY Position */
#define CLK_PWRCON_PD_WU_DLY_Msk    (1ul<<CLK_PWRCON_PD_WU_DLY_Pos)              /*!< CLK PWRCON: PD_WU_DLY Mask */

#define CLK_PWRCON_PD_WU_INT_EN_Pos    5                                          /*!< CLK PWRCON: PD_WU_INT_EN Position */
#define CLK_PWRCON_PD_WU_INT_EN_Msk    (1ul<<CLK_PWRCON_PD_WU_INT_EN_Pos)          /*!< CLK PWRCON: PD_WU_INT_EN Mask */

