coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define CLK_PWRCON_PD_WU_STS_Pos    6                                          /*!< CLK PWRCON: PD_WU_STS Position */
#define CLK_PWRCON_PD_WU_STS_Msk    (1ul<<CLK_PWRCON_PD_WU_STS_Pos)              /*!< CLK PWRCON: PD_WU_STS Mask */

#define CLK_PWRCON_PWR_DOWN_EN_Pos    7                                          /*!< CLK PWRCON: PWR_DOWN_EN Position */
#define CLK_PWRCON_PWR_DOWN_EN_Msk    (1ul<<CLK_PWRCON_PWR_DOWN_EN_Pos)              /*!< CLK PWRCON: PWR_DOWN_EN Mask */

#define CLK_PWRCON_PD_WAIT_CPU_Pos    8                                          /*!< CLK PWRCON: PD_WAIT_CPU Position */
#define CLK_PWRCON_PD_WAIT_CPU_Msk    (1ul<<CLK_PWRCON_PD_WAIT_CPU_Pos)              /*!< CLK PWRCON: PD_WAIT_CPU Mask */

#define CLK_PWRCON_DBPDEN_Pos    9                                              /*!< CLK PWRCON: DBPDEN Position */
#define CLK_PWRCON_DBPDEN_Msk    (1ul<<CLK_PWRCON_DBPDEN_Pos)                      /*!< CLK PWRCON: DBPDEN Mask */
/* CLK AHBCLK Bit Field Definitions */
#define CLK_AHBCLK_PDMA_EN_Pos    1                                              /*!< CLK AHBCLK: PDMA_EN Position */
#define CLK_AHBCLK_PDMA_EN_Msk    (1ul<<CLK_AHBCLK_PDMA_EN_Pos)                      /*!< CLK AHBCLK: PDMA_EN Mask */

#define CLK_AHBCLK_ISP_EN_Pos    2                                              /*!< CLK AHBCLK: ISP_EN Position */
#define CLK_AHBCLK_ISP_EN_Msk    (1ul<<CLK_AHBCLK_ISP_EN_Pos)                      /*!< CLK AHBCLK: ISP_EN Mask */

#define CLK_AHBCLK_EBI_EN_Pos    3                                              /*!< CLK AHBCLK: EBI_EN Position */
#define CLK_AHBCLK_EBI_EN_Msk    (1ul<<CLK_AHBCLK_EBI_EN_Pos)                      /*!< CLK AHBCLK: EBI_EN Mask */

#define CLK_AHBCLK_USBH_EN_Pos    4                                              /*!< CLK AHBCLK: USBH_EN Position */
#define CLK_AHBCLK_USBH_EN_Msk    (1ul<<CLK_AHBCLK_USBH_EN_Pos)                      /*!< CLK AHBCLK: USBH_EN Mask */

#define CLK_AHBCLK_EMAC_EN_Pos    5                                              /*!< CLK AHBCLK: EMAC_EN Position */
#define CLK_AHBCLK_EMAC_EN_Msk    (1ul<<CLK_AHBCLK_EMAC_EN_Pos)                      /*!< CLK AHBCLK: EMAC_EN Mask */

#define CLK_AHBCLK_SD_EN_Pos    6                                              /*!< CLK AHBCLK: SD_EN Position */
#define CLK_AHBCLK_SD_EN_Msk    (1ul<<CLK_AHBCLK_SD_EN_Pos)                      /*!< CLK AHBCLK: SD_EN Mask */

#define CLK_AHBCLK_CRC_EN_Pos    7                                              /*!< CLK AHBCLK: CRC_EN Position */
#define CLK_AHBCLK_CRC_EN_Msk    (1ul<<CLK_AHBCLK_CRC_EN_Pos)                      /*!< CLK AHBCLK: CRC_EN Mask */

#define CLK_AHBCLK_CAP_EN_Pos    8                                              /*!< CLK AHBCLK: CAP_EN Position */
#define CLK_AHBCLK_CAP_EN_Msk    (1ul<<CLK_AHBCLK_CAP_EN_Pos)                      /*!< CLK AHBCLK: CAP_EN Mask */

#define CLK_AHBCLK_SENCLK_EN_Pos    9                                              /*!< CLK AHBCLK: SENCLK_EN Position */
#define CLK_AHBCLK_SENCLK_EN_Msk    (1ul<<CLK_AHBCLK_SENCLK_EN_Pos)                  /*!< CLK AHBCLK: SENCLK_EN Mask */

#define CLK_AHBCLK_UDC20_EN_Pos    10                                              /*!< CLK AHBCLK: UDC20_EN Position */
#define CLK_AHBCLK_UDC20_EN_Msk    (1ul<<CLK_AHBCLK_UDC20_EN_Pos)                  /*!< CLK AHBCLK: UDC20_EN Mask */

#define CLK_AHBCLK_CRYPTO_EN_Pos    12                                              /*!< CLK AHBCLK: CRYPTO_EN Position */
#define CLK_AHBCLK_CRYPTO_EN_Msk    (1ul<<CLK_AHBCLK_CRYPTO_EN_Pos)                  /*!< CLK AHBCLK: CRYPTO_EN Mask */

/* CLK APBCLK0 Bit Field Definitions */
#define CLK_APBCLK0_WDT_EN_Pos    0                                              /*!< CLK APBCLK0: WDT_EN Position */
#define CLK_APBCLK0_WDT_EN_Msk    (1ul<<CLK_APBCLK0_WDT_EN_Pos)                      /*!< CLK APBCLK0: WDT_EN Mask */

#define CLK_APBCLK0_RTC_EN_Pos    1                                              /*!< CLK APBCLK0: RTC_EN Position */
#define CLK_APBCLK0_RTC_EN_Msk    (1ul<<CLK_APBCLK0_RTC_EN_Pos)                      /*!< CLK APBCLK0: RTC_EN Mask */

#define CLK_APBCLK0_TMR0_EN_Pos    2                                              /*!< CLK APBCLK0: TMR0_EN Position */
#define CLK_APBCLK0_TMR0_EN_Msk    (1ul<<CLK_APBCLK0_TMR0_EN_Pos)                      /*!< CLK APBCLK0: TMR0_EN Mask */

#define CLK_APBCLK0_TMR1_EN_Pos    3                                              /*!< CLK APBCLK0: TMR1_EN Position */
#define CLK_APBCLK0_TMR1_EN_Msk    (1ul<<CLK_APBCLK0_TMR1_EN_Pos)                      /*!< CLK APBCLK0: TMR1_EN Mask */

#define CLK_APBCLK0_TMR2_EN_Pos    4                                              /*!< CLK APBCLK0: TMR2_EN Position */
#define CLK_APBCLK0_TMR2_EN_Msk    (1ul<<CLK_APBCLK0_TMR2_EN_Pos)                      /*!< CLK APBCLK0: TMR2_EN Mask */

#define CLK_APBCLK0_TMR3_EN_Pos    5                                              /*!< CLK APBCLK0: TMR3_EN Position */
#define CLK_APBCLK0_TMR3_EN_Msk    (1ul<<CLK_APBCLK0_TMR3_EN_Pos)                      /*!< CLK APBCLK0: TMR3_EN Mask */

#define CLK_APBCLK0_FDIV_EN_Pos    6                                              /*!< CLK APBCLK0: FDIV_EN Position */
#define CLK_APBCLK0_FDIV_EN_Msk    (1ul<<CLK_APBCLK0_FDIV_EN_Pos)                      /*!< CLK APBCLK0: FDIV_EN Mask */

#define CLK_APBCLK0_ACMP_EN_Pos    7                                              /*!< CLK APBCLK0: ACMP_EN Position */
#define CLK_APBCLK0_ACMP_EN_Msk    (1ul<<CLK_APBCLK0_ACMP_EN_Pos)                      /*!< CLK APBCLK0: ACMP_EN Mask */

#define CLK_APBCLK0_I2C0_EN_Pos    8                                              /*!< CLK APBCLK0: I2C0_EN Position */
#define CLK_APBCLK0_I2C0_EN_Msk    (1ul<<CLK_APBCLK0_I2C0_EN_Pos)                      /*!< CLK APBCLK0: I2C0_EN Mask */

#define CLK_APBCLK0_I2C1_EN_Pos    9                                              /*!< CLK APBCLK0: I2C1_EN Position */
#define CLK_APBCLK0_I2C1_EN_Msk    (1ul<<CLK_APBCLK0_I2C1_EN_Pos)                      /*!< CLK APBCLK0: I2C1_EN Mask */

#define CLK_APBCLK0_I2C2_EN_Pos    10                                              /*!< CLK APBCLK0: I2C2_EN Position */
#define CLK_APBCLK0_I2C2_EN_Msk    (1ul<<CLK_APBCLK0_I2C2_EN_Pos)                      /*!< CLK APBCLK0: I2C2_EN Mask */

#define CLK_APBCLK0_I2C3_EN_Pos    11                                              /*!< CLK APBCLK0: I2C3_EN Position */
#define CLK_APBCLK0_I2C3_EN_Msk    (1ul<<CLK_APBCLK0_I2C3_EN_Pos)                      /*!< CLK APBCLK0: I2C3_EN Mask */

#define CLK_APBCLK0_SPI0_EN_Pos    12                                              /*!< CLK APBCLK0: SPI0_EN Position */
#define CLK_APBCLK0_SPI0_EN_Msk    (1ul<<CLK_APBCLK0_SPI0_EN_Pos)                      /*!< CLK APBCLK0: SPI0_EN Mask */

