coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define CLK_APBCLK0_SPI1_EN_Pos    13                                              /*!< CLK APBCLK0: SPI1_EN Position */
#define CLK_APBCLK0_SPI1_EN_Msk    (1ul<<CLK_APBCLK0_SPI1_EN_Pos)                      /*!< CLK APBCLK0: SPI1_EN Mask */

#define CLK_APBCLK0_SPI2_EN_Pos    14                                              /*!< CLK APBCLK0: SPI2_EN Position */
#define CLK_APBCLK0_SPI2_EN_Msk    (1ul<<CLK_APBCLK0_SPI2_EN_Pos)                      /*!< CLK APBCLK0: SPI2_EN Mask */

#define CLK_APBCLK0_SPI3_EN_Pos    15                                              /*!< CLK APBCLK0: SPI3_EN Position */
#define CLK_APBCLK0_SPI3_EN_Msk    (1ul<<CLK_APBCLK0_SPI3_EN_Pos)                      /*!< CLK APBCLK0: SPI3_EN Mask */

#define CLK_APBCLK0_UART0_EN_Pos    16                                              /*!< CLK APBCLK0: UART0_EN Position */
#define CLK_APBCLK0_UART0_EN_Msk    (1ul<<CLK_APBCLK0_UART0_EN_Pos)                      /*!< CLK APBCLK0: UART0_EN Mask */

#define CLK_APBCLK0_UART1_EN_Pos    17                                              /*!< CLK APBCLK0: UART1_EN Position */
#define CLK_APBCLK0_UART1_EN_Msk    (1ul<<CLK_APBCLK0_UART1_EN_Pos)                      /*!< CLK APBCLK0: UART1_EN Mask */

#define CLK_APBCLK0_UART2_EN_Pos    18                                              /*!< CLK APBCLK0: UART2_EN Position */
#define CLK_APBCLK0_UART2_EN_Msk    (1ul<<CLK_APBCLK0_UART2_EN_Pos)                      /*!< CLK APBCLK0: UART2_EN Mask */

#define CLK_APBCLK0_UART3_EN_Pos    19                                              /*!< CLK APBCLK0: UART3_EN Position */
#define CLK_APBCLK0_UART3_EN_Msk    (1ul<<CLK_APBCLK0_UART3_EN_Pos)                      /*!< CLK APBCLK0: UART3_EN Mask */

#define CLK_APBCLK0_UART4_EN_Pos    20                                              /*!< CLK APBCLK0: UART4_EN Position */
#define CLK_APBCLK0_UART4_EN_Msk    (1ul<<CLK_APBCLK0_UART4_EN_Pos)                      /*!< CLK APBCLK0: UART4_EN Mask */

#define CLK_APBCLK0_UART5_EN_Pos    21                                              /*!< CLK APBCLK0: UART5_EN Position */
#define CLK_APBCLK0_UART5_EN_Msk    (1ul<<CLK_APBCLK0_UART5_EN_Pos)                      /*!< CLK APBCLK0: UART5_EN Mask */

#define CLK_APBCLK0_CAN0_EN_Pos    24                                                  /*!< CLK APBCLK0: CAN0_EN Position */
#define CLK_APBCLK0_CAN0_EN_Msk    (1ul<<CLK_APBCLK0_CAN0_EN_Pos)                      /*!< CLK APBCLK0: CAN0_EN Mask */

#define CLK_APBCLK0_CAN1_EN_Pos    25                                              /*!< CLK APBCLK0: CAN1_EN Position */
#define CLK_APBCLK0_CAN1_EN_Msk    (1ul<<CLK_APBCLK0_CAN1_EN_Pos)                      /*!< CLK APBCLK0: CAN1_EN Mask */

#define CLK_APBCLK0_OTG_EN_Pos    26                                              /*!< CLK APBCLK0: OTG_EN Position */
#define CLK_APBCLK0_OTG_EN_Msk    (1ul<<CLK_APBCLK0_OTG_EN_Pos)                      /*!< CLK APBCLK0: OTG_EN Mask */

#define CLK_APBCLK0_ADC_EN_Pos    28                                              /*!< CLK APBCLK0: ADC_EN Position */
#define CLK_APBCLK0_ADC_EN_Msk    (1ul<<CLK_APBCLK0_ADC_EN_Pos)                      /*!< CLK APBCLK0: ADC_EN Mask */

#define CLK_APBCLK0_I2S0_EN_Pos    29                                              /*!< CLK APBCLK0: I2S0_EN Position */
#define CLK_APBCLK0_I2S0_EN_Msk    (1ul<<CLK_APBCLK0_I2S0_EN_Pos)                      /*!< CLK APBCLK0: I2S0_EN Mask */

#define CLK_APBCLK0_I2S1_EN_Pos    30                                              /*!< CLK APBCLK0: I2S1_EN Position */
#define CLK_APBCLK0_I2S1_EN_Msk    (1ul<<CLK_APBCLK0_I2S1_EN_Pos)                      /*!< CLK APBCLK0: I2S1_EN Mask */

#define CLK_APBCLK0_PS2_EN_Pos    31                                              /*!< CLK APBCLK0: PS2_EN Position */
#define CLK_APBCLK0_PS2_EN_Msk    (1ul<<CLK_APBCLK0_PS2_EN_Pos)                      /*!< CLK APBCLK0: PS2_EN Mask */


/* CLK APBCLK1 Bit Field Definitions */
#define CLK_APBCLK1_SC0_EN_Pos    0                                              /*!< CLK APBCLK1: SC0_EN Position */
#define CLK_APBCLK1_SC0_EN_Msk    (1ul<<CLK_APBCLK1_SC0_EN_Pos)                      /*!< CLK APBCLK1: SC0_EN Mask */

#define CLK_APBCLK1_SC1_EN_Pos    1                                              /*!< CLK APBCLK1: SC1_EN Position */
#define CLK_APBCLK1_SC1_EN_Msk    (1ul<<CLK_APBCLK1_SC1_EN_Pos)                      /*!< CLK APBCLK1: SC1_EN Mask */

#define CLK_APBCLK1_SC2_EN_Pos    2                                              /*!< CLK APBCLK1: SC2_EN Position */
#define CLK_APBCLK1_SC2_EN_Msk    (1ul<<CLK_APBCLK1_SC2_EN_Pos)                      /*!< CLK APBCLK1: SC2_EN Mask */

#define CLK_APBCLK1_SC3_EN_Pos    3                                              /*!< CLK APBCLK1: SC3_EN Position */
#define CLK_APBCLK1_SC3_EN_Msk    (1ul<<CLK_APBCLK1_SC3_EN_Pos)                      /*!< CLK APBCLK1: SC3_EN Mask */

#define CLK_APBCLK1_SC4_EN_Pos    4                                              /*!< CLK APBCLK1: SC4_EN Position */
#define CLK_APBCLK1_SC4_EN_Msk    (1ul<<CLK_APBCLK1_SC4_EN_Pos)                      /*!< CLK APBCLK1: SC4_EN Mask */

#define CLK_APBCLK1_SC5_EN_Pos    5                                              /*!< CLK APBCLK1: SC5_EN Position */
#define CLK_APBCLK1_SC5_EN_Msk    (1ul<<CLK_APBCLK1_SC5_EN_Pos)                      /*!< CLK APBCLK1: SC5_EN Mask */

#define CLK_APBCLK1_I2C4_EN_Pos    8                                              /*!< CLK APBCLK1: I2C4_EN Position */
#define CLK_APBCLK1_I2C4_EN_Msk    (1ul<<CLK_APBCLK1_I2C4_EN_Pos)                      /*!< CLK APBCLK1: I2C4_EN Mask */

#define CLK_APBCLK1_PWM0CH01_EN_Pos    16                                              /*!< CLK APBCLK1: PWM0CH01_EN Position */
#define CLK_APBCLK1_PWM0CH01_EN_Msk    (1ul<<CLK_APBCLK1_PWM0CH01_EN_Pos)                      /*!< CLK APBCLK1: PWM0CH01_EN Mask */

#define CLK_APBCLK1_PWM0CH23_EN_Pos    17                                              /*!< CLK APBCLK1: PWM0CH23_EN Position */
#define CLK_APBCLK1_PWM0CH23_EN_Msk    (1ul<<CLK_APBCLK1_PWM0CH23_EN_Pos)                      /*!< CLK APBCLK1: PWM0CH23_EN Mask */

#define CLK_APBCLK1_PWM0CH45_EN_Pos    18                                              /*!< CLK APBCLK1: PWM0CH45_EN Position */
#define CLK_APBCLK1_PWM0CH45_EN_Msk    (1ul<<CLK_APBCLK1_PWM0CH45_EN_Pos)                      /*!< CLK APBCLK1: PWM0CH45_EN Mask */

#define CLK_APBCLK1_PWM1CH01_EN_Pos    19                                              /*!< CLK APBCLK1: PWM1CH01_EN Position */
#define CLK_APBCLK1_PWM1CH01_EN_Msk    (1ul<<CLK_APBCLK1_PWM1CH01_EN_Pos)                      /*!< CLK APBCLK1: PWM1CH01_EN Mask */

#define CLK_APBCLK1_PWM1CH23_EN_Pos    20                                              /*!< CLK APBCLK1: PWM1CH23_EN Position */
#define CLK_APBCLK1_PWM1CH23_EN_Msk    (1ul<<CLK_APBCLK1_PWM1CH23_EN_Pos)                      /*!< CLK APBCLK1: PWM1CH23_EN Mask */

