coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define CLK_APBCLK1_PWM1CH45_EN_Pos    21                                              /*!< CLK APBCLK1: PWM1CH45_EN Position */
#define CLK_APBCLK1_PWM1CH45_EN_Msk    (1ul<<CLK_APBCLK1_PWM1CH45_EN_Pos)                      /*!< CLK APBCLK1: PWM1CH45_EN Mask */

#define CLK_APBCLK1_QEI0_EN_Pos    22                                              /*!< CLK APBCLK1: QEI0_EN Position */
#define CLK_APBCLK1_QEI0_EN_Msk    (1ul<<CLK_APBCLK1_QEI0_EN_Pos)                      /*!< CLK APBCLK1: QEI0_EN Mask */

#define CLK_APBCLK1_QEI1_EN_Pos    23                                              /*!< CLK APBCLK1: QEI1_EN Position */
#define CLK_APBCLK1_QEI1_EN_Msk    (1ul<<CLK_APBCLK1_QEI1_EN_Pos)                      /*!< CLK APBCLK1: QEI1_EN Mask */

#define CLK_APBCLK1_TAMPER_EN_Pos    24                                              /*!< CLK APBCLK1: TAMPER_EN Position */
#define CLK_APBCLK1_TAMPER_EN_Msk    (1ul<<CLK_APBCLK1_TAMPER_EN_Pos)                      /*!< CLK APBCLK1: TAMPER_EN Mask */

#define CLK_APBCLK1_ECAP0_EN_Pos    26                                              /*!< CLK APBCLK1: ECAP0_EN Position */
#define CLK_APBCLK1_ECAP0_EN_Msk    (1ul<<CLK_APBCLK1_ECAP0_EN_Pos)                      /*!< CLK APBCLK1: ECAP0_EN Mask */

#define CLK_APBCLK1_ECAP1_EN_Pos    27                                              /*!< CLK APBCLK1: ECAP1_EN Position */
#define CLK_APBCLK1_ECAP1_EN_Msk    (1ul<<CLK_APBCLK1_ECAP1_EN_Pos)                      /*!< CLK APBCLK1: ECAP1_EN Mask */

#define CLK_APBCLK1_EPWM0_EN_Pos    28                                              /*!< CLK APBCLK1: EPWM0_EN Position */
#define CLK_APBCLK1_EPWM0_EN_Msk    (1ul<<CLK_APBCLK1_EPWM0_EN_Pos)                      /*!< CLK APBCLK1: EPWM0_EN Mask */

#define CLK_APBCLK1_EPWM1_EN_Pos    29                                              /*!< CLK APBCLK1: EPWM1_EN Position */
#define CLK_APBCLK1_EPWM1_EN_Msk    (1ul<<CLK_APBCLK1_EPWM1_EN_Pos)                      /*!< CLK APBCLK1: EPWM1_EN Mask */

#define CLK_APBCLK1_OPA_EN_Pos    30                                              /*!< CLK APBCLK1: OPA_EN Position */
#define CLK_APBCLK1_OPA_EN_Msk    (1ul<<CLK_APBCLK1_OPA_EN_Pos)                      /*!< CLK APBCLK1: OPA_EN Mask */

#define CLK_APBCLK1_EADC_EN_Pos    31                                              /*!< CLK APBCLK1: EADC_EN Position */
#define CLK_APBCLK1_EADC_EN_Msk    (1ul<<CLK_APBCLK1_EADC_EN_Pos)                      /*!< CLK APBCLK1: EADC_EN Mask */

/* CLK CLKSEL0 Bit Field Definitions */
#define CLK_CLKSEL0_HCLK_S_Pos    0                                              /*!< CLK CLKSEL0: HCLK_S Position */
#define CLK_CLKSEL0_HCLK_S_Msk    (0x7ul<<CLK_CLKSEL0_HCLK_S_Pos)                      /*!< CLK CLKSEL0: HCLK_S Mask */

#define CLK_CLKSEL0_STCLK_S_Pos    3                                              /*!< CLK CLKSEL0: STCLK_S Position */
#define CLK_CLKSEL0_STCLK_S_Msk    (0x7ul<<CLK_CLKSEL0_STCLK_S_Pos)                      /*!< CLK CLKSEL0: STCLK_S Mask */

#define CLK_CLKSEL0_PCLK_S_Pos    6                                              /*!< CLK CLKSEL0: PCLK_S Position */
#define CLK_CLKSEL0_PCLK_S_Msk    (1ul<<CLK_CLKSEL0_PCLK_S_Pos)                      /*!< CLK CLKSEL0: PCLK_S Mask */

#define CLK_CLKSEL0_USB_S_Pos    8                                              /*!< CLK CLKSEL0: USB_S Position */
#define CLK_CLKSEL0_USB_S_Msk    (1ul<<CLK_CLKSEL0_USB_S_Pos)                      /*!< CLK CLKSEL0: USB_S Mask */

#define CLK_CLKSEL0_EMAC_S_Pos    10                                              /*!< CLK CLKSEL0: EMAC_S Position */
#define CLK_CLKSEL0_EMAC_S_Msk    (1ul<<CLK_CLKSEL0_EMAC_S_Pos)                      /*!< CLK CLKSEL0: EMAC_S Mask */

#define CLK_CLKSEL0_CAP_S_Pos    16                                              /*!< CLK CLKSEL0: CAP_S Position */
#define CLK_CLKSEL0_CAP_S_Msk    (0x3ul<<CLK_CLKSEL0_CAP_S_Pos)                      /*!< CLK CLKSEL0: CAP_S Mask */

#define CLK_CLKSEL0_SDHOST_S_Pos    20                                              /*!< CLK CLKSEL0: SD_S Position */
#define CLK_CLKSEL0_SDHOST_S_Msk    (0x3ul<<CLK_CLKSEL0_SDHOST_S_Pos)                      /*!< CLK CLKSEL0: SDIO_S Mask */

/* CLK CLKSEL1 Bit Field Definitions */
#define CLK_CLKSEL1_WDT_S_Pos    0                                              /*!< CLK CLKSEL1: WDT_S Position */
#define CLK_CLKSEL1_WDT_S_Msk    (0x3ul<<CLK_CLKSEL1_WDT_S_Pos)                      /*!< CLK CLKSEL1: WDT_S Mask */

#define CLK_CLKSEL1_ADC_S_Pos    2                                              /*!< CLK CLKSEL1: ADC_S Position */
#define CLK_CLKSEL1_ADC_S_Msk    (0x3ul<<CLK_CLKSEL1_ADC_S_Pos)                      /*!< CLK CLKSEL1: ADC_S Mask */

#define CLK_CLKSEL1_SPI0_S_Pos    4                                              /*!< CLK CLKSEL1: SPI0_S Position */
#define CLK_CLKSEL1_SPI0_S_Msk    (1ul<<CLK_CLKSEL1_SPI0_S_Pos)                      /*!< CLK CLKSEL1: SPI0_S Mask */

#define CLK_CLKSEL1_SPI1_S_Pos    5                                              /*!< CLK CLKSEL1: SPI1_S Position */
#define CLK_CLKSEL1_SPI1_S_Msk    (1ul<<CLK_CLKSEL1_SPI1_S_Pos)                      /*!< CLK CLKSEL1: SPI1_S Mask */

#define CLK_CLKSEL1_SPI2_S_Pos    6                                              /*!< CLK CLKSEL1: SPI2_S Position */
#define CLK_CLKSEL1_SPI2_S_Msk    (1ul<<CLK_CLKSEL1_SPI2_S_Pos)                      /*!< CLK CLKSEL1: SPI2_S Mask */

#define CLK_CLKSEL1_SPI3_S_Pos    7                                              /*!< CLK CLKSEL1: SPI3_S Position */
#define CLK_CLKSEL1_SPI3_S_Msk    (1ul<<CLK_CLKSEL1_SPI3_S_Pos)                      /*!< CLK CLKSEL1: SPI3_S Mask */

#define CLK_CLKSEL1_TMR0_S_Pos    8                                              /*!< CLK CLKSEL1: TMR0_S Position */
#define CLK_CLKSEL1_TMR0_S_Msk    (0x7ul<<CLK_CLKSEL1_TMR0_S_Pos)                      /*!< CLK CLKSEL1: TMR0_S Mask */

#define CLK_CLKSEL1_TMR1_S_Pos    12                                              /*!< CLK CLKSEL1: TMR1_S Position */
#define CLK_CLKSEL1_TMR1_S_Msk    (0x7ul<<CLK_CLKSEL1_TMR1_S_Pos)                      /*!< CLK CLKSEL1: TMR1_S Mask */

#define CLK_CLKSEL1_TMR2_S_Pos    16                                              /*!< CLK CLKSEL1: TMR2_S Position */
#define CLK_CLKSEL1_TMR2_S_Msk    (0x7ul<<CLK_CLKSEL1_TMR2_S_Pos)                      /*!< CLK CLKSEL1: TMR2_S Mask */

#define CLK_CLKSEL1_TMR3_S_Pos    20                                              /*!< CLK CLKSEL1: TMR3_S Position */
#define CLK_CLKSEL1_TMR3_S_Msk    (0x7ul<<CLK_CLKSEL1_TMR3_S_Pos)                      /*!< CLK CLKSEL1: TMR3_S Mask */

#define CLK_CLKSEL1_UART_S_Pos    24                                              /*!< CLK CLKSEL1: UART_S Position */
#define CLK_CLKSEL1_UART_S_Msk    (0x3ul<<CLK_CLKSEL1_UART_S_Pos)                      /*!< CLK CLKSEL1: UART_S Mask */

#define CLK_CLKSEL1_FRQDIV_S_Pos    28                                              /*!< CLK CLKSEL1: FRQDIV_S Position */
#define CLK_CLKSEL1_FRQDIV_S_Msk    (0x3ul<<CLK_CLKSEL1_FRQDIV_S_Pos)                      /*!< CLK CLKSEL1: FRQDIV_S Mask */

