coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define CLK_CLKSEL1_WWDT_S_Pos    30                                              /*!< CLK CLKSEL1: WWDT_S Position */
#define CLK_CLKSEL1_WWDT_S_Msk    (0x3ul<<CLK_CLKSEL1_WWDT_S_Pos)                      /*!< CLK CLKSEL1: WWDT_S Mask */

/* CLK CLKSEL2 Bit Field Definitions */
#define CLK_CLKSEL2_PWM0CH01_S_Pos    0                                                  /*!< CLK CLKSEL2: PWM0CH01_S Position */
#define CLK_CLKSEL2_PWM0CH01_S_Msk    (0x7ul<<CLK_CLKSEL2_PWM0CH01_S_Pos)                      /*!< CLK CLKSEL2: PWM0CH01_S Mask */

#define CLK_CLKSEL2_PWM0CH23_S_Pos    4                                                  /*!< CLK CLKSEL2: PWM0CH23_S Position */
#define CLK_CLKSEL2_PWM0CH23_S_Msk    (0x7ul<<CLK_CLKSEL2_PWM0CH23_S_Pos)                      /*!< CLK CLKSEL2: PWM0CH23_S Mask */

#define CLK_CLKSEL2_PWM0CH45_S_Pos    8                                                  /*!< CLK CLKSEL2: PWM0CH45_S Position */
#define CLK_CLKSEL2_PWM0CH45_S_Msk    (0x7ul<<CLK_CLKSEL2_PWM0CH45_S_Pos)                      /*!< CLK CLKSEL2: PWM0CH45_S Mask */

#define CLK_CLKSEL2_PWM1CH01_S_Pos    12                                                  /*!< CLK CLKSEL2: PWM1CH01_S Position */
#define CLK_CLKSEL2_PWM1CH01_S_Msk    (0x7ul<<CLK_CLKSEL2_PWM1CH01_S_Pos)                      /*!< CLK CLKSEL2: PWM1CH01_S Mask */

#define CLK_CLKSEL2_PWM1CH23_S_Pos    16                                                  /*!< CLK CLKSEL2: PWM1CH23_S Position */
#define CLK_CLKSEL2_PWM1CH23_S_Msk    (0x7ul<<CLK_CLKSEL2_PWM1CH23_S_Pos)                      /*!< CLK CLKSEL2: PWM1CH23_S Mask */

#define CLK_CLKSEL2_PWM1CH45_S_Pos    20                                                  /*!< CLK CLKSEL2: PWM1CH45_S Position */
#define CLK_CLKSEL2_PWM1CH45_S_Msk    (0x7ul<<CLK_CLKSEL2_PWM1CH45_S_Pos)                      /*!< CLK CLKSEL2: PWM1CH45_S Mask */

/* CLK CLKSEL3 Bit Field Definitions */
#define CLK_CLKSEL3_SC0_S_Pos    0                                                  /*!< CLK CLKSEL3: SC0_S Position */
#define CLK_CLKSEL3_SC0_S_Msk    (0x3ul<<CLK_CLKSEL3_SC0_S_Pos)                      /*!< CLK CLKSEL3: SC0_S Mask */

#define CLK_CLKSEL3_SC1_S_Pos    2                                                  /*!< CLK CLKSEL3: SC1_S Position */
#define CLK_CLKSEL3_SC1_S_Msk    (0x3ul<<CLK_CLKSEL3_SC1_S_Pos)                      /*!< CLK CLKSEL3: SC1_S Mask */

#define CLK_CLKSEL3_SC2_S_Pos    4                                                  /*!< CLK CLKSEL3: SC2_S Position */
#define CLK_CLKSEL3_SC2_S_Msk    (0x3ul<<CLK_CLKSEL3_SC2_S_Pos)                      /*!< CLK CLKSEL3: SC2_S Mask */

#define CLK_CLKSEL3_SC3_S_Pos    6                                                  /*!< CLK CLKSEL3: SC3_S Position */
#define CLK_CLKSEL3_SC3_S_Msk    (0x3ul<<CLK_CLKSEL3_SC3_S_Pos)                      /*!< CLK CLKSEL3: SC3_S Mask */

#define CLK_CLKSEL3_SC4_S_Pos    8                                                  /*!< CLK CLKSEL3: SC4_S Position */
#define CLK_CLKSEL3_SC4_S_Msk    (0x3ul<<CLK_CLKSEL3_SC4_S_Pos)                      /*!< CLK CLKSEL3: SC4_S Mask */

#define CLK_CLKSEL3_SC5_S_Pos    10                                                  /*!< CLK CLKSEL3: SC5_S Position */
#define CLK_CLKSEL3_SC5_S_Msk    (0x3ul<<CLK_CLKSEL3_SC5_S_Pos)                      /*!< CLK CLKSEL3: SC5_S Mask */

#define CLK_CLKSEL3_I2S_S_Pos    16                                                  /*!< CLK CLKSEL3: I2S_S Position */
#define CLK_CLKSEL3_I2S_S_Msk    (0x3ul<<CLK_CLKSEL3_I2S_S_Pos)                      /*!< CLK CLKSEL3: I2S_S Mask */

#define CLK_CLKSEL3_I2S1_S_Pos    18                                                  /*!< CLK CLKSEL3: I2S1_S Position */
#define CLK_CLKSEL3_I2S1_S_Msk    (0x3ul<<CLK_CLKSEL3_I2S1_S_Pos)                      /*!< CLK CLKSEL3: I2S1_S Mask */

/* CLK CLKDIV0 Bit Field Definitions */
#define CLK_CLKDIV0_HCLK_N_Pos    0                                                  /*!< CLK CLKDIV0: HCLK_N Position */
#define CLK_CLKDIV0_HCLK_N_Msk    (0xFul<<CLK_CLKDIV0_HCLK_N_Pos)                      /*!< CLK CLKDIV0: HCLK_N Mask */

#define CLK_CLKDIV0_USB_N_Pos    4                                                  /*!< CLK CLKDIV0: USB_N Position */
#define CLK_CLKDIV0_USB_N_Msk    (0xFul<<CLK_CLKDIV0_USB_N_Pos)                      /*!< CLK CLKDIV0: USB_N Mask */

#define CLK_CLKDIV0_UART_N_Pos    8                                                  /*!< CLK CLKDIV0: UART_N Position */
#define CLK_CLKDIV0_UART_N_Msk    (0xFul<<CLK_CLKDIV0_UART_N_Pos)                      /*!< CLK CLKDIV0: UART_N Mask */

#define CLK_CLKDIV0_ADC_N_Pos    16                                                  /*!< CLK CLKDIV0: ADC_N Position */
#define CLK_CLKDIV0_ADC_N_Msk    (0xFFul<<CLK_CLKDIV0_ADC_N_Pos)                      /*!< CLK CLKDIV0: ADC_N Mask */

#define CLK_CLKDIV0_SD_N_Pos    24                                                  /*!< CLK CLKDIV0: SD_N Position */
#define CLK_CLKDIV0_SD_N_Msk    (0xFFul<<CLK_CLKDIV0_SD_N_Pos)                      /*!< CLK CLKDIV0: SD_N Mask */

/* CLK CLKDIV1 Bit Field Definitions */
#define CLK_CLKDIV1_SC0_N_Pos    0                                                  /*!< CLK CLKDIV1: SC0_N Position */
#define CLK_CLKDIV1_SC0_N_Msk    (0xFFul<<CLK_CLKDIV1_SC0_N_Pos)                      /*!< CLK CLKDIV1: SC0_N Mask */

#define CLK_CLKDIV1_SC1_N_Pos    8                                                  /*!< CLK CLKDIV1: SC1_N Position */
#define CLK_CLKDIV1_SC1_N_Msk    (0xFFul<<CLK_CLKDIV1_SC1_N_Pos)                      /*!< CLK CLKDIV1: SC1_N Mask */

#define CLK_CLKDIV1_SC2_N_Pos    16                                                  /*!< CLK CLKDIV1: SC2_N Position */
#define CLK_CLKDIV1_SC2_N_Msk    (0xFFul<<CLK_CLKDIV1_SC2_N_Pos)                      /*!< CLK CLKDIV1: SC2_N Mask */

#define CLK_CLKDIV1_SC3_N_Pos    24                                                  /*!< CLK CLKDIV1: SC3_N Position */
#define CLK_CLKDIV1_SC3_N_Msk    (0xFFul<<CLK_CLKDIV1_SC3_N_Pos)                      /*!< CLK CLKDIV1: SC3_N Mask */


/* CLK CLKDIV2 Bit Field Definitions */
#define CLK_CLKDIV2_SC4_N_Pos    0                                                  /*!< CLK CLKDIV2: SC4_N Position */
#define CLK_CLKDIV2_SC4_N_Msk    (0xFFul<<CLK_CLKDIV2_SC4_N_Pos)                      /*!< CLK CLKDIV2: SC4_N Mask */

#define CLK_CLKDIV2_SC5_N_Pos    8                                                  /*!< CLK CLKDIV2: SC5_N Position */
#define CLK_CLKDIV2_SC5_N_Msk    (0xFFul<<CLK_CLKDIV2_SC5_N_Pos)                      /*!< CLK CLKDIV2: SC5_N Mask */

#define CLK_CLKDIV2_SD2_N_Pos    16                                                  /*!< CLK CLKDIV2: SD2_N Position */
#define CLK_CLKDIV2_SD2_N_Msk    (0xFFul<<CLK_CLKDIV2_SD2_N_Pos)                      /*!< CLK CLKDIV2: SD2_N Mask */

