coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* CLK CLKDIV3 Bit Field Definitions */
#define CLK_CLKDIV3_CAP_N_Pos    0                                                  /*!< CLK CLKDIV3: CAP_N Position */
#define CLK_CLKDIV3_CAP_N_Msk    (0xFFul<<CLK_CLKDIV3_CAP_N_Pos)                      /*!< CLK CLKDIV3: CAP_N Mask */

#define CLK_CLKDIV3_VASENSOR_N_Pos    8                                                  /*!< CLK CLKDIV3: VASENSOR_N Position */
#define CLK_CLKDIV3_VASENSOR_N_Msk    (0xFFul<<CLK_CLKDIV3_VASENSOR_N_Pos)                      /*!< CLK CLKDIV3: VASENSOR_N Mask */

#define CLK_CLKDIV3_EMAC_MDCLK_N_Pos    16                                                  /*!< CLK CLKDIV3: EMAC_MDCLK_N Position */
#define CLK_CLKDIV3_EMAC_MDCLK_N_Msk    (0xFFul<<CLK_CLKDIV3_EMAC_MDCLK_N_Pos)                      /*!< CLK CLKDIV3: EMAC_MDCLK_N Mask */

/* CLK PLLCON Bit Field Definitions */
#define CLK_PLLCON_PLL_remap_Pos               20                                      /*!< CLK PLLCON: PLL_remap Position */
#define CLK_PLLCON_PLL_remap_Msk               (1ul<< CLK_PLLCON_PLL_SRC_Pos)          /*!< CLK PLLCON: PLL_remap Mask */

#define CLK_PLLCON_PLL_SRC_Pos               19                                       /*!< CLK PLLCON: PLL_SRC Position */
#define CLK_PLLCON_PLL_SRC_Msk               (1ul<< CLK_PLLCON_PLL_SRC_Pos)          /*!< CLK PLLCON: PLL_SRC Mask */

#define CLK_PLLCON_OE_Pos                    18                                       /*!< CLK PLLCON: PLL_SRC Position */
#define CLK_PLLCON_OE_Msk                    (1ul<< CLK_PLLCON_OE_Pos)               /*!< CLK PLLCON: PLL_SRC Mask */

#define CLK_PLLCON_BP_Pos                    17                                       /*!< CLK PLLCON: OE Position */
#define CLK_PLLCON_BP_Msk                    (1ul<< CLK_PLLCON_BP_Pos)               /*!< CLK PLLCON: OE Mask */

#define CLK_PLLCON_PD_Pos                    16                                       /*!< CLK PLLCON: PD Position */
#define CLK_PLLCON_PD_Msk                    (1ul<< CLK_PLLCON_PD_Pos)               /*!< CLK PLLCON: PD Mask */

#define CLK_PLLCON_OUT_DV_Pos                14                                       /*!< CLK PLLCON: OUT_DV Position */
#define CLK_PLLCON_OUT_DV_Msk                (3ul<< CLK_PLLCON_OUT_DV_Pos)           /*!< CLK PLLCON: OUT_DV Mask */

#define CLK_PLLCON_IN_DV_Pos                 9                                        /*!< CLK PLLCON: IN_DV Position */
#define CLK_PLLCON_IN_DV_Msk                 (0x1Ful<< CLK_PLLCON_IN_DV_Pos)         /*!< CLK PLLCON: IN_DV Mask */

#define CLK_PLLCON_FB_DV_Pos                 0                                        /*!< CLK PLLCON: FB_DV Position */
#define CLK_PLLCON_FB_DV_Msk                 (0x1FFul<< CLK_PLLCON_FB_DV_Pos)        /*!< CLK PLLCON: FB_DV Mask */

/* CLK PLL2CON Bit Field Definitions */
#define CLK_PLL2CON_USBPLL_N_Pos                 0                                        /*!< CLK PLLCON2: USBPLL_N Position */
#define CLK_PLL2CON_USBPLL_N_Msk                 (0xFFul<< CLK_PLL2CON_USBPLL_N_Pos)        /*!< CLK PLLCON2: USBPLL_N Mask */

#define CLK_PLL2CON_USBPLL_EN_Pos                    8                                        /*!< CLK PLLCON2: USBPLL_EN Position */
#define CLK_PLL2CON_USBPLL_EN_Msk                    (0x1ul<< CLK_PLL2CON_USBPLL_EN_Pos)        /*!< CLK PLLCON2: USBPLL_EN Mask */


/* CLK CLKSTATUS Bit Field Definitions */
#define CLK_CLKSTATUS_HXT_STB_Pos                 0                                            /*!< CLK CLKSTATUS: XTL12M_STB Position */
#define CLK_CLKSTATUS_HXT_STB_Msk                 (1ul<< CLK_CLKSTATUS_HXT_STB_Pos)        /*!< CLK CLKSTATUS: XTL12M_STB Mask */

#define CLK_CLKSTATUS_LXT_STB_Pos                 1                                            /*!< CLK CLKSTATUS: XTL32K_STB Position */
#define CLK_CLKSTATUS_LXT_STB_Msk                 (1ul<< CLK_CLKSTATUS_LXT_STB_Pos)        /*!< CLK CLKSTATUS: XTL32K_STB Mask */

#define CLK_CLKSTATUS_PLL_STB_Pos                 2                                            /*!< CLK CLKSTATUS: PLL_STB Position */
#define CLK_CLKSTATUS_PLL_STB_Msk                 (1ul<< CLK_CLKSTATUS_PLL_STB_Pos)        /*!< CLK CLKSTATUS: PLL_STB Mask */

#define CLK_CLKSTATUS_LIRC_STB_Pos                 3                                            /*!< CLK CLKSTATUS: OSC10K_STB Position */
#define CLK_CLKSTATUS_LIRC_STB_Msk                 (1ul<< CLK_CLKSTATUS_LIRC_STB_Pos)        /*!< CLK CLKSTATUS: OSC10K_STB Mask */

#define CLK_CLKSTATUS_HIRC_STB_Pos                 4                                            /*!< CLK CLKSTATUS: OSC22M_STB Position */
#define CLK_CLKSTATUS_HIRC_STB_Msk                 (1ul<< CLK_CLKSTATUS_HIRC_STB_Pos)        /*!< CLK CLKSTATUS: OSC22M_STB Mask */

#define CLK_CLKSTATUS_PLL2_STB_Pos                 5                                            /*!< CLK CLKSTATUS: PLL2_STB Position */
#define CLK_CLKSTATUS_PLL2_STB_Msk                 (1ul<< CLK_CLKSTATUS_PLL2_STB_Pos)        /*!< CLK CLKSTATUS: PLL2_STB Mask */

#define CLK_CLKSTATUS_CLK_SW_FAIL_Pos                 7                                            /*!< CLK CLKSTATUS: CLK_SW_FAIL Position */
#define CLK_CLKSTATUS_CLK_SW_FAIL_Msk                 (1ul<< CLK_CLKSTATUS_CLK_SW_FAIL_Pos)        /*!< CLK CLKSTATUS: CLK_SW_FAIL Mask */

/* CLK FRQDIV Bit Field Definitions */
#define CLK_FRQDIV_DIVIDER1_Pos            5                                        /*!< CLK FRQDIV: DIVIDER1 Position */
#define CLK_FRQDIV_DIVIDER1_Msk            (1ul<< CLK_FRQDIV_DIVIDER1_Pos)       /*!< CLK FRQDIV: DIVIDER1 Mask */

#define CLK_FRQDIV_DIVIDER_EN_Pos            4                                        /*!< CLK FRQDIV: DIVIDER_EN Position */
#define CLK_FRQDIV_DIVIDER_EN_Msk            (1ul<< CLK_FRQDIV_DIVIDER_EN_Pos)       /*!< CLK FRQDIV: DIVIDER_EN Mask */

#define CLK_FRQDIV_FSEL_Pos                  0                                        /*!< CLK FRQDIV: FRQDIV_FSEL Position */
#define CLK_FRQDIV_FSEL_Msk                  (0xFul<< CLK_FRQDIV_FSEL_Pos)           /*!< CLK FRQDIV: FRQDIV_FSEL Mask */

/* CLK CLKFCR Bit Field Definitions */
#define CLK_CLKFCR_SYSC_DET_EN_Pos                  0                                        /*!< CLK CLKFCR: FRQDIV_SYSC_DET_EN Position */
#define CLK_CLKFCR_SYSC_DET_EN_Msk                  (0x1ul << CLK_CLKFCR_SYSC_DET_EN_Pos)           /*!< CLK CLKFCR: FRQDIV_SYSC_DET_EN Mask */

#define CLK_CLKFCR_SYSF_INT_EN_Pos                  1                                        /*!< CLK CLKFCR: FRQDIV_SYSF_INT_EN Position */
#define CLK_CLKFCR_SYSF_INT_EN_Msk                  (0x1ul << CLK_CLKFCR_SYSF_INT_EN_Pos)           /*!< CLK CLKFCR: FRQDIV_SYSF_INT_EN Mask */

#define CLK_CLKFCR_SYS_F_Pos                  2                                        /*!< CLK CLKFCR: FRQDIV_SYS_F Position */
#define CLK_CLKFCR_SYS_F_Msk                  (0x1ul << CLK_CLKFCR_SYS_F_Pos)           /*!< CLK CLKFCR: FRQDIV_SYS_F Mask */

#define CLK_CLKFCR_RC_DET_EN_Pos                  8                                        /*!< CLK CLKFCR: FRQDIV_RC_DET_EN Position */
#define CLK_CLKFCR_RC_DET_EN_Msk                  (0x1ul << CLK_CLKFCR_RC_DET_EN_Pos)           /*!< CLK CLKFCR: FRQDIV_RC_DET_EN Mask */

