coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define CLK_CLKFCR_IRC_INT_EN_Pos                  9                                        /*!< CLK CLKFCR: FRQDIV_IRC_INT_EN Position */
#define CLK_CLKFCR_IRC_INT_EN_Msk                  (0x1ul << CLK_CLKFCR_IRC_INT_EN_Pos)           /*!< CLK CLKFCR: FRQDIV_IRC_INT_EN Mask */

#define CLK_CLKFCR_IRC_F_Pos                  10                                       /*!< CLK CLKFCR: FRQDIV_IRC_F Position */
#define CLK_CLKFCR_IRC_F_Msk                  (0x1ul << CLK_CLKFCR_IRC_F_Pos)           /*!< CLK CLKFCR: FRQDIV_IRC_F Mask */

/* CLKDETCR Bit Field Definitions */
#define CLK_CLKDETCR_SYS_DET_EN_Pos     0                                                  /*!< CLK_CLKDETCR: System Clock Detector Enable */
#define CLK_CLKDETCR_SYS_DET_EN_Msk       (0x1ul << CLK_CLKDETCR_SYS_DET_EN_Pos)            /*!< CLK CLKDETCR: SYS_DET_EN Mask */
#define CLK_CLKDETCR_SYS_INT_EN_Pos     1                                                  /*!< CLK_CLKDETCR: System  Clock Detector Interrupt Enable */
#define CLK_CLKDETCR_SYS_INT_EN_Msk       (0x1ul << CLK_CLKDETCR_SYS_INT_EN_Pos)            /*!< CLK CLKDETCR: SYS_INT_EN Mask */
#define CLK_CLKDETCR_SYS_F_Pos             2                                                  /*!< CLK_CLKDETCR: System Clock Detect Fail Flag */
#define CLK_CLKDETCR_SYS_F_Msk           (0x1ul << CLK_CLKDETCR_SYS_F_Pos)                /*!< CLK CLKDETCR: SYS_F Mask */
#define CLK_CLKDETCR_IRC_DET_EN_Pos     8                                                  /*!< CLK_CLKDETCR: Internal RC Clock Detector Enable */
#define CLK_CLKDETCR_IRC_DET_EN_Msk       (0x1ul << CLK_CLKDETCR_IRC_DET_EN_Pos)            /*!< CLK CLKDETCR: IRC_DET_EN Mask */
#define CLK_CLKDETCR_IRC_INT_EN_Pos     9                                                  /*!< CLK_CLKDETCR: Internal RC Clock Detector Interrupt Enable */
#define CLK_CLKDETCR_IRC_INT_EN_Msk       (0x1ul << CLK_CLKDETCR_IRC_INT_EN_Pos)            /*!< CLK CLKDETCR: IRC_INT_EN Mask */
#define CLK_CLKDETCR_IRC_F_Pos             10                                              /*!< CLK_CLKDETCR: Internal RC Clock Fail Flag */
#define CLK_CLKDETCR_IRC_F_Msk           (0x1ul << CLK_CLKDETCR_IRC_F_Pos)                /*!< CLK CLKDETCR: IRC_F Mask */

/*@}*/ /* end of group NUC400_CLK */

/*------------- General Purpose I/O (GPIO) -----------------------------*/
/** @addtogroup NUC400_GPIO NUC400 General Purpose I/O (GPIO)
  @{
*/
typedef struct {
    __IO uint32_t PMD;                  /*!< Offset: 0x0000   GPIO Port Bit Mode Control                        */
    __IO uint32_t OFFD;                 /*!< Offset: 0x0004   GPIO Port Bit Off Digital Enable                  */
    __IO uint32_t DOUT;                 /*!< Offset: 0x0008   GPIO Port Data Output                             */
    __IO uint32_t DMASK;                /*!< Offset: 0x000C   GPIO Port Data Output Write Mask                  */
    __I  uint32_t PIN;                  /*!< Offset: 0x0010   GPIO Port Pin Value                               */
    __IO uint32_t DBEN;                 /*!< Offset: 0x0014   GPIO Port De-bounce Enable                        */
    __IO uint32_t IMD;                  /*!< Offset: 0x0018   GPIO Port Interrupt Mode Select                   */
    __IO uint32_t IEN;                  /*!< Offset: 0x001C   GPIO Port Interrupt Enable                        */
    __IO uint32_t ISRC;                 /*!< Offset: 0x0020   GPIO Port Interrupt Source Flag                   */
    __IO uint32_t TYPE;                 /*!< Offset: 0x0024   GPIO Port input Schmitt Trigger function          */
    __IO uint32_t HS;                   /*!< Offset: 0x0028   GPIO Higher Speed Control                         */

} GPIO_T;

typedef struct {
    __IO uint32_t DBNCECON;             /*!< Offset: 0x0000   Interrupt De-bounce Cycle Control                 */

} GPIO_DBNCECON_T;

/* GPIO PMD Bit Field Definitions */
#define GPIO_PMD_PMD15_Pos          30                                          /*!< GPIO PMD: PMD15 Position */
#define GPIO_PMD_PMD15_Msk          (0x3ul << GPIO_PMD_PMD15_Pos)               /*!< GPIO PMD: PMD15 Mask */

#define GPIO_PMD_PMD14_Pos          28                                          /*!< GPIO PMD: PMD14 Position */
#define GPIO_PMD_PMD14_Msk          (0x3ul << GPIO_PMD_PMD14_Pos)               /*!< GPIO PMD: PMD14 Mask */

#define GPIO_PMD_PMD13_Pos          26                                          /*!< GPIO PMD: PMD13 Position */
#define GPIO_PMD_PMD13_Msk          (0x3ul << GPIO_PMD_PMD13_Pos)               /*!< GPIO PMD: PMD13 Mask */

#define GPIO_PMD_PMD12_Pos          24                                          /*!< GPIO PMD: PMD12 Position */
#define GPIO_PMD_PMD12_Msk          (0x3ul << GPIO_PMD_PMD12_Pos)               /*!< GPIO PMD: PMD12 Mask */

#define GPIO_PMD_PMD11_Pos          22                                          /*!< GPIO PMD: PMD11 Position */
#define GPIO_PMD_PMD11_Msk          (0x3ul << GPIO_PMD_PMD11_Pos)               /*!< GPIO PMD: PMD11 Mask */

#define GPIO_PMD_PMD10_Pos          20                                          /*!< GPIO PMD: PMD10 Position */
#define GPIO_PMD_PMD10_Msk          (0x3ul << GPIO_PMD_PMD10_Pos)               /*!< GPIO PMD: PMD10 Mask */

#define GPIO_PMD_PMD9_Pos           18                                          /*!< GPIO PMD: PMD9 Position */
#define GPIO_PMD_PMD9_Msk           (0x3ul << GPIO_PMD_PMD9_Pos)                /*!< GPIO PMD: PMD9 Mask */

#define GPIO_PMD_PMD8_Pos           16                                          /*!< GPIO PMD: PMD8 Position */
#define GPIO_PMD_PMD8_Msk           (0x3ul << GPIO_PMD_PMD8_Pos)                /*!< GPIO PMD: PMD8 Mask */

#define GPIO_PMD_PMD7_Pos           14                                          /*!< GPIO PMD: PMD7 Position */
#define GPIO_PMD_PMD7_Msk           (0x3ul << GPIO_PMD_PMD7_Pos)                /*!< GPIO PMD: PMD7 Mask */

#define GPIO_PMD_PMD6_Pos           12                                          /*!< GPIO PMD: PMD6 Position */
#define GPIO_PMD_PMD6_Msk           (0x3ul << GPIO_PMD_PMD6_Pos)                /*!< GPIO PMD: PMD6 Mask */

#define GPIO_PMD_PMD5_Pos           10                                          /*!< GPIO PMD: PMD5 Position */
#define GPIO_PMD_PMD5_Msk           (0x3ul << GPIO_PMD_PMD5_Pos)                /*!< GPIO PMD: PMD5 Mask */

#define GPIO_PMD_PMD4_Pos           8                                           /*!< GPIO PMD: PMD4 Position */
#define GPIO_PMD_PMD4_Msk           (0x3ul << GPIO_PMD_PMD4_Pos)                /*!< GPIO PMD: PMD4 Mask */

#define GPIO_PMD_PMD3_Pos           6                                           /*!< GPIO PMD: PMD3 Position */
#define GPIO_PMD_PMD3_Msk           (0x3ul << GPIO_PMD_PMD3_Pos)                /*!< GPIO PMD: PMD3 Mask */

#define GPIO_PMD_PMD2_Pos           4                                           /*!< GPIO PMD: PMD2 Position */
#define GPIO_PMD_PMD2_Msk           (0x3ul << GPIO_PMD_PMD2_Pos)                /*!< GPIO PMD: PMD2 Mask */

#define GPIO_PMD_PMD1_Pos           2                                           /*!< GPIO PMD: PMD1 Position */
#define GPIO_PMD_PMD1_Msk           (0x3ul << GPIO_PMD_PMD1_Pos)                /*!< GPIO PMD: PMD1 Mask */

#define GPIO_PMD_PMD0_Pos           0                                           /*!< GPIO PMD: PMD0 Position */
#define GPIO_PMD_PMD0_Msk           (0x3ul << GPIO_PMD_PMD0_Pos)                /*!< GPIO PMD: PMD0 Mask */

/* GPIO OFFD Bit Field Definitions */
#define GPIO_OFFD_OFFD_Pos          16                                          /*!< GPIO OFFD: OFFD Position */
#define GPIO_OFFD_OFFD_Msk          (0xFFFFul << GPIO_OFFD_OFFD_Pos)            /*!< GPIO OFFD: OFFD Mask */

/* GPIO DOUT Bit Field Definitions */
#define GPIO_DOUT_DOUT_Pos          0                                           /*!< GPIO DOUT: DOUT Position */
#define GPIO_DOUT_DOUT_Msk          (0xFFFFul << GPIO_DOUT_DOUT_Pos)            /*!< GPIO DOUT: DOUT Mask */

/* GPIO DMASK Bit Field Definitions */
#define GPIO_DMASK_DMASK_Pos        0                                           /*!< GPIO DMASK: DMASK Position */
#define GPIO_DMASK_DMASK_Msk        (0xFFFFul << GPIO_DMASK_DMASK_Pos)          /*!< GPIO DMASK: DMASK Mask */

/* GPIO PIN Bit Field Definitions */
#define GPIO_PIN_PIN_Pos            0                                           /*!< GPIO PIN: PIN Position */
#define GPIO_PIN_PIN_Msk            (0xFFFFul << GPIO_PIN_PIN_Pos)              /*!< GPIO PIN: PIN Mask */

