coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/*------------- PDMA Control Register (PDMA) -----------------------------*/
/** @addtogroup NUC400_PDMA NUC400 PDMA Control Register (PDMA)
  @{
*/
typedef struct {
    __IO uint32_t CTRL;                 /*!< Offset: 0x0000   Descriptor Table Control Register of DMA Channel */
    __IO uint32_t ENDSAR;               /*!< Offset: 0x0004   End Source Address Register of DMA Channel */
    __IO uint32_t ENDDAR;               /*!< Offset: 0x0008   End Destination Address Register of DMA Channel */
    __IO uint32_t NEXT;                 /*!< Offset: 0x000C   First Scatter-Gather Descriptor Table Offset Address of DMA Channel */

} SCAT_T;

typedef struct {
    SCAT_T DSCT[16];                    /*!< Offset: 0x0000 ~ 0x00FC   DMA Embedded Description Table */
    __I uint32_t RESERVED0[192];        /*!< Offset: 0x0100 ~ 0x03FC   Reserved */
    __IO uint32_t CHCON;                /*!< Offset: 0x0400   DMA Channel Control Register */
    __O  uint32_t STOP;                 /*!< Offset: 0x0404   DMA Stop Transfer Register */
    __O  uint32_t SWREQ;                /*!< Offset: 0x0408   DMA Software Request Register */
    __I  uint32_t REQACTF;              /*!< Offset: 0x040C   DMA Request Active Flag Register */
    __IO uint32_t FPSET;                /*!< Offset: 0x0410   DMA Fix Priority Setting Register */
    __O  uint32_t FPCLR;                /*!< Offset: 0x0414   DMA Fix Priority Clear Register */
    __IO uint32_t IER;                  /*!< Offset: 0x0418   DMA Interrupt Enable Register */
    __IO  uint32_t ISR;                 /*!< Offset: 0x041C   DMA Interrupt Status Register */
    __IO uint32_t ABTF;                 /*!< Offset: 0x0420   DMA Read/Write Target Abort Flag Register */
    __IO uint32_t TDF;                  /*!< Offset: 0x0424   DMA Transfer Done Flag Register */
    __IO uint32_t SCATDF;               /*!< Offset: 0x0428   DMA Scatter-Gather Transfer Done Flag Register */
    __IO uint32_t ACTF;                 /*!< Offset: 0x042C   DMA Transfer On Active Flag Register */
    uint32_t RESERVED1[3];              /*!< Offset: 0x0430 ~ 0x0038   Reserved */
    __IO uint32_t SCATBA;               /*!< Offset: 0x043C   DMA Scatter-Gather Descriptor Table  Base Address  Register */
    __IO uint32_t TOC0;                 /*!< Offset: 0x0440   DMA Time Out Counter Ch1 and Ch0 Register */
    __IO uint32_t TOC1;                 /*!< Offset: 0x0444   DMA Time Out Counter Ch3 and Ch2 Register */
    __IO uint32_t TOC2;                 /*!< Offset: 0x0448   DMA Time Out Counter Ch5 and Ch4 Register */
    __IO uint32_t TOC3;                 /*!< Offset: 0x044C   DMA Time Out Counter Ch7 and Ch6 Register */
    __IO uint32_t TOC4;                 /*!< Offset: 0x0450   DMA Time Out Counter Ch9 and Ch8 Register */
    __IO uint32_t TOC5;                 /*!< Offset: 0x0454   DMA Time Out Counter Ch11 and Ch10 Register */
    __IO uint32_t TOC6;                 /*!< Offset: 0x0458   DMA Time Out Counter Ch13 and Ch12 Register */
    __IO uint32_t TOC7;                 /*!< Offset: 0x045C   DMA Time Out Counter Ch15 and Ch14 Register */
    uint32_t RESERVED2[8];              /*!< Offset: 0x0460 ~ 0x007C   Reserved */
    __IO uint32_t SMSEL0;               /*!< Offset: 0x0480   DMA Source Module Select Register 0 */
    __IO uint32_t SMSEL1;               /*!< Offset: 0x0484   DMA Source Module Select Register 1 */
    __IO uint32_t SMSEL2;               /*!< Offset: 0x0488   DMA Source Module Select Register 2 */
    __IO uint32_t SMSEL3;               /*!< Offset: 0x048C   DMA Source Module Select Register 3 */

} PDMA_T;

/* PDMA DSCT CTRL Bit Field Definitions */
#define PDMA_DSCT_CTRL_TFR_CNT_Pos          16                                          /*!< PDMA DSCT CTRL: TFR_CNT Position */
#define PDMA_DSCT_CTRL_TFR_CNT_Msk          (0x3FFFul << PDMA_DSCT_CTRL_TFR_CNT_Pos)    /*!< PDMA DSCT CTRL: TFR_CNT Mask */

#define PDMA_DSCT_CTRL_TWS_Pos              12                                          /*!< PDMA DSCT CTRL: TWS Position */
#define PDMA_DSCT_CTRL_TWS_Msk              (0x3ul << PDMA_DSCT_CTRL_TWS_Pos)           /*!< PDMA DSCT CTRL: TWS Mask */

#define PDMA_DSCT_CTRL_DAR_INC_Pos          10                                          /*!< PDMA DSCT CTRL: DAR_INC Position */
#define PDMA_DSCT_CTRL_DAR_INC_Msk          (0x3ul << PDMA_DSCT_CTRL_DAR_INC_Pos)       /*!< PDMA DSCT CTRL: DAR_INC Mask */

#define PDMA_DSCT_CTRL_SAR_INC_Pos          8                                           /*!< PDMA DSCT CTRL: SAR_INC Position */
#define PDMA_DSCT_CTRL_SAR_INC_Msk          (0x3ul << PDMA_DSCT_CTRL_SAR_INC_Pos)       /*!< PDMA DSCT CTRL: SAR_INC Mask */

#define PDMA_DSCT_CTRL_TABINT_DIS_Pos       7                                           /*!< PDMA DSCT CTRL: TABINT_DIS Position */
#define PDMA_DSCT_CTRL_TABINT_DIS_Msk       (1ul << PDMA_DSCT_CTRL_TABINT_DIS_Pos)      /*!< PDMA DSCT CTRL: TABINT_DIS Mask */

#define PDMA_DSCT_CTRL_BUR_SIZE_Pos         4                                           /*!< PDMA DSCT CTRL: BUR_SIZE Position */
#define PDMA_DSCT_CTRL_BUR_SIZE_Msk         (0x7ul << PDMA_DSCT_CTRL_BUR_SIZE_Pos)      /*!< PDMA DSCT CTRL: BUR_SIZE Mask */

#define PDMA_DSCT_CTRL_REQ_TYPE_Pos         2                                           /*!< PDMA DSCT CTRL: REQ_TYPE Position */
#define PDMA_DSCT_CTRL_REQ_TYPE_Msk         (1ul << PDMA_DSCT_CTRL_REQ_TYPE_Pos)        /*!< PDMA DSCT CTRL: REQ_TYPE Mask */

#define PDMA_DSCT_CTRL_DMA_MODE_Pos         0                                           /*!< PDMA DSCT CTRL: DMA_MODE Position */
#define PDMA_DSCT_CTRL_DMA_MODE_Msk         (0x3ul << PDMA_DSCT_CTRL_DMA_MODE_Pos)      /*!< PDMA DSCT CTRL: DMA_MODE Mask */

/* PDMA DSCT_SAR Bit Field Definitions */
#define PDMA_DSCT_SAR_Pos                   0                                           /*!< PDMA DSCT_SAR: ENDSAR Position */
#define PDMA_DSCT_SAR_Msk                   (0xFFFFFFFFul << PDMA_DSCT_SAR_Pos)         /*!< PDMA DSCT_SAR: ENDSAR Mask */

/* PDMA DSCT_DAR Bit Field Definitions */
#define PDMA_DSCT_DAR_Pos                   0                                           /*!< PDMA DSCT_DAR: ENDDAR Position */
#define PDMA_DSCT_DAR_Msk                   (0xFFFFFFFFul << PDMA_DSCT_DAR_Pos)         /*!< PDMA DSCT_DAR: ENDDAR Mask */

/* PDMA DSCT_NEXT Bit Field Definitions */
#define PDMA_DSCT_NEXT_OFFSET_Pos           0                                           /*!< PDMA DSCT_NEXT: OFFSET Position */
#define PDMA_DSCT_NEXT_OFFSET_Msk           (0xFFFFul << PDMA_DSCT_NEXT_OFFSET_Pos)     /*!< PDMA DSCT_NEXT: OFFSET Mask */

/* PDMA CHCON Bit Field Definitions */
#define PDMA_CHCON_CEN_Pos          0                                           /*!< PDMA CHCON: CENx Position */
#define PDMA_CHCON_CEN_Msk          (0xFFFFul << PDMA_CTL_CEN_Pos)              /*!< PDMA CHCON: CENx Mask */

