coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* PDMA STOP Bit Field Definitions */
#define PDMA_STOP_STOP_Pos          0                                           /*!< PDMA STOP: STOPx Position */
#define PDMA_STOP_STOP_Msk          (0xFFFFul << PDMA_STOP_STOP_Pos)            /*!< PDMA STOP: STOPx Mask */

/* PDMA SWREQ Bit Field Definitions */
#define PDMA_SWREQ_SW_REQ_Pos       0                                           /*!< PDMA SWREQ: SW_REQx Position */
#define PDMA_SWREQ_SW_REQ_Msk       (0xFFFFul << PDMA_SWREQ_SW_REQ_Pos)         /*!< PDMA SWREQ: SW_REQx Mask */

/* PDMA REQACTF Bit Field Definitions */
#define PDMA_REQACTF_RACT_F_Pos     0                                           /*!< PDMA REQACTF: RACT_Fx Position */
#define PDMA_REQACTF_RACT_F_Msk     (0xFFFFul << PDMA_REQACTF_RACT_F_Pos)       /*!< PDMA REQACTF: RACT_Fx Mask */

/* PDMA FPSET Bit Field Definitions */
#define PDMA_FPSET_FPIO_SET_Pos     0                                           /*!< PDMA FPSET: FPIO_SETx Position */
#define PDMA_FPSET_FPIO_SET_Msk     (0xFFFFul << PDMA_FPSET_FPIO_SET_Pos)       /*!< PDMA FPSET: FPIO_SETx Mask */

/* PDMA FPCLR Bit Field Definitions */
#define PDMA_FPCLR_FPIO_CLR_Pos     0                                           /*!< PDMA FPCLR: FPIO_CLRx Position */
#define PDMA_FPCLR_FPIO_CLR_Msk     (0xFFFFul << PDMA_FPCLR_FPIO_CLR_Pos)       /*!< PDMA FPCLR: FPIO_CLRx Mask */

/* PDMA IER Bit Field Definitions */
#define PDMA_IER_IEN_Pos            0                                           /*!< PDMA IER: IENx Position */
#define PDMA_IER_IEN_Msk            (0xFFFFul << PDMA_IER_IEN_Pos)              /*!< PDMA IER: IENx Mask */

/* PDMA ISR Bit Field Definitions */
#define PDMA_ISR_TmOut15_Pos        23                                          /*!< PDMA ISR: TmOut15 Position */
#define PDMA_ISR_TmOut15_Msk        (1ul << PDMA_ISR_TmOut15_Pos)               /*!< PDMA ISR: TmOut15 Mask */

#define PDMA_ISR_TmOut14_Pos        22                                          /*!< PDMA ISR: TmOut14 Position */
#define PDMA_ISR_TmOut14_Msk        (1ul << PDMA_ISR_TmOut14_Pos)               /*!< PDMA ISR: TmOut14 Mask */

#define PDMA_ISR_TmOut13_Pos        21                                          /*!< PDMA ISR: TmOut13 Position */
#define PDMA_ISR_TmOut13_Msk        (1ul << PDMA_ISR_TmOut13_Pos)               /*!< PDMA ISR: TmOut13 Mask */

#define PDMA_ISR_TmOut12_Pos        20                                          /*!< PDMA ISR: TmOut12 Position */
#define PDMA_ISR_TmOut12_Msk        (1ul << PDMA_ISR_TmOut12_Pos)               /*!< PDMA ISR: TmOut12 Mask */

#define PDMA_ISR_TmOut11_Pos        19                                          /*!< PDMA ISR: TmOut11 Position */
#define PDMA_ISR_TmOut11_Msk        (1ul << PDMA_ISR_TmOut11_Pos)               /*!< PDMA ISR: TmOut11 Mask */

#define PDMA_ISR_TmOut10_Pos        18                                          /*!< PDMA ISR: TmOut10 Position */
#define PDMA_ISR_TmOut10_Msk        (1ul << PDMA_ISR_TmOut10_Pos)               /*!< PDMA ISR: TmOut10 Mask */

#define PDMA_ISR_TmOut9_Pos         17                                          /*!< PDMA ISR: TmOut9 Position */
#define PDMA_ISR_TmOut9_Msk         (1ul << PDMA_ISR_TmOut9_Pos)                /*!< PDMA ISR: TmOut9 Mask */

#define PDMA_ISR_TmOut8_Pos         16                                          /*!< PDMA ISR: TmOut8 Position */
#define PDMA_ISR_TmOut8_Msk         (1ul << PDMA_ISR_TmOut8_Pos)                /*!< PDMA ISR: TmOut8 Mask */

#define PDMA_ISR_TmOut7_Pos         15                                          /*!< PDMA ISR: TmOut7 Position */
#define PDMA_ISR_TmOut7_Msk         (1ul << PDMA_ISR_TmOut7_Pos)                /*!< PDMA ISR: TmOut7 Mask */

#define PDMA_ISR_TmOut6_Pos         14                                          /*!< PDMA ISR: TmOut6 Position */
#define PDMA_ISR_TmOut6_Msk         (1ul << PDMA_ISR_TmOut6_Pos)                /*!< PDMA ISR: TmOut6 Mask */

#define PDMA_ISR_TmOut5_Pos         13                                          /*!< PDMA ISR: TmOut5 Position */
#define PDMA_ISR_TmOut5_Msk         (1ul << PDMA_ISR_TmOut5_Pos)                /*!< PDMA ISR: TmOut5 Mask */

#define PDMA_ISR_TmOut4_Pos         12                                          /*!< PDMA ISR: TmOut4 Position */
#define PDMA_ISR_TmOut4_Msk         (1ul << PDMA_ISR_TmOut4_Pos)                /*!< PDMA ISR: TmOut4 Mask */

#define PDMA_ISR_TmOut3_Pos         11                                          /*!< PDMA ISR: TmOut3 Position */
#define PDMA_ISR_TmOut3_Msk         (1ul << PDMA_ISR_TmOut3_Pos)                /*!< PDMA ISR: TmOut3 Mask */

#define PDMA_ISR_TmOut2_Pos         10                                          /*!< PDMA ISR: TmOut2 Position */
#define PDMA_ISR_TmOut2_Msk         (1ul << PDMA_ISR_TmOut2_Pos)                /*!< PDMA ISR: TmOut2 Mask */

#define PDMA_ISR_TmOut1_Pos         9                                           /*!< PDMA ISR: TmOut1 Position */
#define PDMA_ISR_TmOut1_Msk         (1ul << PDMA_ISR_TmOut1_Pos)                /*!< PDMA ISR: TmOut1 Mask */

#define PDMA_ISR_TmOut0_Pos         8                                           /*!< PDMA ISR: TmOut0 Position */
#define PDMA_ISR_TmOut0_Msk         (1ul << PDMA_ISR_TmOut0_Pos)                /*!< PDMA ISR: TmOut0 Mask */

#define PDMA_ISR_TEMPTY_F_Pos       2                                           /*!< PDMA ISR: TEMPTY_F Position */
#define PDMA_ISR_TEMPTY_F_Msk       (1ul << PDMA_ISR_TEMPTY_F_Pos)              /*!< PDMA ISR: TEMPTY_F Mask */

#define PDMA_ISR_TD_F_Pos           1                                           /*!< PDMA ISR: TD_F Position */
#define PDMA_ISR_TD_F_Msk           (1ul << PDMA_ISR_TD_F_Pos)                  /*!< PDMA ISR: TD_F Mask */

#define PDMA_ISR_TABORT_F_Pos       0                                           /*!< PDMA ISR: TABORT_F Position */
#define PDMA_ISR_TABORT_F_Msk       (1ul << PDMA_ISR_TABORT_F_Pos)              /*!< PDMA ISR: TABORT_F Mask */

/* PDMA ABTF Bit Field Definitions */
#define PDMA_ABTF_TABORT_F_Pos      0                                           /*!< PDMA ABTF: TABORT_Fx Position */
#define PDMA_ABTF_TABORT_F_Msk      (0xFFFFul << PDMA_ABTF_TABORT_F_Pos)        /*!< PDMA ABTF: TABORT_Fx Mask */

/* PDMA TDF Bit Field Definitions */
#define PDMA_TDF_TD_F_Pos           0                                           /*!< PDMA TDF: TD_Fx Position */
#define PDMA_TDF_TD_F_Msk           (0xFFFFul << PDMA_TDF_TD_F_Pos)             /*!< PDMA TDF: TD_Fx Mask */

