coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* PDMA SCATDF Bit Field Definitions */
#define PDMA_SCATDF_TEMPTY_F_Pos    0                                           /*!< PDMA SCATDF: TEMPTY_Fx Position */
#define PDMA_SCATDF_TEMPTY_F_Msk    (0xFFFFul << PDMA_SCATDF_TEMPTY_F_Pos)      /*!< PDMA SCATDF: TEMPTY_Fx Mask */

/* PDMA ACTF Bit Field Definitions */
#define PDMA_ACTF_ACTF_F_Pos        0                                           /*!< PDMA ACTF: ACTF_Fx Position */
#define PDMA_ACTF_ACTF_F_Msk        (0xFFFFul << PDMA_ACTF_ACTF_F_Pos)          /*!< PDMA ACTF: ACTF_Fx Mask */

/* PDMA SCATBA Bit Field Definitions */
#define PDMA_SCATBA_SCATBA_Pos      16                                          /*!< PDMA SCATBA: SCATBA Position */
#define PDMA_SCATBA_SCATBA_Msk      (0xFFFFul << PDMA_SCATBA_SCATBA_Pos)        /*!< PDMA SCATBA: SCATBA Mask */

/* PDMA TOC0 Bit Field Definitions */
#define PDMA_TOC0_TmOut1_Pos        16                                          /*!< PDMA TOC0: TmOut1 Position */
#define PDMA_TOC0_TmOut1_Msk        (0xFFFFul << PDMA_TOC0_TmOut1_Pos)          /*!< PDMA TOC0: TmOut1 Mask */
#define PDMA_TOC0_TmOut0_Pos        0                                           /*!< PDMA TOC0: TmOut0 Position */
#define PDMA_TOC0_TmOut0_Msk        (0xFFFFul << PDMA_TOC0_TmOut0_Pos)          /*!< PDMA TOC0: TmOut0 Mask */

/* PDMA TOC1 Bit Field Definitions */
#define PDMA_TOC1_TmOut3_Pos        16                                          /*!< PDMA TOC1: TmOut3 Position */
#define PDMA_TOC1_TmOut3_Msk        (0xFFFFul << PDMA_TOC1_TmOut3_Pos)          /*!< PDMA TOC1: TmOut3 Mask */
#define PDMA_TOC1_TmOut2_Pos        0                                           /*!< PDMA TOC1: TmOut2 Position */
#define PDMA_TOC1_TmOut2_Msk        (0xFFFFul << PDMA_TOC1_TmOut2_Pos)          /*!< PDMA TOC1: TmOut2 Mask */

/* PDMA TOC2 Bit Field Definitions */
#define PDMA_TOC2_TmOut5_Pos        16                                          /*!< PDMA TOC2: TmOut5 Position */
#define PDMA_TOC2_TmOut5_Msk        (0xFFFFul << PDMA_TOC2_TmOut5_Pos)          /*!< PDMA TOC2: TmOut5 Mask */
#define PDMA_TOC2_TmOut4_Pos        0                                           /*!< PDMA TOC2: TmOut4 Position */
#define PDMA_TOC2_TmOut4_Msk        (0xFFFFul << PDMA_TOC2_TmOut4_Pos)          /*!< PDMA TOC2: TmOut4 Mask */

/* PDMA TOC3 Bit Field Definitions */
#define PDMA_TOC3_TmOut7_Pos        16                                          /*!< PDMA TOC3: TmOut7 Position */
#define PDMA_TOC3_TmOut7_Msk        (0xFFFFul << PDMA_TOC3_TmOut7_Pos)          /*!< PDMA TOC3: TmOut7 Mask */
#define PDMA_TOC3_TmOut6_Pos        0                                           /*!< PDMA TOC3: TmOut6 Position */
#define PDMA_TOC3_TmOut6_Msk        (0xFFFFul << PDMA_TOC3_TmOut6_Pos)          /*!< PDMA TOC3: TmOut6 Mask */

/* PDMA TOC4 Bit Field Definitions */
#define PDMA_TOC4_TmOut9_Pos        16                                          /*!< PDMA TOC4: TmOut9 Position */
#define PDMA_TOC4_TmOut9_Msk        (0xFFFFul << PDMA_TOC4_TmOut9_Pos)          /*!< PDMA TOC4: TmOut9 Mask */
#define PDMA_TOC4_TmOut8_Pos        0                                           /*!< PDMA TOC4: TmOut8 Position */
#define PDMA_TOC4_TmOut8_Msk        (0xFFFFul << PDMA_TOC4_TmOut8_Pos)          /*!< PDMA TOC4: TmOut8 Mask */

/* PDMA TOC5 Bit Field Definitions */
#define PDMA_TOC5_TmOut11_Pos       16                                          /*!< PDMA TOC5: TmOut11 Position */
#define PDMA_TOC5_TmOut11_Msk       (0xFFFFul << PDMA_TOC5_TmOut11_Pos)         /*!< PDMA TOC5: TmOut11 Mask */
#define PDMA_TOC5_TmOut10_Pos       0                                           /*!< PDMA TOC5: TmOut10 Position */
#define PDMA_TOC5_TmOut10_Msk       (0xFFFFul << PDMA_TOC5_TmOut10_Pos)         /*!< PDMA TOC5: TmOut10 Mask */

/* PDMA TOC6 Bit Field Definitions */
#define PDMA_TOC6_TmOut13_Pos       16                                          /*!< PDMA TOC6: TmOut13 Position */
#define PDMA_TOC6_TmOut13_Msk       (0xFFFFul << PDMA_TOC6_TmOut13_Pos)         /*!< PDMA TOC6: TmOut13 Mask */
#define PDMA_TOC6_TmOut12_Pos       0                                           /*!< PDMA TOC6: TmOut12 Position */
#define PDMA_TOC6_TmOut12_Msk       (0xFFFFul << PDMA_TOC6_TmOut12_Pos)         /*!< PDMA TOC6: TmOut12 Mask */

/* PDMA TOC7 Bit Field Definitions */
#define PDMA_TOC7_TmOut15_Pos       16                                          /*!< PDMA TOC7: TmOut15 Position */
#define PDMA_TOC7_TmOut15_Msk       (0xFFFFul << PDMA_TOC7_TmOut15_Pos)         /*!< PDMA TOC7: TmOut15 Mask */
#define PDMA_TOC7_TmOut14_Pos       0                                           /*!< PDMA TOC7: TmOut14 Position */
#define PDMA_TOC7_TmOut14_Msk       (0xFFFFul << PDMA_TOC7_TmOut14_Pos)         /*!< PDMA TOC7: TmOut14 Mask */

/* PDMA SMSEL0 Bit Field Definitions */
#define PDMA_SMSEL0_CH3_SEL_Pos     24                                          /*!< PDMA SMSEL0: CH3_SEL Position */
#define PDMA_SMSEL0_CH3_SEL_Msk     (0x1Ful << PDMA_SMSEL0_CH3_SEL_Pos)         /*!< PDMA SMSEL0: CH3_SEL Mask */
#define PDMA_SMSEL0_CH2_SEL_Pos     16                                          /*!< PDMA SMSEL0: CH2_SEL Position */
#define PDMA_SMSEL0_CH2_SEL_Msk     (0x1Ful << PDMA_SMSEL0_CH2_SEL_Pos)         /*!< PDMA SMSEL0: CH2_SEL Mask */
#define PDMA_SMSEL0_CH1_SEL_Pos     8                                           /*!< PDMA SMSEL0: CH1_SEL Position */
#define PDMA_SMSEL0_CH1_SEL_Msk     (0x1Ful << PDMA_SMSEL0_CH1_SEL_Pos)         /*!< PDMA SMSEL0: CH1_SEL Mask */
#define PDMA_SMSEL0_CH0_SEL_Pos     0                                           /*!< PDMA SMSEL0: CH0_SEL Position */
#define PDMA_SMSEL0_CH0_SEL_Msk     (0x1Ful << PDMA_SMSEL0_CH0_SEL_Pos)         /*!< PDMA SMSEL0: CH0_SEL Mask */

/* PDMA SMSEL1 Bit Field Definitions */
#define PDMA_SMSEL1_CH7_SEL_Pos     24                                          /*!< PDMA SMSEL1: CH7_SEL Position */
#define PDMA_SMSEL1_CH7_SEL_Msk     (0x1Ful << PDMA_SMSEL1_CH7_SEL_Pos)         /*!< PDMA SMSEL1: CH7_SEL Mask */
#define PDMA_SMSEL1_CH6_SEL_Pos     16                                          /*!< PDMA SMSEL1: CH6_SEL Position */
#define PDMA_SMSEL1_CH6_SEL_Msk     (0x1Ful << PDMA_SMSEL1_CH6_SEL_Pos)         /*!< PDMA SMSEL1: CH6_SEL Mask */
#define PDMA_SMSEL1_CH5_SEL_Pos     8                                           /*!< PDMA SMSEL1: CH5_SEL Position */
#define PDMA_SMSEL1_CH5_SEL_Msk     (0x1Ful << PDMA_SMSEL1_CH5_SEL_Pos)         /*!< PDMA SMSEL1: CH5_SEL Mask */
#define PDMA_SMSEL1_CH4_SEL_Pos     0                                           /*!< PDMA SMSEL1: CH4_SEL Position */
#define PDMA_SMSEL1_CH4_SEL_Msk     (0x1Ful << PDMA_SMSEL1_CH4_SEL_Pos)         /*!< PDMA SMSEL1: CH4_SEL Mask */

/* PDMA SMSEL2 Bit Field Definitions */
#define PDMA_SMSEL2_CH11_SEL_Pos    24                                          /*!< PDMA SMSEL2: CH11_SEL Position */
#define PDMA_SMSEL2_CH11_SEL_Msk    (0x1Ful << PDMA_SMSEL2_CH11_SEL_Pos)        /*!< PDMA SMSEL2: CH11_SEL Mask */
#define PDMA_SMSEL2_CH10_SEL_Pos    16                                          /*!< PDMA SMSEL2: CH10_SEL Position */
#define PDMA_SMSEL2_CH10_SEL_Msk    (0x1Ful << PDMA_SMSEL2_CH10_SEL_Pos)        /*!< PDMA SMSEL2: CH10_SEL Mask */
#define PDMA_SMSEL2_CH9_SEL_Pos     8                                           /*!< PDMA SMSEL2: CH9_SEL Position */
#define PDMA_SMSEL2_CH9_SEL_Msk     (0x1Ful << PDMA_SMSEL2_CH9_SEL_Pos)         /*!< PDMA SMSEL2: CH9_SEL Mask */
#define PDMA_SMSEL2_CH8_SEL_Pos     0                                           /*!< PDMA SMSEL2: CH8_SEL Position */
#define PDMA_SMSEL2_CH8_SEL_Msk     (0x1Ful << PDMA_SMSEL2_CH8_SEL_Pos)         /*!< PDMA SMSEL2: CH8_SEL Mask */

