coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* PDMA SMSEL3 Bit Field Definitions */
#define PDMA_SMSEL3_CH15_SEL_Pos    24                                          /*!< PDMA SMSEL3: CH15_SEL Position */
#define PDMA_SMSEL3_CH15_SEL_Msk    (0x1Ful << PDMA_SMSEL3_CH15_SEL_Pos)        /*!< PDMA SMSEL3: CH15_SEL Mask */
#define PDMA_SMSEL3_CH14_SEL_Pos    16                                          /*!< PDMA SMSEL3: CH14_SEL Position */
#define PDMA_SMSEL3_CH14_SEL_Msk    (0x1Ful << PDMA_SMSEL3_CH14_SEL_Pos)        /*!< PDMA SMSEL3: CH14_SEL Mask */
#define PDMA_SMSEL3_CH13_SEL_Pos    8                                           /*!< PDMA SMSEL3: CH13_SEL Position */
#define PDMA_SMSEL3_CH13_SEL_Msk    (0x1Ful << PDMA_SMSEL3_CH13_SEL_Pos)        /*!< PDMA SMSEL3: CH13_SEL Mask */
#define PDMA_SMSEL3_CH12_SEL_Pos    0                                           /*!< PDMA SMSEL3: CH12_SEL Position */
#define PDMA_SMSEL3_CH12_SEL_Msk    (0x1Ful << PDMA_SMSEL3_CH12_SEL_Pos)        /*!< PDMA SMSEL3: CH12_SEL Mask */


/*@}*/ /* end of group NUC400_PDMA */



/*------------- USB Host OHCI Controller (USBH) -----------------------------*/
/** @addtogroup NUC400_USBH NUC400 Host OHCI Controller Register (USBH)
  @{
*/
typedef struct {
    __I  uint32_t HcRev;                        /*!< Offset: 0x0000   Host Controller Revision Register                  */
    __IO uint32_t HcControl;                    /*!< Offset: 0x0004   Host Controller Control Register                   */
    __IO uint32_t HcComSts;                    /*!< Offset: 0x0008   Host Controller Command Status Register            */
    __IO uint32_t HcIntSts;                    /*!< Offset: 0x000C   Host Controller Interrupt Status Register          */
    __IO uint32_t HcIntEn;                    /*!< Offset: 0x0010   Host Controller Interrupt Enable Register          */
    __IO uint32_t HcIntDis;                    /*!< Offset: 0x0014   Host Controller Interrupt Disable Register         */
    __IO uint32_t HcHCCA;                        /*!< Offset: 0x0018   Host Controller Communication Area Register        */
    __IO uint32_t HcPerCED;                    /*!< Offset: 0x001C   Host Controller Period Current ED Register         */
    __IO uint32_t HcCtrHED;                    /*!< Offset: 0x0020   Host Controller Control Head ED Register           */
    __IO uint32_t HcCtrCED;                    /*!< Offset: 0x0024   Host Controller Control Current ED Register        */
    __IO uint32_t HcBlkHED;                    /*!< Offset: 0x0028   Host Controller Bulk Head ED Register              */
    __IO uint32_t HcBlkCED;                    /*!< Offset: 0x002C   Host Controller Bulk Current ED Register           */
    __IO uint32_t HcDoneH;                    /*!< Offset: 0x0030   Host Controller Done Head Register                 */
    __IO uint32_t HcFmIntv;                    /*!< Offset: 0x0034   Host Controller Frame Interval Register            */
    __I  uint32_t HcFmRem;                    /*!< Offset: 0x0038   Host Controller Frame Remaining Register           */
    __I  uint32_t HcFNum;                        /*!< Offset: 0x003C   Host Controller Frame Number Register             */
    __IO uint32_t HcPerSt;                    /*!< Offset: 0x0040   Host Controller Periodic Start Register            */
    __IO uint32_t HcLSTH;                         /*!< Offset: 0x0044   Host Controller Low Speed Threshold Register       */
    __IO  uint32_t HcRhDeA;                    /*!< Offset: 0x0048   Host Controller Root Hub Descriptor A Register     */
    __I  uint32_t HcRhDeB;                    /*!< Offset: 0x004C   Host Controller Root Hub Descriptor A Register     */
    __IO uint32_t HcRhSts;                    /*!< Offset: 0x0050   Host Controller Root Hub Status Register           */
    __IO uint32_t HcRhPrt[2];                    /*!< Offset: 0x0054   Host Controller Root Hub Port Status [1]           */
    uint32_t RESERVED0[105];             /*!< Offset: 0x005C ~ 0x01FC   Reserved                                  */
    __IO uint32_t MiscCtrl;                    /*!< Offset: 0x0200   USB Miscellaneous Control Register                 */
    __IO uint32_t OpModEn;                    /*!< Offset: 0x0204   USB Operational Mode Enable Register               */
} USBH_T;

/********************* Bit definition of HcRev register ***********************/
#define USBH_HcRev_Rev_Pos                0                                    /*!<USBH HcRev: Rev Position */
#define USBH_HcRev_Rev_Msk                (1ul << USBH_HcRev_Rev_Pos)           /*!<USBH HcRev: Rev Mask */

/********************* Bit definition of HcControl register ***********************/
#define USBH_HcControl_CtrlBlkRatio_Pos    0                                    /*!<USBH HcControl: CtrlBlkRatio Position */
#define USBH_HcControl_CtrlBlkRatio_Msk    (3ul << USBH_HcControl_CtrlBlkRatio_Pos) /*!<USBH HcControl: CtrlBlkRatio Mask */
#define USBH_HcControl_PeriEn_Pos        2                                    /*!<USBH HcControl: PeriEn Position */
#define USBH_HcControl_PeriEn_Msk        (1ul << USBH_HcControl_PeriEn_Pos)     /*!<USBH HcControl: PeriEn Mask */
#define USBH_HcControl_ISOEn_Pos        3                                    /*!<USBH HcControl: ISOEn Position */
#define USBH_HcControl_ISOEn_Msk        (1ul << USBH_HcControl_ISOEn_Pos)     /*!<USBH HcControl: ISOEn Mask */
#define USBH_HcControl_CtrlEn_Pos        4                                    /*!<USBH HcControl: CtrlEn Position */
#define USBH_HcControl_CtrlEn_Msk        (1ul << USBH_HcControl_CtrlEn_Pos)     /*!<USBH HcControl: CtrlEn Mask */
#define USBH_HcControl_BlkEn_Pos        5                                    /*!<USBH HcControl: BlkEn Position */
#define USBH_HcControl_BlkEn_Msk        (1ul << USBH_HcControl_BlkEn_Pos)     /*!<USBH HcControl: BlkEn Mask */
#define USBH_HcControl_HcFunc_Pos        6                                    /*!<USBH HcControl: HcFunc Position */
#define USBH_HcControl_HcFunc_Msk        (3ul << USBH_HcControl_HcFunc_Pos)     /*!<USBH HcControl: HcFunc Mask */
#define USBH_HcControl_IntRoute_Pos        8                                    /*!<USBH HcControl: IntRoute Position */
#define USBH_HcControl_IntRoute_Msk        (1ul << USBH_HcControl_IntRoute_Pos)/*!<USBH HcControl: IntRoute Mask */
#define USBH_HcControl_RWake_Pos        9                                    /*!<USBH HcControl: RWake Position */
#define USBH_HcControl_RWake_Msk        (1ul << USBH_HcControl_RWake_Pos)     /*!<USBH HcControl: RWake Mask */
#define USBH_HcControl_RWakeEn_Pos        10                                    /*!<USBH HcControl: RWakeEn Position */
#define USBH_HcControl_RWakeEn_Msk        (1ul << USBH_HcControl_RWakeEn_Pos) /*!<USBH HcControl: RWakeEn Mask */

/********************* Bit definition of HcComSts register ********************/
#define USBH_HcComSts_HCReset_Pos        0                                    /*!<USBH HcComSts: HCReset Position */
#define USBH_HcComSts_HCReset_Msk        (1ul << USBH_HcComSts_HCReset_Pos)     /*!<USBH HcComSts: HCReset Mask */
#define USBH_HcComSts_CtrlFill_Pos        1                                    /*!<USBH HcComSts: CtrlFill Position */
#define USBH_HcComSts_CtrlFill_Msk        (1ul << USBH_HcComSts_CtrlFill_Pos) /*!<USBH HcComSts: CtrlFill Mask */
#define USBH_HcComSts_BlkFill_Pos        2                                    /*!<USBH HcComSts: BlkFill Position */
#define USBH_HcComSts_BlkFill_Msk        (1ul << USBH_HcComSts_BlkFill_Pos)     /*!<USBH HcComSts: BlkFill Mask */
#define USBH_HcComSts_OCReq_Pos            3                                    /*!<USBH HcComSts: OCReq Position */
#define USBH_HcComSts_OCReq_Msk            (1ul << USBH_HcComSts_OCReq_Pos)     /*!<USBH HcComSts: OCReq Mask */
#define USBH_HcComSts_SchOverRun_Pos    16                                    /*!<USBH HcComSts: SchOverRun Position */
#define USBH_HcComSts_SchOverRun_Msk    (3ul << USBH_HcComSts_SchOverRun_Pos)     /*!<USBH HcComSts: SchOverRun Mask */

/********************* Bit definition of HcIntSts register ********************/
#define USBH_HcIntSts_SchOR_Pos            0                                    /*!<USBH HcIntSts: SchOR Position */
#define USBH_HcIntSts_SchOR_Msk            (1ul << USBH_HcIntSts_SchOR_Pos)     /*!<USBH HcIntSts: SchOR Mask */
#define USBH_HcIntSts_WBDnHD_Pos        1                                    /*!<USBH HcIntSts: WBDnHD Position */
#define USBH_HcIntSts_WBDnHD_Msk        (1ul << USBH_HcIntSts_WBDnHD_Pos)     /*!<USBH HcIntSts: WBDnHD Mask */
#define USBH_HcIntSts_SOF_Pos            2                                    /*!<USBH HcIntSts: SOF Position */
#define USBH_HcIntSts_SOF_Msk            (1ul << USBH_HcIntSts_SOF_Pos)         /*!<USBH HcIntSts: SOF Mask */
#define USBH_HcIntSts_Resume_Pos        3                                    /*!<USBH HcIntSts: Resume Position */
#define USBH_HcIntSts_Resume_Msk        (1ul << USBH_HcIntSts_Resume_Pos)     /*!<USBH HcIntSts: Resume Mask */
#define USBH_HcIntSts_UnRecErr_Pos        4                                    /*!<USBH HcIntSts: UnRecErr Position */
#define USBH_HcIntSts_UnRecErr_Msk        (1ul << USBH_HcIntSts_UnRecErr_Pos) /*!<USBH HcIntSts: UnRecErr Mask */
#define USBH_HcIntSts_FNOF_Pos            5                                    /*!<USBH HcIntSts: FNOF Position */
#define USBH_HcIntSts_FNOF_Msk            (1ul << USBH_HcIntSts_FNOF_Pos)     /*!<USBH HcIntSts: FNOF Mask */
#define USBH_HcIntSts_RHSC_Pos            6                                    /*!<USBH HcIntSts: RHSC Position */
#define USBH_HcIntSts_RHSC_Msk            (1ul << USBH_HcIntSts_RHSC_Pos)     /*!<USBH HcIntSts: RHSC Mask */
#define USBH_HcIntSts_OC_Pos            30                                    /*!<USBH HcIntSts: OC Position */
#define USBH_HcIntSts_OC_Msk            (1ul << USBH_HcIntSts_OC_Pos)         /*!<USBH HcIntSts: OC Mask */

/********************* Bit definition of HcIntEn register *********************/
#define USBH_HcIntEn_SchOREn_Pos        0                                    /*!<USBH HcIntEn: SchOREn Position */
#define USBH_HcIntEn_SchOREn_Msk        (1ul << USBH_HcIntEn_SchOREn_Pos)     /*!<USBH HcIntEn: SchOREn Mask */
#define USBH_HcIntEn_WBDHEn_Pos            1                                    /*!<USBH HcIntEn: WBDHEn Position */
#define USBH_HcIntEn_WBDHEn_Msk            (1ul << USBH_HcIntEn_WBDHEn_Pos)     /*!<USBH HcIntEn: WBDHEn Mask */
#define USBH_HcIntEn_SOFEn_Pos            2                                    /*!<USBH HcIntEn: SOFEn Position */
#define USBH_HcIntEn_SOFEn_Msk            (1ul << USBH_HcIntEn_SOFEn_Pos)     /*!<USBH HcIntEn: SOFEn Mask */
#define USBH_HcIntEn_ResuEn_Pos            3                                    /*!<USBH HcIntEn: ResuEn Position */
#define USBH_HcIntEn_ResuEn_Msk            (1ul << USBH_HcIntEn_ResuEn_Pos)     /*!<USBH HcIntEn: ResuEn Mask */
#define USBH_HcIntEn_URErrEn_Pos        4                                    /*!<USBH HcIntEn: URErrEn Position */
#define USBH_HcIntEn_URErrEn_Msk        (1ul << USBH_HcIntEn_URErrEn_Pos)     /*!<USBH HcIntEn: URErrEn Mask */
#define USBH_HcIntEn_FNOFEn_Pos            5                                    /*!<USBH HcIntEn: FNOFEn Position */
#define USBH_HcIntEn_FNOFEn_Msk            (1ul << USBH_HcIntEn_FNOFEn_Pos)     /*!<USBH HcIntEn: FNOFEn Mask */
#define USBH_HcIntEn_RHSCEn_Pos            6                                    /*!<USBH HcIntEn: RHSCEn Position */
#define USBH_HcIntEn_RHSCEn_Msk            (1ul << USBH_HcIntEn_RHSCEn_Pos)     /*!<USBH HcIntEn: RHSCEn Mask */
#define USBH_HcIntEn_OCEn_Pos            30                                    /*!<USBH HcIntEn: OCEn Position */
#define USBH_HcIntEn_OCEn_Msk            (1ul << USBH_HcIntEn_OCEn_Pos)         /*!<USBH HcIntEn: OCEn Mask */
#define USBH_HcIntEn_IntEn_Pos            31                                    /*!<USBH HcIntEn: IntEn Position */
#define USBH_HcIntEn_IntEn_Msk            (1ul << USBH_HcIntEn_IntEn_Pos)     /*!<USBH HcIntEn: IntEn Mask */

/********************* Bit definition of HcIntDis register ********************/
#define USBH_HcIntDis_SchORDis_Pos        0                                    /*!<USBH HcIntDis: SchORDis Position */
#define USBH_HcIntDis_SchORDis_Msk        (1ul << USBH_HcIntDis_SchORDis_Pos) /*!<USBH HcIntDis: SchORDis Mask */
#define USBH_HcIntDis_WBDHDis_Pos        1                                    /*!<USBH HcIntDis: WBDHDis Position */
#define USBH_HcIntDis_WBDHDis_Msk        (1ul << USBH_HcIntDis_WBDHDis_Pos)     /*!<USBH HcIntDis: WBDHDis Mask */
#define USBH_HcIntDis_SOFDis_Pos        2                                    /*!<USBH HcIntDis: SOFDis Position */
#define USBH_HcIntDis_SOFDis_Msk        (1ul << USBH_HcIntDis_SOFDis_Pos)     /*!<USBH HcIntDis: SOFDis Mask */
#define USBH_HcIntDis_ResuDis_Pos        3                                    /*!<USBH HcIntDis: ResuDis Position */
#define USBH_HcIntDis_ResuDis_Msk        (1ul << USBH_HcIntDis_ResuDis_Pos)     /*!<USBH HcIntDis: ResuDis Mask */
#define USBH_HcIntDis_URErrDis_Pos        4                                    /*!<USBH HcIntDis: URErrDis Position */
#define USBH_HcIntDis_URErrDis_Msk        (1ul << USBH_HcIntDis_URErrDis_Pos) /*!<USBH HcIntDis: URErrDis Mask */
#define USBH_HcIntDis_FNOFDis_Pos        5                                    /*!<USBH HcIntDis: FNOFDis Position */
#define USBH_HcIntDis_FNOFDis_Msk        (1ul << USBH_HcIntDis_FNOFDis_Pos)     /*!<USBH HcIntDis: FNOFDis Mask */
#define USBH_HcIntDis_RHSCDis_Pos        6                                    /*!<USBH HcIntDis: RHSCDis Position */
#define USBH_HcIntDis_RHSCDis_Msk        (1ul << USBH_HcIntDis_RHSCDis_Pos)     /*!<USBH HcIntDis: RHSCDis Mask */
#define USBH_HcIntDis_OCDis_Pos            30                                    /*!<USBH HcIntDis: OCDis Position */
#define USBH_HcIntDis_OCDis_Msk            (1ul << USBH_HcIntDis_OCDis_Pos)     /*!<USBH HcIntDis: OCDis Mask */
#define USBH_HcIntDis_IntDis_Pos        31                                    /*!<USBH HcIntDis: IntDis Position */
#define USBH_HcIntDis_IntDis_Msk        (1ul << USBH_HcIntDis_IntDis_Pos)     /*!<USBH HcIntDis: IntDis Mask */

