coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/********************* Bit definition of HcFmIntv register ********************/
#define USBH_HcFmIntv_FmInterval_Pos    0                                    /*!<USBH HcFmIntv: FmInterval Position */
#define USBH_HcFmIntv_FmInterval_Msk    (0x3ffful << USBH_HcFmIntv_FmInterval_Pos)     /*!<USBH HcFmIntv: FmInterval Mask */
#define USBH_HcFmIntv_FSDPktCnt_Pos        16                                    /*!<USBH HcFmIntv: FSDPktCnt Position */
#define USBH_HcFmIntv_FSDPktCnt_Msk        (0x7ffful << USBH_HcFmIntv_FSDPktCnt_Pos)     /*!<USBH HcFmIntv: FSDPktCnt Mask */
#define USBH_HcFmIntv_FmIntvT_Pos        31                                    /*!<USBH HcFmIntv: FmIntvT Position */
#define USBH_HcFmIntv_FmIntvT_Msk        (1ul << USBH_HcFmIntv_FmIntvT_Pos)     /*!<USBH HcFmIntv: FmIntvT Mask */

/********************* Bit definition of HcFmRem register *********************/
#define USBH_HcFmRem_FmRemain_Pos        0                                    /*!<USBH HcFmRem: FmRemain Position */
#define USBH_HcFmRem_FmRemain_Msk        (0x3ffful << USBH_HcFmRem_FmRemain_Pos)     /*!<USBH HcFmRem: FmRemain Mask */
#define USBH_HcFmRem_FmRemT_Pos            31                                    /*!<USBH HcFmRem: FmRemT Position */
#define USBH_HcFmRem_FmRemT_Msk            (1ul << USBH_HcFmRem_FmRemT_Pos)     /*!<USBH HcFmRem: FmRemT Mask */

/********************* Bit definition of HcFmRem register *********************/
#define USBH_HcFNum_FmNum_Pos            0                                    /*!<USBH HcFNum: FmNum Position */
#define USBH_HcFNum_FmNum_Msk            (0xfffful << USBH_HcFNum_FmNum_Pos) /*!<USBH HcFNum: FmNum Mask */

/********************* Bit definition of HcPerSt register *********************/
#define USBH_HcPerSt_PeriStart_Pos        0                                    /*!<USBH HcPerSt: PeriStart Position */
#define USBH_HcPerSt_PeriStart_Msk        (0x3ffful << USBH_HcPerSt_PeriStart_Pos) /*!<USBH HcPerSt: PeriStart Mask */

/********************* Bit definition of HcLSTH register **********************/
#define USBH_HcLSTH_LST_Pos                0                                    /*!<USBH HcLSTH: LST Position */
#define USBH_HcLSTH_LST_Msk                (0xffful << USBH_HcLSTH_LST_Pos)    /*!<USBH HcLSTH: LST Mask */

/********************* Bit definition of HcRhDeA register *********************/
#define USBH_HcRhDeA_DPortNum_Pos        0                                    /*!<USBH HcRhDeA: DPortNum Position */
#define USBH_HcRhDeA_DPortNum_Msk        (0xfful << USBH_HcRhDeA_DPortNum_Pos)    /*!<USBH HcRhDeA: DPortNum Mask */
#define USBH_HcRhDeA_PSM_Pos            8                                    /*!<USBH HcRhDeA: PSM Position */
#define USBH_HcRhDeA_PSM_Msk            (1ul << USBH_HcRhDeA_PSM_Pos)        /*!<USBH HcRhDeA: PSM Mask */
#define USBH_HcRhDeA_NPS_Pos            9                                    /*!<USBH HcRhDeA: NPS Position */
#define USBH_HcRhDeA_NPS_Msk            (1ul << USBH_HcRhDeA_NPS_Pos)        /*!<USBH HcRhDeA: NPS Mask */
#define USBH_HcRhDeA_DevType_Pos        10                                    /*!<USBH HcRhDeA: DevType Position */
#define USBH_HcRhDeA_DevType_Msk        (1ul << USBH_HcRhDeA_DevType_Pos)    /*!<USBH HcRhDeA: DevType Mask */
#define USBH_HcRhDeA_OCPM_Pos            11                                    /*!<USBH HcRhDeA: OCPM Position */
#define USBH_HcRhDeA_OCPM_Msk            (1ul << USBH_HcRhDeA_OCPM_Pos)        /*!<USBH HcRhDeA: OCPM Mask */
#define USBH_HcRhDeA_NOCP_Pos            12                                    /*!<USBH HcRhDeA: NOCP Position */
#define USBH_HcRhDeA_NOCP_Msk            (1ul << USBH_HcRhDeA_NOCP_Pos)        /*!<USBH HcRhDeA: NOCP Mask */
#define USBH_HcRhDeA_PwrGDT_Pos            24                                    /*!<USBH HcRhDeA: PwrGDT Position */
#define USBH_HcRhDeA_PwrGDT_Msk            (0xfful << USBH_HcRhDeA_PwrGDT_Pos)    /*!<USBH HcRhDeA: PwrGDT Mask */

/********************* Bit definition of HcRhDeB register *********************/
#define USBH_HcRhDeB_DevRemove_Pos        0                                    /*!<USBH HcRhDeB: DevRemove Position */
#define USBH_HcRhDeB_DevRemove_Msk        (0xfffful << USBH_HcRhDeB_DevRemove_Pos)    /*!<USBH HcRhDeB: DevRemove Mask */
#define USBH_HcRhDeB_PPCM_Pos            16                                    /*!<USBH HcRhDeB: PPCM Position */
#define USBH_HcRhDeB_PPCM_Msk            (0xfffful << USBH_HcRhDeB_PPCM_Pos)    /*!<USBH HcRhDeB: PPCM Mask */

/********************* Bit definition of HcRhSts register *********************/
#define USBH_HcRhSts_LPS_Pos            0                                /*!<USBH HcRhSts: LPS Position */
#define USBH_HcRhSts_LPS_Msk            (1ul << USBH_HcRhSts_LPS_Pos)    /*!<USBH HcRhSts: LPS Mask */
#define USBH_HcRhSts_OC_Pos                1                                /*!<USBH HcRhSts: OC Position */
#define USBH_HcRhSts_OC_Msk                (1ul << USBH_HcRhSts_OC_Pos)    /*!<USBH HcRhSts: OC Mask */
#define USBH_HcRhSts_DRWEn_Pos            15                                /*!<USBH HcRhSts: DRWEn Position */
#define USBH_HcRhSts_DRWEn_Msk            (1ul << USBH_HcRhSts_DRWEn_Pos)    /*!<USBH HcRhSts: DRWEn Mask */
#define USBH_HcRhSts_LPSC_Pos            16                                /*!<USBH HcRhSts: LPSC Position */
#define USBH_HcRhSts_LPSC_Msk            (1ul << USBH_HcRhSts_LPSC_Pos)    /*!<USBH HcRhSts: LPSC Mask */
#define USBH_HcRhSts_OCIC_Pos            17                                /*!<USBH HcRhSts: OCIC Position */
#define USBH_HcRhSts_OCIC_Msk            (1ul << USBH_HcRhSts_OCIC_Pos)    /*!<USBH HcRhSts: OCIC Mask */
#define USBH_HcRhSts_RWEClr_Pos            31                                /*!<USBH HcRhSts: RWEClr Position */
#define USBH_HcRhSts_RWEClr_Msk            (1ul << USBH_HcRhSts_RWEClr_Pos)/*!<USBH HcRhSts: RWEClr Mask */

/********************* Bit definition of HcRhPrt1/2 register*******************/
#define USBH_HcRhPrt_CC_Pos                0                                /*!<USBH HcRhPrt: CC Position */
#define USBH_HcRhPrt_CC_Msk                (1ul << USBH_HcRhSts_CC_Pos)    /*!<USBH HcRhPrt: CC Mask */
#define USBH_HcRhPrt_PE_Pos                1                                /*!<USBH HcRhPrt: PE Position */
#define USBH_HcRhPrt_PE_Msk                (1ul << USBH_HcRhSts_PE_Pos)    /*!<USBH HcRhPrt: PE Mask */
#define USBH_HcRhPrt_PS_Pos                2                                /*!<USBH HcRhPrt: PS Position */
#define USBH_HcRhPrt_PS_Msk                (1ul << USBH_HcRhSts_PS_Pos)    /*!<USBH HcRhPrt: PS Mask */
#define USBH_HcRhPrt_POC_Pos            3                                /*!<USBH HcRhPrt: POC Position */
#define USBH_HcRhPrt_POC_Msk            (1ul << USBH_HcRhSts_POC_Pos)    /*!<USBH HcRhPrt: POC Mask */
#define USBH_HcRhPrt_PR_Pos                4                                /*!<USBH HcRhPrt: PR Position */
#define USBH_HcRhPrt_PR_Msk                (1ul << USBH_HcRhSts_PR_Pos)    /*!<USBH HcRhPrt: PR Mask */
#define USBH_HcRhPrt_PPS_Pos            8                                /*!<USBH HcRhPrt: PPS Position */
#define USBH_HcRhPrt_PPS_Msk            (1ul << USBH_HcRhSts_PPS_Pos)    /*!<USBH HcRhPrt: PPS Mask */
#define USBH_HcRhPrt_LSDev_Pos            9                                /*!<USBH HcRhPrt: LSDev Position */
#define USBH_HcRhPrt_LSDev_Msk            (1ul << USBH_HcRhSts_LSDev_Pos)    /*!<USBH HcRhPrt: LSDev Mask */
#define USBH_HcRhPrt_CSC_Pos            16                                /*!<USBH HcRhPrt: CSC Position */
#define USBH_HcRhPrt_CSC_Msk            (1ul << USBH_HcRhSts_CSC_Pos)    /*!<USBH HcRhPrt: CSC Mask */
#define USBH_HcRhPrt_PESC_Pos            17                                /*!<USBH HcRhPrt: PESC Position */
#define USBH_HcRhPrt_PESC_Msk            (1ul << USBH_HcRhSts_PESC_Pos)    /*!<USBH HcRhPrt: PESC Mask */
#define USBH_HcRhPrt_PSSC_Pos            18                                /*!<USBH HcRhPrt: PSSC Position */
#define USBH_HcRhPrt_PSSC_Msk            (1ul << USBH_HcRhSts_PSSC_Pos)    /*!<USBH HcRhPrt: PSSC Mask */
#define USBH_HcRhPrt_POCIC_Pos            19                                /*!<USBH HcRhPrt: POCIC Position */
#define USBH_HcRhPrt_POCIC_Msk            (1ul << USBH_HcRhSts_POCIC_Pos)    /*!<USBH HcRhPrt: POCIC Mask */
#define USBH_HcRhPrt_PRSC_Pos            20                                /*!<USBH HcRhPrt: PRSC Position */
#define USBH_HcRhPrt_PRSC_Msk            (1ul << USBH_HcRhSts_PRSC_Pos)    /*!<USBH HcRhPrt: PRSC Mask */

/********************* Bit definition of MiscCtrl register*********************/
#define USBH_MiscCtrl_StbyEn_Pos        27                                /*!<USBH MiscCtrl: StbyEn Position */
#define USBH_MiscCtrl_StbyEn_Msk        (1ul << USBH_MiscCtrl_StbyEn_Pos)    /*!<USBH MiscCtrl: StbyEn Mask */

/********************* Bit definition of OpModEn register**********************/
#define USBH_OpModEn_DBR16_Pos            0                                /*!<USBH OpModEn: DBR16 Position */
#define USBH_OpModEn_DBR16_Msk            (1ul << USBH_OpModEn_DBR16_Pos)    /*!<USBH OpModEn: DBR16 Mask */
#define USBH_OpModEn_ABORT_Pos            1                                /*!<USBH OpModEn: ABORT Position */
#define USBH_OpModEn_ABORT_Msk            (1ul << USBH_OpModEn_ABORT_Msk)    /*!<USBH OpModEn: ABORT Mask */
#define USBH_OpModEn_OCALow_Pos            3                                /*!<USBH OpModEn: OCALow Position */
#define USBH_OpModEn_OCALow_Msk            (1ul << USBH_OpModEn_OCALow_Pos)/*!<USBH OpModEn: OCALow Mask */
#define USBH_OpModEn_PPCLow_Pos            4                                /*!<USBH OpModEn: PPCLow Position */
#define USBH_OpModEn_PPCLow_Msk            (1ul << USBH_OpModEn_PPCLow_Pos)/*!<USBH OpModEn: PPCLow Mask */
#define USBH_OpModEn_SIEPDis_Pos        8                                /*!<USBH OpModEn: SIEPDis Position */
#define USBH_OpModEn_SIEPDis_Msk        (1ul << USBH_OpModEn_SIEPDis_Pos)/*!<USBH OpModEn: SIEPDis Mask */
#define USBH_OpModEn_DisPrt1_Pos        16                                /*!<USBH OpModEn: DisPrt1 Position */
#define USBH_OpModEn_DisPrt1_Msk        (1ul << USBH_OpModEn_DisPrt1_Pos)/*!<USBH OpModEn: DisPrt1 Mask */
#define USBH_OpModEn_DisPrt2_Pos        17                                /*!<USBH OpModEn: DisPrt2 Position */
#define USBH_OpModEn_DisPrt2_Msk        (1ul << USBH_OpModEn_DisPrt2_Pos)/*!<USBH OpModEn: DisPrt2 Mask */

/*@}*/ /* end of group NUC400_USBH */


