coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/*------------- Ethernet MAC Register (EMAC) -----------------------------*/
/** @addtogroup NUC400_EMAC NUC400 Ethernet MAC (EMAC)
  @{
*/
/**
  * @brief EMAC register map
  */
typedef struct {
    __IO uint32_t CAMCMR;                           /*!< Offset: 0x0000   CAM Command register                                   */
    __IO uint32_t CAMEN;                            /*!< Offset: 0x0004   CAM Enable register                                    */
    __IO uint32_t CAM0M;                            /*!< Offset: 0x0008   CAM0 Most Significant Word Register                    */
    __IO uint32_t CAM0L;                            /*!< Offset: 0x000C   CAM0 Least Significant Word Register                   */
    __IO uint32_t CAM1M;                            /*!< Offset: 0x0010   CAM1 Most Significant Word Register                    */
    __IO uint32_t CAM1L;                            /*!< Offset: 0x0014   CAM1 Least Significant Word Register                   */
    __IO uint32_t CAM2M;                            /*!< Offset: 0x0018   CAM2 Most Significant Word Register                    */
    __IO uint32_t CAM2L;                            /*!< Offset: 0x001C   CAM2 Least Significant Word Register                   */
    __IO uint32_t CAM3M;                            /*!< Offset: 0x0020   CAM3 Most Significant Word Register                    */
    __IO uint32_t CAM3L;                            /*!< Offset: 0x0024   CAM3 Least Significant Word Register                   */
    __IO uint32_t CAM4M;                            /*!< Offset: 0x0028   CAM4 Most Significant Word Register                    */
    __IO uint32_t CAM4L;                            /*!< Offset: 0x002C   CAM4 Least Significant Word Register                   */
    __IO uint32_t CAM5M;                            /*!< Offset: 0x0030   CAM5 Most Significant Word Register                    */
    __IO uint32_t CAM5L;                            /*!< Offset: 0x0034   CAM5 Least Significant Word Register                   */
    __IO uint32_t CAM6M;                            /*!< Offset: 0x0038   CAM6 Most Significant Word Register                    */
    __IO uint32_t CAM6L;                            /*!< Offset: 0x003C   CAM6 Least Significant Word Register                   */
    __IO uint32_t CAM7M;                            /*!< Offset: 0x0040   CAM7 Most Significant Word Register                    */
    __IO uint32_t CAM7L;                            /*!< Offset: 0x0044   CAM7 Least Significant Word Register                   */
    __IO uint32_t CAM8M;                            /*!< Offset: 0x0048   CAM8 Most Significant Word Register                    */
    __IO uint32_t CAM8L;                            /*!< Offset: 0x004C   CAM8 Least Significant Word Register                   */
    __IO uint32_t CAM9M;                            /*!< Offset: 0x0050   CAM9 Most Significant Word Register                    */
    __IO uint32_t CAM9L;                            /*!< Offset: 0x0054   CAM9 Least Significant Word Register                   */
    __IO uint32_t CAM10M;                           /*!< Offset: 0x0058   CAM10 Most Significant Word Register                   */
    __IO uint32_t CAM10L;                           /*!< Offset: 0x005C   CAM10 Least Significant Word Register                  */
    __IO uint32_t CAM11M;                           /*!< Offset: 0x0060   CAM11 Most Significant Word Register                   */
    __IO uint32_t CAM11L;                           /*!< Offset: 0x0064   CAM11 Least Significant Word Register                  */
    __IO uint32_t CAM12M;                           /*!< Offset: 0x0068   CAM12 Most Significant Word Register                   */
    __IO uint32_t CAM12L;                           /*!< Offset: 0x006C   CAM12 Least Significant Word Register                  */
    __IO uint32_t CAM13M;                           /*!< Offset: 0x0070   CAM13 Most Significant Word Register                   */
    __IO uint32_t CAM13L;                           /*!< Offset: 0x0074   CAM13 Least Significant Word Register                  */
    __IO uint32_t CAM14M;                           /*!< Offset: 0x0078   CAM14 Most Significant Word Register                   */
    __IO uint32_t CAM14L;                           /*!< Offset: 0x007C   CAM14 Least Significant Word Register                  */
    __IO uint32_t CAM15M;                           /*!< Offset: 0x0080   CAM15 Most Significant Word Register                   */
    __IO uint32_t CAM15L;                           /*!< Offset: 0x0084   CAM15 Least Significant Word Register                  */
    __IO uint32_t TXDLSA;                           /*!< Offset: 0x0088   Transmit Descriptor Link List Start Address Register   */
    __IO uint32_t RXDLSA;                           /*!< Offset: 0x008C   Receive Descriptor Link List Start Address Register    */
    __IO uint32_t MCMDR;                            /*!< Offset: 0x0090   MAC Command Register                                   */
    __IO uint32_t MIID;                             /*!< Offset: 0x0094   MII Management Data Register                           */
    __IO uint32_t MIIDA;                            /*!< Offset: 0x0098   MII Management Control and Address Register            */
    __IO uint32_t FFTCR;                            /*!< Offset: 0x009C   FIFO Threshold Control Register                        */
    __IO uint32_t TSDR;                             /*!< Offset: 0x00A0   Transmit Start Demand Register                         */
    __IO uint32_t RSDR;                             /*!< Offset: 0x00A4   Receive Start Demand Register                          */
    __IO uint32_t DMARFC;                           /*!< Offset: 0x00A8   Maximum Receive Frame Control Register                 */
    __IO uint32_t MIEN;                             /*!< Offset: 0x00AC   MAC Interrupt Enable Register                          */
    __IO uint32_t MISTA;                            /*!< Offset: 0x00B0   MAC Interrupt Status Register                          */
    __IO uint32_t MGSTA;                            /*!< Offset: 0x00B4   MAC General Status Register                            */
    __IO uint32_t MPCNT;                            /*!< Offset: 0x00B8   Missed Packet Count Register                           */
    __I  uint32_t MRPC;                             /*!< Offset: 0x00BC   MAC Receive Pause Count Register                       */
    uint32_t RESERVED0[2];                     /*!< Offset: 0x00C0 ~ 0x00C4   Reserved                                      */
    __IO uint32_t DMARFS;                           /*!< Offset: 0x00C8   DMA Receive Frame Status Register                      */
    __I  uint32_t CTXDSA;                           /*!< Offset: 0x00CC   Current Transmit Descriptor Start Address Register     */
    __I  uint32_t CTXBSA;                           /*!< Offset: 0x00D0   Current Transmit Buffer Start Address Register         */
    __I  uint32_t CRXDSA;                           /*!< Offset: 0x00D4   Current Receive Descriptor Start Address Register      */
    __I  uint32_t CRXBSA;                           /*!< Offset: 0x00D8   Current Receive Buffer Start Address Register          */
    uint32_t RESERVED1[9];                     /*!< Offset: 0x00DC ~ 0x00FC   Reserved                                      */
    __IO uint32_t TSCR;                             /*!< Offset: 0x0100   Time Stamp Control Register                            */
    uint32_t RESERVED2[3];                     /*!< Offset: 0x0104 ~ 0x010C   Reserved                                      */
    __I  uint32_t TSMSR;                            /*!< Offset: 0x0110   Time Stamp Most Significant Register                   */
    __I  uint32_t TSLSR;                            /*!< Offset: 0x0114   Time Stamp Least Significant Register                  */
    __IO uint32_t TSIR;                             /*!< Offset: 0x0118   Time Stamp Increment Register                          */
    __IO uint32_t TSAR;                             /*!< Offset: 0x011C   Time Stamp Addend Register                             */
    __IO uint32_t TSMSUR;                           /*!< Offset: 0x0120   Time Stamp Most Significant Update Register            */
    __IO uint32_t TSLSUR;                           /*!< Offset: 0x0124   Time Stamp Least Significant Update Register           */
    __IO uint32_t TSMSAR;                           /*!< Offset: 0x0128   Time Stamp Most Significant Alarm Register             */
    __IO uint32_t TSLSAR;                           /*!< Offset: 0x012C   Time Stamp Least Significant Alarm Register            */
} EMAC_T;

/* EMAC CAMCMR Bit Field Definitions */
#define EMAC_CAMCMR_ECMP_Pos                4                                       /*!<EMAC CAMCMR: ECMP Position      */
#define EMAC_CAMCMR_ECMP_Msk                (1ul << EMAC_CAMCMR_ECMP_Pos)           /*!<EMAC CAMCMR: ECMP Mask          */
#define EMAC_CAMCMR_CCAM_Pos                3                                       /*!<EMAC CAMCMR: CCAM Position      */
#define EMAC_CAMCMR_CCAM_Msk                (1ul << EMAC_CAMCMR_CCAM_Pos)           /*!<EMAC CAMCMR: CCAM Mask          */
#define EMAC_CAMCMR_ABP_Pos                 2                                       /*!<EMAC CAMCMR: ABP Position       */
#define EMAC_CAMCMR_ABP_Msk                 (1ul << EMAC_CAMCMR_ABP_Pos)            /*!<EMAC CAMCMR: ABP Mask           */
#define EMAC_CAMCMR_AMP_Pos                 1                                       /*!<EMAC CAMCMR: AMP Position       */
#define EMAC_CAMCMR_AMP_Msk                 (1ul << EMAC_CAMCMR_AMP_Pos)            /*!<EMAC CAMCMR: AMP Mask           */
#define EMAC_CAMCMR_AUP_Pos                 0                                       /*!<EMAC CAMCMR: AUP Position       */
#define EMAC_CAMCMR_AUP_Msk                 (1ul << EMAC_CAMCMR_AUP_Pos)            /*!<EMAC CAMCMR: AUP Mask           */

