coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* EMAC CAMEN Bit Field Definitions */
#define EMAC_CAMEN_CAM15EN_Pos              15                                      /*!<EMAC CAMEN: CAM15EN Position    */
#define EMAC_CAMEN_CAM15EN_Msk              (1ul << EMAC_CAMEN_CAM15EN_Pos)         /*!<EMAC CAMEN: CAM15EN Mask        */
#define EMAC_CAMEN_CAM14EN_Pos              14                                      /*!<EMAC CAMEN: CAM14EN Position    */
#define EMAC_CAMEN_CAM14EN_Msk              (1ul << EMAC_CAMEN_CAM14EN_Pos)         /*!<EMAC CAMEN: CAM14EN Mask        */
#define EMAC_CAMEN_CAM13EN_Pos              13                                      /*!<EMAC CAMEN: CAM13EN Position    */
#define EMAC_CAMEN_CAM13EN_Msk              (1ul << EMAC_CAMEN_CAM13EN_Pos)         /*!<EMAC CAMEN: CAM13EN Mask        */
#define EMAC_CAMEN_CAM12EN_Pos              12                                      /*!<EMAC CAMEN: CAM12EN Position    */
#define EMAC_CAMEN_CAM12EN_Msk              (1ul << EMAC_CAMEN_CAM12EN_Pos)         /*!<EMAC CAMEN: CAM12EN Mask        */
#define EMAC_CAMEN_CAM11EN_Pos              11                                      /*!<EMAC CAMEN: CAM11EN Position    */
#define EMAC_CAMEN_CAM11EN_Msk              (1ul << EMAC_CAMEN_CAM11EN_Pos)         /*!<EMAC CAMEN: CAM11EN Mask        */
#define EMAC_CAMEN_CAM10EN_Pos              10                                      /*!<EMAC CAMEN: CAM10EN Position    */
#define EMAC_CAMEN_CAM10EN_Msk              (1ul << EMAC_CAMEN_CAM10EN_Pos)         /*!<EMAC CAMEN: CAM10EN Mask        */
#define EMAC_CAMEN_CAM9EN_Pos               9                                       /*!<EMAC CAMEN: CAM9EN Position     */
#define EMAC_CAMEN_CAM9EN_Msk               (1ul << EMAC_CAMEN_CAM9EN_Pos)          /*!<EMAC CAMEN: CAM9EN Mask         */
#define EMAC_CAMEN_CAM8EN_Pos               8                                       /*!<EMAC CAMEN: CAM8EN Position     */
#define EMAC_CAMEN_CAM8EN_Msk               (1ul << EMAC_CAMEN_CAM8EN_Pos)          /*!<EMAC CAMEN: CAM8EN Mask         */
#define EMAC_CAMEN_CAM7EN_Pos               7                                       /*!<EMAC CAMEN: CAM7EN Position     */
#define EMAC_CAMEN_CAM7EN_Msk               (1ul << EMAC_CAMEN_CAM7EN_Pos)          /*!<EMAC CAMEN: CAM7EN Mask         */
#define EMAC_CAMEN_CAM6EN_Pos               6                                       /*!<EMAC CAMEN: CAM6EN Position     */
#define EMAC_CAMEN_CAM6EN_Msk               (1ul << EMAC_CAMEN_CAM6EN_Pos)          /*!<EMAC CAMEN: CAM6EN Mask         */
#define EMAC_CAMEN_CAM5EN_Pos               5                                       /*!<EMAC CAMEN: CAM5EN Position     */
#define EMAC_CAMEN_CAM5EN_Msk               (1ul << EMAC_CAMEN_CAM5EN_Pos)          /*!<EMAC CAMEN: CAM5EN Mask         */
#define EMAC_CAMEN_CAM4EN_Pos               4                                       /*!<EMAC CAMEN: CAM4EN Position     */
#define EMAC_CAMEN_CAM4EN_Msk               (1ul << EMAC_CAMEN_CAM4EN_Pos)          /*!<EMAC CAMEN: CAM4EN Mask         */
#define EMAC_CAMEN_CAM3EN_Pos               3                                       /*!<EMAC CAMEN: CAM3EN Position     */
#define EMAC_CAMEN_CAM3EN_Msk               (1ul << EMAC_CAMEN_CAM3EN_Pos)          /*!<EMAC CAMEN: CAM3EN Mask         */
#define EMAC_CAMEN_CAM2EN_Pos               2                                       /*!<EMAC CAMEN: CAM2EN Position     */
#define EMAC_CAMEN_CAM2EN_Msk               (1ul << EMAC_CAMEN_CAM2EN_Pos)          /*!<EMAC CAMEN: CAM2EN Mask         */
#define EMAC_CAMEN_CAM1EN_Pos               1                                       /*!<EMAC CAMEN: CAM1EN Position     */
#define EMAC_CAMEN_CAM1EN_Msk               (1ul << EMAC_CAMEN_CAM1EN_Pos)          /*!<EMAC CAMEN: CAM1EN Mask         */
#define EMAC_CAMEN_CAM0EN_Pos               0                                       /*!<EMAC CAMEN: CAM0EN Position     */
#define EMAC_CAMEN_CAM0EN_Msk               (1ul << EMAC_CAMEN_CAM0EN_Pos)          /*!<EMAC CAMEN: CAM0EN Mask         */

/* EMAC CAMxL Bit Field Definitions */
#define EMAC_CAMxL_LSW_Pos                  16                                      /*!<EMAC CAMxL: LSW Position        */
#define EMAC_CAMxL_LSW_Msk                  (0xFFFFul << EMAC_CAMxL_LSW_Pos)        /*!<EMAC CAMxL: LSW Mask            */

/* EMAC CAM15M Bit Field Definitions */
#define EMAC_CAM15M_LEN_TYPE_Pos            16                                      /*!<EMAC CAM15M: LEN_TYPE Position  */
#define EMAC_CAM15M_LEN_TYPE_Msk            (0xFFFFul << EMAC_CAM15M_LEN_TYPE_Pos)  /*!<EMAC CAM15M: LEN_TYPE Mask      */
#define EMAC_CAM15M_OP_CODE_Pos             0                                       /*!<EMAC CAM15M: OP_CODE Position   */
#define EMAC_CAM15M_OP_CODE_Msk             (0xFFFFul << EMAC_CAM15M_OP_CODE_Pos)   /*!<EMAC CAM15M: OP_CODE Mask       */

/* EMAC CAM15L Bit Field Definitions */
#define EMAC_CAM15L_OPERAND_Pos             24                                      /*!<EMAC CAM15L: OPERAND Position   */
#define EMAC_CAM15L_OPERAND_Msk             (0xFFul << EMAC_CAM15L_OPERAND_Pos)     /*!<EMAC CAM15L: OPERAND Mask       */

/* EMAC MCMDR Bit Field Definitions */
#define EMAC_MCMDR_SWR_Pos                  24                                      /*!<EMAC MCMDR: SWR Position        */
#define EMAC_MCMDR_SWR_Msk                  (1ul << EMAC_MCMDR_SWR_Pos)             /*!<EMAC MCMDR: SWR Mask            */
#define EMAC_MCMDR_ENRMII_Pos               22                                      /*!<EMAC MCMDR: ENRMII Position     */
#define EMAC_MCMDR_ENRMII_Msk               (1ul << EMAC_MCMDR_ENRMII_Pos)          /*!<EMAC MCMDR: ENRMII Mask         */
#define EMAC_MCMDR_LBK_Pos                  21                                      /*!<EMAC MCMDR: LBK Position        */
#define EMAC_MCMDR_LBK_Msk                  (1ul << EMAC_MCMDR_LBK_Pos)             /*!<EMAC MCMDR: LBK Mask            */
#define EMAC_MCMDR_OPMOD_Pos                20                                      /*!<EMAC MCMDR: OPMOD Position      */
#define EMAC_MCMDR_OPMOD_Msk                (1ul << EMAC_MCMDR_OPMOD_Pos)           /*!<EMAC MCMDR: OPMOD Mask          */
#define EMAC_MCMDR_ENMDC_Pos                19                                      /*!<EMAC MCMDR: ENMDC Position      */
#define EMAC_MCMDR_ENMDC_Msk                (1ul << EMAC_MCMDR_ENMDC_Pos)           /*!<EMAC MCMDR: ENMDC Mask          */
#define EMAC_MCMDR_FDUP_Pos                 18                                      /*!<EMAC MCMDR: FDUP Position       */
#define EMAC_MCMDR_FDUP_Msk                 (1ul << EMAC_MCMDR_FDUP_Pos)            /*!<EMAC MCMDR: FDUP Mask           */
#define EMAC_MCMDR_ENSQE_Pos                17                                      /*!<EMAC MCMDR: ENSQE Position      */
#define EMAC_MCMDR_ENSQE_Msk                (1ul << EMAC_MCMDR_ENSQE_Pos)           /*!<EMAC MCMDR: ENSQE Mask          */
#define EMAC_MCMDR_SDPZ_Pos                 16                                      /*!<EMAC MCMDR: SDPZ Position       */
#define EMAC_MCMDR_SDPZ_Msk                 (1ul << EMAC_MCMDR_SDPZ_Pos)            /*!<EMAC MCMDR: SDPZ Mask           */
#define EMAC_MCMDR_NDEF_Pos                 9                                       /*!<EMAC MCMDR: NDEF Position       */
#define EMAC_MCMDR_NDEF_Msk                 (1ul << EMAC_MCMDR_NDEF_Pos)            /*!<EMAC MCMDR: NDEF Mask           */
#define EMAC_MCMDR_TXON_Pos                 8                                       /*!<EMAC MCMDR: TXON Position       */
#define EMAC_MCMDR_TXON_Msk                 (1ul << EMAC_MCMDR_TXON_Pos)            /*!<EMAC MCMDR: TXON Mask           */
#define EMAC_MCMDR_MGP_WAKE_Pos             6                                       /*!<EMAC MCMDR: MGP_WAKE Position   */
#define EMAC_MCMDR_MGP_WAKE_Msk             (1ul << EMAC_MCMDR_MGP_WAKE_Pos)        /*!<EMAC MCMDR: MGP_WAKE Mask       */
#define EMAC_MCMDR_SPCRC_Pos                5                                       /*!<EMAC MCMDR: SPCRC Position      */
#define EMAC_MCMDR_SPCRC_Msk                (1ul << EMAC_MCMDR_SPCRC_Pos)           /*!<EMAC MCMDR: SPCRC Mask          */
#define EMAC_MCMDR_AEP_Pos                  4                                       /*!<EMAC MCMDR: AEP Position        */
#define EMAC_MCMDR_AEP_Msk                  (1ul << EMAC_MCMDR_AEP_Pos)             /*!<EMAC MCMDR: AEP Mask            */
#define EMAC_MCMDR_ACP_Pos                  3                                       /*!<EMAC MCMDR: ACP Position        */
#define EMAC_MCMDR_ACP_Msk                  (1ul << EMAC_MCMDR_ACP_Pos)             /*!<EMAC MCMDR: ACP Mask            */
#define EMAC_MCMDR_ARP_Pos                  2                                       /*!<EMAC MCMDR: ARP Position        */
#define EMAC_MCMDR_ARP_Msk                  (1ul << EMAC_MCMDR_ARP_Pos)             /*!<EMAC MCMDR: ARP Mask            */
#define EMAC_MCMDR_ALP_Pos                  1                                       /*!<EMAC MCMDR: ALP Position        */
#define EMAC_MCMDR_ALP_Msk                  (1ul << EMAC_MCMDR_ALP_Pos)             /*!<EMAC MCMDR: ALP Mask            */
#define EMAC_MCMDR_RXON_Pos                 0                                       /*!<EMAC MCMDR: RXON Position       */
#define EMAC_MCMDR_RXON_Msk                 (1ul << EMAC_MCMDR_RXON_Pos)            /*!<EMAC MCMDR: RXON Mask           */

/* EMAC MIID Bit Field Definitions */
#define EMAC_MIID_DATA_Pos                  0                                       /*!<EMAC MIID: DATA Position        */
#define EMAC_MIID_DATA_Msk                  (0xFFFFul << EMAC_MIID_DATA_Pos)        /*!<EMAC MIID: DATA Mask            */

