coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* EMAC MIIDA Bit Field Definitions */
#define EMAC_MIIDA_MDCON_Pos                19                                      /*!<EMAC MIIDA: MDCON Position      */
#define EMAC_MIIDA_MDCON_Msk                (1ul << EMAC_MIIDA_MDCON_Pos)           /*!<EMAC MIIDA: MDCON Mask          */
#define EMAC_MIIDA_PRESP_Pos                18                                      /*!<EMAC MIIDA: PRESP Position      */
#define EMAC_MIIDA_PRESP_Msk                (1ul << EMAC_MIIDA_PRESP_Pos)           /*!<EMAC MIIDA: PRESP Mask          */
#define EMAC_MIIDA_BUSY_Pos                 17                                      /*!<EMAC MIIDA: BUSY Position       */
#define EMAC_MIIDA_BUSY_Msk                 (1ul << EMAC_MIIDA_BUSY_Pos)            /*!<EMAC MIIDA: BUSY Mask           */
#define EMAC_MIIDA_WRITE_Pos                16                                      /*!<EMAC MIIDA: WRITE Position      */
#define EMAC_MIIDA_WRITE_Msk                (1ul << EMAC_MIIDA_WRITE_Pos)           /*!<EMAC MIIDA: WRITE Mask          */
#define EMAC_MIIDA_PHYAD_Pos                8                                       /*!<EMAC MIIDA: PHYAD Position      */
#define EMAC_MIIDA_PHYAD_Msk                (0x1Ful << EMAC_MIIDA_PHYAD_Pos)        /*!<EMAC MIIDA: PHYAD Mask          */
#define EMAC_MIIDA_PHYRAD_Pos               0                                       /*!<EMAC MIIDA: PHYRAD Position     */
#define EMAC_MIIDA_PHYRAD_Msk               (0x1Ful << EMAC_MIIDA_PHYRAD_Pos)       /*!<EMAC MIIDA: PHYRAD Mask         */

/* EMAC FFTCR Bit Field Definitions */
#define EMAC_FFTCR_BLENGH_Pos               20                                      /*!<EMAC FFTCR: BLENGH Position     */
#define EMAC_FFTCR_BLENGH_Msk               (3ul << EMAC_FFTCR_BLENGH_Pos)          /*!<EMAC FFTCR: BLENGH Mask         */
#define EMAC_FFTCR_TXTHD_Pos                8                                       /*!<EMAC FFTCR: TXTHD Position      */
#define EMAC_FFTCR_TXTHD_Msk                (3ul << EMAC_FFTCR_TXTHD_Pos)           /*!<EMAC FFTCR: TXTHD Mask          */
#define EMAC_FFTCR_RXTHD_Pos                0                                       /*!<EMAC FFTCR: RXTHD Position      */
#define EMAC_FFTCR_RXTHD_Msk                (3ul << EMAC_FFTCR_RXTHD_Pos)           /*!<EMAC FFTCR: RXTHD Mask          */

/* EMAC DMARFC Bit Field Definitions */
#define EMAC_DMARFC_RXMS_Pos                0                                       /*!<EMAC DMARFC: RXMS Position      */
#define EMAC_DMARFC_RXMS_Msk                (0xFFFFul << EMAC_DMARFC_RXMS_Pos)      /*!<EMAC DMARFC: RXMS Mask          */

/* EMAC MIEN Bit Field Definitions */
#define EMAC_MIEN_ENTSALS_Pos               28                                      /*!<EMAC MIEN: ENTSALS Position     */
#define EMAC_MIEN_ENTSALS_Msk               (1ul << EMAC_MIEN_ENTSALS_Pos)          /*!<EMAC MIEN: ENTSALS Mask         */
#define EMAC_MIEN_ENTXBERR_Pos              24                                      /*!<EMAC MIEN: ENTXBERR Position    */
#define EMAC_MIEN_ENTXBERR_Msk              (1ul << EMAC_MIEN_ENTXBERR_Pos)         /*!<EMAC MIEN: ENTXBERR Mask        */
#define EMAC_MIEN_ENTDU_Pos                 23                                      /*!<EMAC MIEN: ENTDU Position       */
#define EMAC_MIEN_ENTDU_Msk                 (1ul << EMAC_MIEN_ENTDU_Pos)            /*!<EMAC MIEN: ENTDU Mask           */
#define EMAC_MIEN_ENLC_Pos                  22                                      /*!<EMAC MIEN: ENLC Position        */
#define EMAC_MIEN_ENLC_Msk                  (1ul << EMAC_MIEN_ENLC_Pos)             /*!<EMAC MIEN: ENLC Mask            */
#define EMAC_MIEN_ENTXABT_Pos               21                                      /*!<EMAC MIEN: ENTXABT Position     */
#define EMAC_MIEN_ENTXABT_Msk               (1ul << EMAC_MIEN_ENTXABT_Pos)          /*!<EMAC MIEN: ENTXABT Mask         */
#define EMAC_MIEN_ENNCS_Pos                 20                                      /*!<EMAC MIEN: ENNCS Position       */
#define EMAC_MIEN_ENNCS_Msk                 (1ul << EMAC_MIEN_ENNCS_Pos)            /*!<EMAC MIEN: ENNCS Mask           */
#define EMAC_MIEN_ENEXDEF_Pos               19                                      /*!<EMAC MIEN: ENEXDEF Position     */
#define EMAC_MIEN_ENEXDEF_Msk               (1ul << EMAC_MIEN_ENEXDEF_Pos)          /*!<EMAC MIEN: ENEXDEF Mask         */
#define EMAC_MIEN_ENTXCP_Pos                18                                      /*!<EMAC MIEN: ENTXCP Position      */
#define EMAC_MIEN_ENTXCP_Msk                (1ul << EMAC_MIEN_ENTXCP_Pos)           /*!<EMAC MIEN: ENTXCP Mask          */
#define EMAC_MIEN_ENTXEMP_Pos               17                                      /*!<EMAC MIEN: ENTXEMP Position     */
#define EMAC_MIEN_ENTXEMP_Msk               (1ul << EMAC_MIEN_ENTXEMP_Pos)          /*!<EMAC MIEN: ENTXEMP Mask         */
#define EMAC_MIEN_ENTXINTR_Pos              16                                      /*!<EMAC MIEN: ENTXINTR Position    */
#define EMAC_MIEN_ENTXINTR_Msk              (1ul << EMAC_MIEN_ENTXINTR_Pos)         /*!<EMAC MIEN: ENTXINTR Mask        */
#define EMAC_MIEN_ENMPR_Pos                 15                                      /*!<EMAC MIEN: ENMPR Position       */
#define EMAC_MIEN_ENMPR_Msk                 (1ul << EMAC_MIEN_ENMPR_Pos)            /*!<EMAC MIEN: ENMPR Mask           */
#define EMAC_MIEN_ENCFR_Pos                 14                                      /*!<EMAC MIEN: ENCFR Position       */
#define EMAC_MIEN_ENCFR_Msk                 (1ul << EMAC_MIEN_ENCFR_Pos)            /*!<EMAC MIEN: ENCFR Mask           */
#define EMAC_MIEN_ENRXBERR_Pos              11                                      /*!<EMAC MIEN: ENRXBERR Position    */
#define EMAC_MIEN_ENRXBERR_Msk              (1ul << EMAC_MIEN_ENRXBERR_Pos)         /*!<EMAC MIEN: ENRXBERR Mask        */
#define EMAC_MIEN_ENRDU_Pos                 10                                      /*!<EMAC MIEN: ENRDU Position       */
#define EMAC_MIEN_ENRDU_Msk                 (1ul << EMAC_MIEN_ENRDU_Pos)            /*!<EMAC MIEN: ENRDU Mask           */
#define EMAC_MIEN_ENDEN_Pos                 9                                       /*!<EMAC MIEN: ENDEN Position       */
#define EMAC_MIEN_ENDEN_Msk                 (1ul << EMAC_MIEN_ENDEN_Pos)            /*!<EMAC MIEN: ENDEN Mask           */
#define EMAC_MIEN_ENDFO_Pos                 8                                       /*!<EMAC MIEN: ENDFO Position       */
#define EMAC_MIEN_ENDFO_Msk                 (1ul << EMAC_MIEN_ENDFO_Pos)            /*!<EMAC MIEN: ENDFO Mask           */
#define EMAC_MIEN_ENMMP_Pos                 7                                       /*!<EMAC MIEN: ENMMP Position       */
#define EMAC_MIEN_ENMMP_Msk                 (1ul << EMAC_MIEN_ENMMP_Pos)            /*!<EMAC MIEN: ENMMP Mask           */
#define EMAC_MIEN_ENRP_Pos                  6                                       /*!<EMAC MIEN: ENRP Position        */
#define EMAC_MIEN_ENRP_Msk                  (1ul << EMAC_MIEN_ENRP_Pos)             /*!<EMAC MIEN: ENRP Mask            */
#define EMAC_MIEN_ENALIE_Pos                5                                       /*!<EMAC MIEN: ENALIE Position      */
#define EMAC_MIEN_ENALIE_Msk                (1ul << EMAC_MIEN_ENALIE_Pos)           /*!<EMAC MIEN: ENALIE Mask          */
#define EMAC_MIEN_ENRXGD_Pos                4                                       /*!<EMAC MIEN: ENRXGD Position      */
#define EMAC_MIEN_ENRXGD_Msk                (1ul << EMAC_MIEN_ENRXGD_Pos)           /*!<EMAC MIEN: ENRXGD Mask          */
#define EMAC_MIEN_ENPTLE_Pos                3                                       /*!<EMAC MIEN: ENPTLE Position      */
#define EMAC_MIEN_ENPTLE_Msk                (1ul << EMAC_MIEN_ENPTLE_Pos)           /*!<EMAC MIEN: ENPTLE Mask          */
#define EMAC_MIEN_ENRXOV_Pos                2                                       /*!<EMAC MIEN: ENRXOV Position      */
#define EMAC_MIEN_ENRXOV_Msk                (1ul << EMAC_MIEN_ENRXOV_Pos)           /*!<EMAC MIEN: ENRXOV Mask          */
#define EMAC_MIEN_ENCRCE_Pos                1                                       /*!<EMAC MIEN: ENCRCE Position      */
#define EMAC_MIEN_ENCRCE_Msk                (1ul << EMAC_MIEN_ENCRCE_Pos)           /*!<EMAC MIEN: ENCRCE Mask          */
#define EMAC_MIEN_ENRXINTR_Pos              0                                       /*!<EMAC MIEN: ENRXINTR Position    */
#define EMAC_MIEN_ENRXINTR_Msk              (1ul << EMAC_MIEN_ENRXINTR_Pos)         /*!<EMAC MIEN: ENRXINTR Mask        */

/* EMAC MISTA Bit Field Definitions */
#define EMAC_MISTA_TSALS_Pos                28                                      /*!<EMAC MISTA: TSALS Position      */
#define EMAC_MISTA_TSALS_Msk                (1ul << EMAC_MISTA_TSALS_Pos)           /*!<EMAC MISTA: TSALS Mask          */
#define EMAC_MISTA_TXBERR_Pos               24                                      /*!<EMAC MISTA: TXBERR Position     */
#define EMAC_MISTA_TXBERR_Msk               (1ul << EMAC_MISTA_TXBERR_Pos)          /*!<EMAC MISTA: TXBERR Mask         */
#define EMAC_MISTA_TDU_Pos                  23                                      /*!<EMAC MISTA: TXBERR Position     */
#define EMAC_MISTA_TDU_Msk                  (1ul << EMAC_MISTA_TDU_Pos)             /*!<EMAC MISTA: TXBERR Mask         */
#define EMAC_MISTA_LC_Pos                   22                                      /*!<EMAC MISTA: LC Position         */
#define EMAC_MISTA_LC_Msk                   (1ul << EMAC_MISTA_LC_Pos)              /*!<EMAC MISTA: LC Mask             */
#define EMAC_MISTA_TXABT_Pos                21                                      /*!<EMAC MISTA: TXABT Position      */
#define EMAC_MISTA_TXABT_Msk                (1ul << EMAC_MISTA_TXABT_Pos)           /*!<EMAC MISTA: TXABT Mask          */
#define EMAC_MISTA_NCS_Pos                  20                                      /*!<EMAC MISTA: NCS Position        */
#define EMAC_MISTA_NCS_Msk                  (1ul << EMAC_MISTA_NCS_Pos)             /*!<EMAC MISTA: NCS Mask            */
#define EMAC_MISTA_EXDEF_Pos                19                                      /*!<EMAC MISTA: EXDEF Position      */
#define EMAC_MISTA_EXDEF_Msk                (1ul << EMAC_MISTA_EXDEF_Pos)           /*!<EMAC MISTA: EXDEF Mask          */
#define EMAC_MISTA_TXCP_Pos                 18                                      /*!<EMAC MISTA: TXCP Position       */
#define EMAC_MISTA_TXCP_Msk                 (1ul << EMAC_MISTA_TXCP_Pos)            /*!<EMAC MISTA: TXCP Mask           */
#define EMAC_MISTA_TXEMP_Pos                17                                      /*!<EMAC MISTA: TXEMP Position      */
#define EMAC_MISTA_TXEMP_Msk                (1ul << EMAC_MISTA_TXEMP_Pos)           /*!<EMAC MISTA: TXEMP Mask          */
#define EMAC_MISTA_TXINTR_Pos               16                                      /*!<EMAC MISTA: TXINTR Position     */
#define EMAC_MISTA_TXINTR_Msk               (1ul << EMAC_MISTA_TXINTR_Pos)          /*!<EMAC MISTA: TXINTR Mask         */
#define EMAC_MISTA_MPR_Pos                  15                                      /*!<EMAC MISTA: MPR Position        */
#define EMAC_MISTA_MPR_Msk                  (1ul << EMAC_MISTA_MPR_Pos)             /*!<EMAC MISTA: MPR Mask            */
#define EMAC_MISTA_CFR_Pos                  14                                      /*!<EMAC MISTA: CFR Position        */
#define EMAC_MISTA_CFR_Msk                  (1ul << EMAC_MISTA_CFR_Pos)             /*!<EMAC MISTA: CFR Mask            */
#define EMAC_MISTA_RXBERR_Pos               11                                      /*!<EMAC MISTA: RXBERR Position     */
#define EMAC_MISTA_RXBERR_Msk               (1ul << EMAC_MISTA_RXBERR_Pos)          /*!<EMAC MISTA: RXBERR Mask         */
#define EMAC_MISTA_RDU_Pos                  10                                      /*!<EMAC MISTA: RDU Position        */
#define EMAC_MISTA_RDU_Msk                  (1ul << EMAC_MISTA_RDU_Pos)             /*!<EMAC MISTA: RDU Mask            */
#define EMAC_MISTA_DENI_Pos                 9                                       /*!<EMAC MISTA: DENI Position       */
#define EMAC_MISTA_DENI_Msk                 (1ul << EMAC_MISTA_DENI_Pos)            /*!<EMAC MISTA: DENI Mask           */
#define EMAC_MISTA_DFOI_Pos                 8                                       /*!<EMAC MISTA: DFOI Position       */
#define EMAC_MISTA_DFOI_Msk                 (1ul << EMAC_MISTA_DFOI_Pos)            /*!<EMAC MISTA: DFOI Mask           */
#define EMAC_MISTA_MMP_Pos                  7                                       /*!<EMAC MISTA: MMP Position        */
#define EMAC_MISTA_MMP_Msk                  (1ul << EMAC_MISTA_MMP_Pos)             /*!<EMAC MISTA: MMP Mask            */
#define EMAC_MISTA_RP_Pos                   6                                       /*!<EMAC MISTA: RP Position         */
#define EMAC_MISTA_RP_Msk                   (1ul << EMAC_MISTA_RP_Pos)              /*!<EMAC MISTA: RP Mask             */
#define EMAC_MISTA_ALIE_Pos                 5                                       /*!<EMAC MISTA: ALIE Position       */
#define EMAC_MISTA_ALIE_Msk                 (1ul << EMAC_MISTA_ALIE_Pos)            /*!<EMAC MISTA: ALIE Mask           */
#define EMAC_MISTA_RXGD_Pos                 4                                       /*!<EMAC MISTA: RXGD Position       */
#define EMAC_MISTA_RXGD_Msk                 (1ul << EMAC_MISTA_RXGD_Pos)            /*!<EMAC MISTA: RXGD Mask           */
#define EMAC_MISTA_PTLE_Pos                 3                                       /*!<EMAC MISTA: PTLE Position       */
#define EMAC_MISTA_PTLE_Msk                 (1ul << EMAC_MISTA_PTLE_Pos)            /*!<EMAC MISTA: PTLE Mask           */
#define EMAC_MISTA_RXOV_Pos                 2                                       /*!<EMAC MISTA: RXOV Position       */
#define EMAC_MISTA_RXOV_Msk                 (1ul << EMAC_MISTA_RXOV_Pos)            /*!<EMAC MISTA: RXOV Mask           */
#define EMAC_MISTA_CRCE_Pos                 1                                       /*!<EMAC MISTA: CRCE Position       */
#define EMAC_MISTA_CRCE_Msk                 (1ul << EMAC_MISTA_CRCE_Pos)            /*!<EMAC MISTA: CRCE Mask           */
#define EMAC_MISTA_RXINTR_Pos               0                                       /*!<EMAC MISTA: RXINTR Position     */
#define EMAC_MISTA_RXINTR_Msk               (1ul << EMAC_MISTA_RXINTR_Pos)          /*!<EMAC MISTA: RXINTR Mask         */

