coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* EMAC MGSTA Bit Field Definitions */
#define EMAC_MGSTA_RPAU_Pos                 12                                      /*!<EMAC MGSTA: RPAU Position       */
#define EMAC_MGSTA_RPAU_Msk                 (1ul << EMAC_MGSTA_RPAU_Pos)            /*!<EMAC MGSTA: RPAU Mask           */
#define EMAC_MGSTA_TXHA_Pos                 11                                      /*!<EMAC MGSTA: TXHA Position       */
#define EMAC_MGSTA_TXHA_Msk                 (1ul << EMAC_MGSTA_TXHA_Pos)            /*!<EMAC MGSTA: TXHA Mask           */
#define EMAC_MGSTA_SQE_Pos                  10                                      /*!<EMAC MGSTA: SQE Position        */
#define EMAC_MGSTA_SQE_Msk                  (1ul << EMAC_MGSTA_SQE_Pos)             /*!<EMAC MGSTA: SQE Mask            */
#define EMAC_MGSTA_PAU_Pos                  9                                       /*!<EMAC MGSTA: PAU Position        */
#define EMAC_MGSTA_PAU_Msk                  (1ul << EMAC_MGSTA_PAU_Pos)             /*!<EMAC MGSTA: PAU Mask            */
#define EMAC_MGSTA_DEF_Pos                  8                                       /*!<EMAC MGSTA: DEF Position        */
#define EMAC_MGSTA_DEF_Msk                  (1ul << EMAC_MGSTA_DEF_Pos)             /*!<EMAC MGSTA: DEF Mask            */
#define EMAC_MGSTA_CCNT_Pos                 4                                       /*!<EMAC MGSTA: CCNT Position       */
#define EMAC_MGSTA_CCNT_Msk                 (0xFul << EMAC_MGSTA_CCNT_Pos)          /*!<EMAC MGSTA: CCNT Mask           */
#define EMAC_MGSTA_RFFULL_Pos               2                                       /*!<EMAC MGSTA: RFFULL Position     */
#define EMAC_MGSTA_RFFULL_Msk               (1ul << EMAC_MGSTA_RFFULL_Pos)          /*!<EMAC MGSTA: RFFULL Mask         */
#define EMAC_MGSTA_RXHA_Pos                 1                                       /*!<EMAC MGSTA: RXHA Position       */
#define EMAC_MGSTA_RXHA_Msk                 (1ul << EMAC_MGSTA_RXHA_Pos)            /*!<EMAC MGSTA: RXHA Mask           */
#define EMAC_MGSTA_CFR_Pos                  0                                       /*!<EMAC MGSTA: CFR Position        */
#define EMAC_MGSTA_CFR_Msk                  (1ul << EMAC_MGSTA_CFR_Pos)             /*!<EMAC MGSTA: CFR Mask            */

/* EMAC MPCNT Bit Field Definitions */
#define EMAC_MPCNT_MPC_Pos                  0                                       /*!<EMAC MPCNT: MPC Position        */
#define EMAC_MPCNT_MPC_Msk                  (0xFFFFul << EMAC_MPCNT_MPC_Pos)        /*!<EMAC MPCNT: MPC Mask            */

/* EMAC MRPC Bit Field Definitions */
#define EMAC_MRPC_MRPC_Pos                  0                                       /*!<EMAC MRPC: MRPC Position        */
#define EMAC_MRPC_MRPC_Msk                  (0xFFFFul << EMAC_MRPC_MRPC_Pos)        /*!<EMAC MRPC: MRPC Mask            */

/* EMAC DMARFS Bit Field Definitions */
#define EMAC_DMARFS_RXFLT_Pos               0                                       /*!<EMAC DMARFS: RXFLT Position     */
#define EMAC_DMARFS_RXFLT_Msk               (0xFFFFul << EMAC_DMARFS_RXFLT_Pos)     /*!<EMAC DMARFS: RXFLT Mask */

/* EMAC TSCR Bit Field Definitions */
#define EMAC_TSCR_TSALEN_Pos                5                                       /*!<EMAC TSCR: TSALEN Position      */
#define EMAC_TSCR_TSALEN_Msk                (1ul << EMAC_TSCR_TSALEN_Pos)           /*!<EMAC TSCR: TSALEN Mask          */
#define EMAC_TSCR_TSTUEN_Pos                3                                       /*!<EMAC TSCR: TSTUEN Position      */
#define EMAC_TSCR_TSTUEN_Msk                (1ul << EMAC_TSCR_TSTUEN_Pos)           /*!<EMAC TSCR: TSTUEN Mask          */
#define EMAC_TSCR_TSFUEN_Pos                2                                       /*!<EMAC TSCR: TSFUEN Position      */
#define EMAC_TSCR_TSFUEN_Msk                (1ul << EMAC_TSCR_TSFUEN_Pos)           /*!<EMAC TSCR: TSFUEN Mask          */
#define EMAC_TSCR_TSIEN_Pos                 1                                       /*!<EMAC TSCR: TSIEN Position       */
#define EMAC_TSCR_TSIEN_Msk                 (1ul << EMAC_TSCR_TSIEN_Pos)            /*!<EMAC TSCR: TSIEN Mask           */
#define EMAC_TSCR_TSEN_Pos                  0                                       /*!<EMAC TSCR: TSEN Position        */
#define EMAC_TSCR_TSEN_Msk                  (1ul << EMAC_TSCR_TSEN_Pos)             /*!<EMAC TSCR: TSEN Mask            */

/* EMAC TSIR Bit Field Definitions */
#define EMAC_TSIR_TSCI_Pos                  0                                       /*!<EMAC TSIR: TSCI Position        */
#define EMAC_TSIR_TSCI_Msk                  (0xFF << EMAC_TSIR_TSCI_Pos)            /*!<EMAC TSIR: TSCI Mask            */

/*@}*/ /* end of group NUC400_EMAC */


/*------------- Flash Memory Controller (FMC) -----------------------------*/
/** @addtogroup NUC400_FMC NUC400 Flash Memory Controller Register (FMC)
  @{
*/
typedef struct {
    __IO uint32_t ISPCON;                     /*!< Offset: 0x0000   ISP Control Register                               */
    __IO uint32_t ISPADR;                     /*!< Offset: 0x0004   ISP Address Register                               */
    __IO uint32_t ISPDAT;                     /*!< Offset: 0x0008   ISP Data Register                                  */
    __IO uint32_t ISPCMD;                     /*!< Offset: 0x000C   ISP Command Register                               */
    __IO uint32_t ISPTRG;                     /*!< Offset: 0x0010   ISP Trigger Register                               */
    __I  uint32_t DFBADR;                     /*!< Offset: 0x0014   Data Flash Start Address (CONFIG1)                 */
    __IO uint32_t FATCON;                     /*!< Offset: 0x0018   Flash Access Window Control Register               */
    uint32_t RESERVED0[9];               /*!< Offset: 0x001C ~ 0x003C   Reserved                                  */
    __IO uint32_t ISPSTA;                     /*!< Offset: 0x0040   ISP Status Register                                */
    __IO uint32_t FBWP;                       /*!< Offset: 0x0044   Flash Block Write Protect Control Register         */
    uint32_t RESERVED1[14];              /*!< Offset: 0x0048 ~ 0x007C   Reserved                                  */
    __IO uint32_t ISPDAT0;                    /*!< Offset: 0x0080   ISP Data0 Register                                 */
    __IO uint32_t ISPDAT1;                    /*!< Offset: 0x0084   ISP Data1 Register                                 */
    __IO uint32_t ISPDAT2;                    /*!< Offset: 0x0088   ISP Data2 Register                                 */
    __IO uint32_t ISPDAT3;                    /*!< Offset: 0x008C   ISP Data3 Register                                 */
    uint32_t RESERVED2[12];              /*!< Offset: 0x0090 ~ 0x00BC   Reserved                                  */
    __IO uint32_t ISPPSTA;                    /*!< Offset: 0x00C0   ISP Page Program status                            */
    __IO uint32_t ISPPADR;                    /*!< Offset: 0x00C4   ISP Page Program Address status                    */
} FMC_T;

/********************* Bit definition of ISPCON register **********************/
#define FMC_ISPCON_ISPEN_Pos        0                                /*!<FMC ISPCON: ISPEN Position */
#define FMC_ISPCON_ISPEN_Msk        (1ul << FMC_ISPCON_ISPEN_Pos)    /*!<FMC ISPCON: ISPEN Mask */
#define FMC_ISPCON_BS_Pos           1                                /*!<FMC ISPCON: BS Position */
#define FMC_ISPCON_BS_Msk           (1ul << FMC_ISPCON_BS_Pos)       /*!<FMC ISPCON: BS Mask */
#define FMC_ISPCON_APUEN_Pos        3                                /*!<FMC ISPCON: APUEN Position */
#define FMC_ISPCON_APUEN_Msk        (1ul << FMC_ISPCON_APUEN_Pos)    /*!<FMC ISPCON: APUEN Mask */
#define FMC_ISPCON_CFGUEN_Pos       4                                /*!<FMC ISPCON: CFGUEN Position */
#define FMC_ISPCON_CFGUEN_Msk       (1ul << FMC_ISPCON_CFGUEN_Pos)   /*!<FMC ISPCON: CFGUEN Mask */
#define FMC_ISPCON_LDUEN_Pos        5                                /*!<FMC ISPCON: LDUEN Position */
#define FMC_ISPCON_LDUEN_Msk        (1ul << FMC_ISPCON_LDUEN_Pos)    /*!<FMC ISPCON: LDUEN Mask */
#define FMC_ISPCON_ISPFF_Pos        6                                /*!<FMC ISPCON: ISPFF Position */
#define FMC_ISPCON_ISPFF_Msk        (1ul << FMC_ISPCON_ISPFF_Pos)    /*!<FMC ISPCON: ISPFF Mask */

/********************* Bit definition of ISPCMD register **********************/
#define FMC_ISPCMD_FCTRL_Pos        0                                /*!<FMC ISPCMD: FCTRL Position */
#define FMC_ISPCMD_FCTRL_Msk        (15ul << FMC_ISPCMD_FCTRL_Pos)   /*!<FMC ISPCMD: FCTRL Mask */
#define FMC_ISPCMD_FCEN_Pos         4                                /*!<FMC ISPCMD: FCEN Position */
#define FMC_ISPCMD_FCEN_Msk         (1ul << FMC_ISPCMD_FCEN_Pos)     /*!<FMC ISPCMD: FCEN Mask */
#define FMC_ISPCMD_FOEN_Pos         5                                /*!<FMC ISPCMD: FOEN Position */
#define FMC_ISPCMD_FOEN_Msk         (1ul << FMC_ISPCMD_FOEN_Pos)     /*!<FMC ISPCMD: FOEN Mask */
#define FMC_ISPCMD_D64_Pos          6                                /*!<FMC ISPCMD: D64 Position */
#define FMC_ISPCMD_D64_Msk          (1ul << FMC_ISPCMD_D64_Pos)      /*!<FMC ISPCMD: D64 Mask */

/********************* Bit definition of ISPTRG register **********************/
#define FMC_ISPTRG_ISPGO_Pos        0                                /*!<FMC ISPTRG: ISPGO Position */
#define FMC_ISPTRG_ISPGO_Msk        (1ul << FMC_ISPTRG_ISPGO_Pos)    /*!<FMC ISPTRG: ISPGO Mask */

/********************* Bit definition of FATCON register **********************/
#define FMC_FATCON_FOM_Pos          4                                /*!<FMC FATCON: FOM Position */
#define FMC_FATCON_FOM_Msk          (7ul << FMC_FATCON_FOM_Pos)      /*!<FMC FATCON: FOM Mask */
#define FMC_FATCON_FB_DIS_Pos       7                                /*!<FMC FATCON: FB_DIS Position */
#define FMC_FATCON_FB_DIS_Msk       (1ul << FMC_FATCON_FB_DIS_Pos)   /*!<FMC FATCON: FB_DIS Mask */

/********************* Bit definition of ISPSTA register **********************/
#define FMC_ISPSTA_ISPGO_Pos        0                                /*!<FMC ISPSTA: ISPGO Position */
#define FMC_ISPSTA_ISPGO_Msk        (1ul << FMC_ISPSTA_ISPGO_Pos)    /*!<FMC ISPSTA: ISPGO Mask */
#define FMC_ISPSTA_CBS_Pos          1                                /*!<FMC ISPSTA: CBS Position */
#define FMC_ISPSTA_CBS_Msk          (3ul << FMC_ISPSTA_CBS_Pos)      /*!<FMC ISPSTA: CBS Mask */
#define FMC_ISPSTA_LDWF_Pos         3                                /*!<FMC ISPSTA: LDWF Position */
#define FMC_ISPSTA_LDWF_Msk         (1ul << FMC_ISPSTA_LDWF_Pos)     /*!<FMC ISPSTA: LDWF Mask */
#define FMC_ISPSTA_ISPFF_Pos        6                                /*!<FMC ISPSTA: ISPFF Position */
#define FMC_ISPSTA_ISPFF_Msk        (1ul << FMC_ISPSTA_ISPFF_Pos)    /*!<FMC ISPSTA: ISPFF Mask */
#define FMC_ISPSTA_VECMAP_Pos       9                                /*!<FMC ISPSTA: VECMAP Position */
#define FMC_ISPSTA_VECMAP_Msk       (0xffful << FMC_ISPSTA_VECMAP_Pos) /*!<FMC ISPSTA: VECMAP Mask */
#define FMC_ISPSTA_CFGCRCF_Pos      26                               /*!<FMC ISPSTA: CFGCRCF Position */
#define FMC_ISPSTA_CFGCRCF_Msk      (1ul << FMC_ISPSTA_CFGCRCF_Pos)  /*!<FMC ISPSTA: CFGCRCF Mask */

/********************* Bit definition of ISPPSTA register *********************/
#define FMC_ISPPSTA_ISPGO_Pos        0                               /*!<FMC ISPPSTA: ISPGO Position */
#define FMC_ISPPSTA_ISPGO_Msk        (1ul << FMC_ISPPSTA_ISPGO_Pos)  /*!<FMC ISPPSTA: ISPGO Mask */
#define FMC_ISPPSTA_PPGO_Pos         1                               /*!<FMC ISPPSTA: PPGO Position */
#define FMC_ISPPSTA_PPGO_Msk         (1ul << FMC_ISPPSTA_PPGO_Pos)   /*!<FMC ISPPSTA: PPGO Mask */
#define FMC_ISPPSTA_ISPFF_Pos        2                               /*!<FMC ISPPSTA: ISPFF Position */
#define FMC_ISPPSTA_ISPFF_Msk        (1ul << FMC_ISPPSTA_ISPFF_Pos)  /*!<FMC ISPPSTA: ISPFF Mask */
#define FMC_ISPPSTA_D0_Pos           4                               /*!<FMC ISPPSTA: D0 Position */
#define FMC_ISPPSTA_D0_Msk           (1ul << FMC_ISPPSTA_D0_Pos)     /*!<FMC ISPPSTA: D0 Mask */
#define FMC_ISPPSTA_D1_Pos           5                               /*!<FMC ISPPSTA: D1 Position */
#define FMC_ISPPSTA_D1_Msk           (1ul << FMC_ISPPSTA_D1_Pos)     /*!<FMC ISPPSTA: D1 Mask */
#define FMC_ISPPSTA_D2_Pos           6                               /*!<FMC ISPPSTA: D2 Position */
#define FMC_ISPPSTA_D2_Msk           (1ul << FMC_ISPPSTA_D2_Pos)     /*!<FMC ISPPSTA: D2 Mask */
#define FMC_ISPPSTA_D3_Pos           7                               /*!<FMC ISPPSTA: D3 Position */
#define FMC_ISPPSTA_D3_Msk           (1ul << FMC_ISPPSTA_D3_Pos)     /*!<FMC ISPPSTA: D3 Mask */

/*@}*/ /* end of group NUC400_FMC */

/*------------- SD Control Register (SD) -----------------------------*/
/** @addtogroup NUC400_SD NUC400 SD Control Register
  @{
*/
typedef struct {
    __IO uint32_t FMI_FB_0;                    /*!< Offset: 0x0000   DMAC Shared Buffer (FIFO)                                */
    uint32_t RESERVED0[255];                /*!< Offset: 0x0004 ~ 0x03FC Reserved                                    */
    __IO uint32_t DMACCSR;                    /*!< Offset: 0x0400   DMAC Control and Status Register                    */
    uint32_t RESERVED1;                    /*!< Offset: 0x0404      Reserved                                              */
    __IO uint32_t DMACSAR;                    /*!< Offset: 0x0408   DMAC Transfer Starting Address Registr             */
    __I  uint32_t DMACBCR;                       /*!< Offset: 0x040C   DMAC Byte Count Register                              */
    __IO uint32_t DMACIER;                    /*!< Offset: 0x0410   DMAC Interrupt Enable Register                      */
    __IO uint32_t DMACISR;                    /*!< Offset: 0x0414   DMAC Interrupt Status Register                      */
    uint32_t RESERVED2[250];                 /*!< Offset: 0x0418 ~ 0x07FC Reserved                                    */
    __IO uint32_t FMICR;                        /*!< Offset: 0x0800   FMI Global Control and Status Register              */
    __IO uint32_t FMIIER;                        /*!< Offset: 0x0804   FMI Interrupt Control Register                      */
    __IO uint32_t FMIISR;                        /*!< Offset: 0x0808   FMI Interrupt Status Register                      */
    uint32_t RESERVED3[5];                /*!< Offset: 0x080C ~ 0x081C Reserved                                    */
    __IO uint32_t SDCR;                        /*!< Offset: 0x0820   SD Control and Status Register                      */
    __IO uint32_t SDARG;                        /*!< Offset: 0x0824   SD Control Argument Register                            */
    __IO uint32_t SDIER;                        /*!< Offset: 0x0828   SD Interrupt Control Register                      */
    __IO uint32_t SDISR;                        /*!< Offset: 0x082C   SD Interrupt Status Register                           */
    __I  uint32_t SDRSP0;                       /*!< Offset: 0x0830   SD Receiving Resonse Token Register 0              */
    __I  uint32_t SDRSP1;                       /*!< Offset: 0x0834   SD Receiving Resonse Token Register 0              */
    __IO uint32_t SDBLEN;                        /*!< Offset: 0x0838   SD Block Length Register                               */
    __IO uint32_t SDTMOUT;                       /*!< Offset: 0x083C   SD Response/Data-in Timeout                          */
} SD_T;


/* SD DMACCSR Bit Field Definitions */
#define SD_DMACCSR_DMACEN_Pos         0                                    /*!< SD DMACCSR: DMACEN Position      */
#define SD_DMACCSR_DMACEN_Msk         (1ul << SD_DMACCSR_DMACEN_Pos)     /*!< SD DMACCSR: DMACEN Mask          */

#define SD_DMACCSR_SW_RST_Pos         1                                    /*!< SD DMACCSR: SW_RST Position      */
#define SD_DMACCSR_SW_RST_Msk         (1ul << SD_DMACCSR_SW_RST_Pos)     /*!< SD DMACCSR: SW_RST Mask          */

#define SD_DMACCSR_SG_EN2_Pos         3                                    /*!< SD DMACCSR: SG_EN2 Position      */
#define SD_DMACCSR_SG_EN2_Msk         (1ul << SD_DMACCSR_DMACEN_Pos)     /*!< SD DMACCSR: SG_EN2 Mask          */

