coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SD_DMACCSR_FMI_BUSY_Pos         9                                      /*!< SD DMACCSR: FMI_BUSY Position      */
#define SD_DMACCSR_FMI_BUSY_Msk         (1ul << SD_DMACCSR_FMI_BUSY_Pos)     /*!< SD DMACCSR: FMI_BUSY Mask          */

/* SD DMACSAR Bit Field Definitions */
#define SD_DMACSAR_DMACSA_Pos         0                                    /*!< SD DMACSAR: DMACSA Position      */
#define SD_DMACSAR_DMACSA_Msk         (0xFFFFFFFFul << SD_DMACSAR_DMACSA_Pos)     /*!< SD DMACSAR: DMACSA Mask          */

#define SD_DMACSAR_ORDER_Pos             0                                    /*!< SD DMACSAR: ORDER Position      */
#define SD_DMACSAR_ORDER_Msk             (1ul << SD_DMACSAR_ORDER_Pos)     /*!< SD DMACSAR: ORDER Mask          */

/* SD DMACBCR Bit Field Definitions */
#define SD_DMACBCR_BCNT_Pos             0                                    /*!< SD DMACBCR: BCNT Position      */
#define SD_DMACBCR_BCNT_Msk             (0xFFFFFFul << SD_DMACBCR_BCNT_Pos)     /*!< SD DMACBCR: BCNT Mask          */

/* SD DMACIER Bit Field Definitions */
#define SD_DMACIER_TABORT_IE_Pos             0                                    /*!< SD DMACIER: TABORT_IE Position      */
#define SD_DMACIER_TABORT_IE_Msk             (1ul << SD_DMACIER_TABORT_IE_Pos)     /*!< SD DMACIER: TABORT_IE Mask          */

#define SD_DMACIER_WEOT_IE_Pos             1                                    /*!< SD DMACIER: WEOT_IE Position      */
#define SD_DMACIER_WEOT_IE_Msk             (1ul << SD_DMACIER_WEOT_IE_Pos)     /*!< SD DMACIER: WEOT_IE Mask          */

/* SD DMACISR Bit Field Definitions */
#define SD_DMACISR_TABORT_IF_Pos             0                                    /*!< SD DMACISR: TABORT_IF Position      */
#define SD_DMACISR_TABORT_IF_Msk             (1ul << SD_DMACISR_TABORT_IF_Pos)     /*!< SD DMACISR: TABORT_IF Mask          */

#define SD_DMACISR_WEOT_IF_Pos             1                                    /*!< SD DMACISR: WEOT_IF Position      */
#define SD_DMACISR_WEOT_IF_Msk             (1ul << SD_DMACISR_WEOT_IF_Pos)     /*!< SD DMACISR: WEOT_IF Mask          */

/* SD FMICR Bit Field Definitions */
#define SD_FMICR_SW_RST_Pos             0                                    /*!< SD FMICR: SW_RST Position      */
#define SD_FMICR_SW_RST_Msk             (1ul << SD_FMICR_SW_RST_Pos)     /*!< SD FMICR: SW_RST Mask          */

#define SD_FMICR_SD_EN_Pos             1                                    /*!< SD FMICR: SD_EN Position      */
#define SD_FMICR_SD_EN_Msk             (1ul << SD_FMICR_SD_EN_Pos)     /*!< SD FMICR: SD_EN Mask          */

/* SD FMIIER Bit Field Definitions */
#define SD_FMIIER_DTA_IE_Pos             0                                    /*!< SD FMIIER: DTA_IE Position      */
#define SD_FMIIER_DTA_IE_Msk             (1ul << SD_FMIIER_DTA_IE_Pos)     /*!< SD FMIIER: DTA_IE Mask          */

/* SD FMIISR Bit Field Definitions */
#define SD_FMIISR_DTA_IE_Pos             0                                    /*!< SD FMIISR: DTA_IE Position      */
#define SD_FMIISR_DTA_IE_Msk             (1ul << SD_FMIISR_DTA_IE_Pos)     /*!< SD FMIISR: DTA_IE Mask          */

/* SD SDCR Bit Field Definitions */
#define SD_SDCR_CO_EN_Pos             0                                    /*!< SD SDCR: CO_EN Position      */
#define SD_SDCR_CO_EN_Msk             (1ul << SD_SDCR_CO_EN_Pos)     /*!< SD SDCR: CO_EN Mask          */

#define SD_SDCR_RI_EN_Pos             1                                    /*!< SD SDCR: RI_EN Position      */
#define SD_SDCR_RI_EN_Msk             (1ul << SD_SDCR_RI_EN_Pos)     /*!< SD SDCR: RI_EN Mask          */

#define SD_SDCR_DI_EN_Pos             2                                    /*!< SD SDCR: DI_EN Position      */
#define SD_SDCR_DI_EN_Msk             (1ul << SD_SDCR_DI_EN_Pos)     /*!< SD SDCR: DI_EN Mask          */

#define SD_SDCR_DO_EN_Pos             3                                    /*!< SD SDCR: DO_EN Position      */
#define SD_SDCR_DO_EN_Msk             (1ul << SD_SDCR_DO_EN_Pos)     /*!< SD SDCR: DO_EN Mask          */

#define SD_SDCR_R2_EN_Pos             4                                    /*!< SD SDCR: R2_EN Position      */
#define SD_SDCR_R2_EN_Msk             (1ul << SD_SDCR_R2_EN_Pos)     /*!< SD SDCR: R2_EN Mask          */

#define SD_SDCR_CLK74_OE_Pos             5                                    /*!< SD SDCR: CLK74_OE Position      */
#define SD_SDCR_CLK74_OE_Msk             (1ul << SD_SDCR_CLK74_OE_Pos)     /*!< SD SDCR: CLK74_OE Mask          */

#define SD_SDCR_CLK8_OE_Pos             6                                    /*!< SD SDCR: CLK8_OE Position      */
#define SD_SDCR_CLK8_OE_Msk             (1ul << SD_SDCR_CLK8_OE_Pos)     /*!< SD SDCR: CLK8_OE Mask          */

#define SD_SDCR_CLK_KEEP0_Pos         7                                    /*!< SD SDCR: CLK_KEEP0 Position      */
#define SD_SDCR_CLK_KEEP0_Msk         (1ul << SD_SDCR_CLK_KEEP0_Pos)     /*!< SD SDCR: CLK_KEEP0 Mask          */

#define SD_SDCR_CMD_CODE_Pos             8                                    /*!< SD SDCR: CMD_CODE Position      */
#define SD_SDCR_CMD_CODE_Msk             (0x3Ful << SD_SDCR_CMD_CODE_Pos)     /*!< SD SDCR: CMD_CODE Mask          */

#define SD_SDCR_SW_RST_Pos             14                                    /*!< SD SDCR: SW_RST Position      */
#define SD_SDCR_SW_RST_Msk             (1ul << SD_SDCR_SW_RST_Pos)     /*!< SD SDCR: SW_RST Mask          */

#define SD_SDCR_DBW_Pos                 15                                    /*!< SD SDCR: DBW Position      */
#define SD_SDCR_DBW_Msk                 (1ul << SD_SDCR_DBW_Pos)     /*!< SD SDCR: DBW Mask          */

#define SD_SDCR_BLK_CNT_Pos             16                                    /*!< SD SDCR: BLK_CNT Position      */
#define SD_SDCR_BLK_CNT_Msk             (0xFFul << SD_SDCR_BLK_CNT_Pos)     /*!< SD SDCR: BLK_CNT Mask          */

#define SD_SDCR_SDNWR_Pos             24                                    /*!< SD SDCR: SDNWR Position      */
#define SD_SDCR_SDNWR_Msk             (0xFul << SD_SDCR_SDNWR_Pos)     /*!< SD SDCR: SDNWR Mask          */

