coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SD_SDCR_CLK_KEEP2_Pos         28                                    /*!< SD SDCR: CLK_KEEP2 Position      */
#define SD_SDCR_CLK_KEEP2_Msk         (1ul << SD_SDCR_CLK_KEEP2_Pos)     /*!< SD SDCR: CLK_KEEP2 Mask          */

#define SD_SDCR_SDPORT_Pos             29                                    /*!< SD SDCR: SDPORT Position      */
#define SD_SDCR_SDPORT_Msk             (3ul << SD_SDCR_SDPORT_Pos)     /*!< SD SDCR: SDPORT Mask          */

#define SD_SDCR_CLK_KEEP1_Pos         31                                   /*!< SD SDCR: CLK_KEEP1 Position      */
#define SD_SDCR_CLK_KEEP1_Msk         (1ul << SD_SDCR_CLK_KEEP1_Pos)     /*!< SD SDCR: CLK_KEEP1 Mask          */

/* SD SDARG Bit Field Definitions */
#define SD_SDARG_SD_CMD_ARG_Pos         0                                    /*!< SD SDARG: SD_CMD_ARG Position      */
#define SD_SDARG_SD_CMD_ARG_Msk         (0xFFFFFFFFul << SD_SDARG_SD_CMD_ARG_Pos)     /*!< SD SDARG: SD_CMD_ARG Mask          */

/* SD SDIER Bit Field Definitions */
#define SD_SDIER_BLKD_IE_Pos         0                                    /*!< SD SDIER: BLKD_IE Position      */
#define SD_SDIER_BLKD_IE_Msk         (1ul << SD_SDIER_BLKD_IE_Pos)     /*!< SD SDIER: BLKD_IE Mask          */

#define SD_SDIER_CRC_IE_Pos         1                                    /*!< SD SDIER: CRC_IE Position      */
#define SD_SDIER_CRC_IE_Msk         (1ul << SD_SDIER_CRC_IE_Pos)         /*!< SD SDIER: CRC_IE Mask          */

#define SD_SDIER_CD0_IE_Pos         8                                    /*!< SD SDIER: CD0_IE Position      */
#define SD_SDIER_CD0_IE_Msk         (1ul << SD_SDIER_CD0_IE_Pos)         /*!< SD SDIER: CD0_IE Mask          */

#define SD_SDIER_CD1_IE_Pos         9                                    /*!< SD SDIER: CD1_IE Position      */
#define SD_SDIER_CD1_IE_Msk         (1ul << SD_SDIER_CD1_IE_Pos)         /*!< SD SDIER: CD1_IE Mask          */

#define SD_SDIER_SD0_IE_Pos        10                                    /*!< SD SDIER: SD0_IE Position      */
#define SD_SDIER_SD0_IE_Msk        (1ul << SD_SDIER_SD0_IE_Pos)     /*!< SD SDIER: SD0_IE Mask          */

#define SD_SDIER_SD1_IE_Pos        11                                    /*!< SD SDIER: SD1_IE Position      */
#define SD_SDIER_SD1_IE_Msk        (1ul << SD_SDIER_SD1_IE_Pos)     /*!< SD SDIER: SD1_IE Mask          */

#define SD_SDIER_RITO_IE_Pos        12                                    /*!< SD SDIER: RITO_IE Position      */
#define SD_SDIER_RITO_IE_Msk        (1ul << SD_SDIER_RITO_IE_Pos)     /*!< SD SDIER: RITO_IE Mask          */

#define SD_SDIER_DITO_IE_Pos        13                                    /*!< SD SDIER: DITO_IE Position      */
#define SD_SDIER_DITO_IE_Msk        (1ul << SD_SDIER_DITO_IE_Pos)     /*!< SD SDIER: DITO_IE Mask          */

#define SD_SDIER_WKUP_EN_Pos        14                                    /*!< SD SDIER: WKUP_EN Position      */
#define SD_SDIER_WKUP_EN_Msk        (1ul << SD_SDIER_WKUP_EN_Pos)     /*!< SD SDIER: WKUP_EN Mask          */

#define SD_SDIER_CD0SRC_Pos        30                                    /*!< SD SDIER: CD0SRC Position      */
#define SD_SDIER_CD0SRC_Msk        (1ul << SD_SDIER_CD0SRC_Pos)         /*!< SD SDIER: CD0SRC Mask          */

#define SD_SDIER_CD1SRC_Pos        31                                    /*!< SD SDIER: CD1SRC Position      */
#define SD_SDIER_CD1SRC_Msk        (1ul << SD_SDIER_CD1SRC_Pos)         /*!< SD SDIER: CD1SRC Mask          */

/* SD SDISR Bit Field Definitions */
#define SD_SDISR_BLKD_IF_Pos        0                                    /*!< SD SDISR: BLKD_IF Position      */
#define SD_SDISR_BLKD_IF_Msk        (1ul << SD_SDISR_BLKD_IF_Pos)     /*!< SD SDISR: BLKD_IF Mask          */

#define SD_SDISR_CRC_IF_Pos        1                                    /*!< SD SDISR: CRC_IF Position      */
#define SD_SDISR_CRC_IF_Msk        (1ul << SD_SDISR_CRC_IF_Pos)         /*!< SD SDISR: CRC_IF Mask          */

#define SD_SDISR_CRC_7_Pos        2                                    /*!< SD SDISR: CRC_7 Position      */
#define SD_SDISR_CRC_7_Msk        (1ul << SD_SDISR_CRC_7_Pos)         /*!< SD SDISR: CRC_7 Mask          */

#define SD_SDISR_CRC_16_Pos        3                                    /*!< SD SDISR: CRC_16 Position      */
#define SD_SDISR_CRC_16_Msk        (1ul << SD_SDISR_CRC_16_Pos)         /*!< SD SDISR: CRC_16 Mask          */

#define SD_SDISR_CRCSTAT_Pos        4                                    /*!< SD SDISR: CRCSTAT Position      */
#define SD_SDISR_CRCSTAT_Msk        (7ul << SD_SDISR_CRCSTAT_Pos)     /*!< SD SDISR: CRCSTAT Mask          */

#define SD_SDISR_SDDAT0_Pos        7                                    /*!< SD SDISR: SDDAT0 Position      */
#define SD_SDISR_SDDAT0_Msk        (1ul << SD_SDISR_SDDAT0_Pos)         /*!< SD SDISR: SDDAT0 Mask          */

#define SD_SDISR_CD0_IF_Pos        8                                    /*!< SD SDISR: CD0_IF Position      */
#define SD_SDISR_CD0_IF_Msk        (1ul << SD_SDISR_CD0_IF_Pos)         /*!< SD SDISR: CD0_IF Mask          */

#define SD_SDISR_CD1_IF_Pos        9                                    /*!< SD SDISR: CD1_IF Position      */
#define SD_SDISR_CD1_IF_Msk        (1ul << SD_SDISR_CD1_IF_Pos)         /*!< SD SDISR: CD1_IF Mask          */

#define SD_SDISR_SD0_IF_Pos        10                                    /*!< SD SDISR: SD0_IF Position  */
#define SD_SDISR_SD0_IF_Msk        (1ul << SD_SDISR_SD0_IF_Pos)     /*!< SD SDISR: SD0_IF Mask      */

#define SD_SDISR_SD1_IF_Pos        11                                    /*!< SD SDISR: SD0_IF Position  */
#define SD_SDISR_SD1_IF_Msk        (1ul << SD_SDISR_SD1_IF_Pos)     /*!< SD SDISR: SD1_IF Mask      */

#define SD_SDISR_RITO_IF_Pos        12                                    /*!< SD SDISR: RITO_IF Position      */
#define SD_SDISR_RITO_IF_Msk        (1ul << SD_SDISR_RITO_IF_Pos)     /*!< SD SDISR: RITO_IF Mask          */

#define SD_SDISR_DITO_IF_Pos        13                                    /*!< SD SDISR: DITO_IF Position      */
#define SD_SDISR_DITO_IF_Msk        (1ul << SD_SDISR_DITO_IF_Pos)     /*!< SD SDISR: DITO_IF Mask          */

#define SD_SDISR_CDPS0_Pos        16                                    /*!< SD SDISR: CDPS0 Position      */
#define SD_SDISR_CDPS0_Msk        (1ul << SD_SDISR_CDPS0_Pos)         /*!< SD SDISR: CDPS0 Mask          */

