coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SD_SDISR_CDPS1_Pos        17                                    /*!< SD SDISR: CDPS1 Position      */
#define SD_SDISR_CDPS1_Msk        (1ul << SD_SDISR_CDPS1_Pos)         /*!< SD SDISR: CDPS1 Mask          */

#define SD_SDISR_SDDAT1_Pos        18                                    /*!< SD SDISR: SDDAT1 Position      */
#define SD_SDISR_SDDAT1_Msk        (1ul << SD_SDISR_SDDAT1_Pos)         /*!< SD SDISR: SDDAT1 Mask          */

/* SD SDRSP0 Bit Field Definitions */
#define SD_SDRSP0_SD_RSP_TK0_Pos        0                                                /*!< SD SDRSP0: SD_RSP_TK0 Position      */
#define SD_SDRSP0_SD_RSP_TK0_Msk        (0xFFFFFFFFul << SD_SDRSP0_SD_RSP_TK0_Pos)     /*!< SD SDRSP0: SD_RSP_TK0 Mask          */

/* SD SDRSP1 Bit Field Definitions */
#define SD_SDRSP1_SD_RSP_TK1_Pos        0                                            /*!< SD SDRSP1: SD_RSP_TK1 Position      */
#define SD_SDRSP1_SD_RSP_TK1_Msk        (0xFFul << SD_SDRSP1_SD_RSP_TK1_Pos)     /*!< SD SDRSP1: SD_RSP_TK1 Mask          */

/* SD SDBLEN Bit Field Definitions */
#define SD_SDBLEN_SDBLEN_Pos        0                                        /*!< SD SDBLEN: SDBLEN Position      */
#define SD_SDBLEN_SDBLEN_Msk        (0x7FFul << SD_SDBLEN_SDBLEN_Pos)     /*!< SD SDBLEN: SDBLEN Mask          */

/* SD SDTMOUT Bit Field Definitions */
#define SD_SDTMOUT_SDTMOUT_Pos        0                                            /*!< SD SDTMOUT: SDTMOUT Position      */
#define SD_SDTMOUT_SDTMOUT_Msk        (0xFFFFFFul << SD_SDTMOUT_SDTMOUT_Pos)     /*!< SD SDTMOUT: SDTMOUT Mask          */

/*@}*/ /* end of group NUC400_SD */

/*------------- External Bus Interface Control Register (EBI) -----------------------------*/
/** @addtogroup NUC400_EBI NUC400 External Bus Interface Control Register (EBI)
  @{
*/
typedef struct {
    __IO uint32_t EBICON;                        /*!< Offset: 0x0000  External Bus Interface General Control Register     */
    __IO uint32_t EXTIME0;                        /*!< Offset: 0x0004  External Bus Interface Bank0 Timing Control Register*/
    __IO uint32_t EXTIME1;                        /*!< Offset: 0x0008  External Bus Interface Bank1 Timing Control Register*/
    __IO uint32_t EXTIME2;                        /*!< Offset: 0x000C  External Bus Interface Bank2 Timing Control Register*/
    __IO uint32_t EXTIME3;                        /*!< Offset: 0x0010  External Bus Interface Bank3 Timing Control Register*/
    __IO uint32_t KEY_W0;                        /*!< Offset: 0x0014  External Bus Interface Crypto Key Word 0            */
    __IO uint32_t KEY_W1;                        /*!< Offset: 0x0018  External Bus Interface Crypto Key Word 1            */
    __IO uint32_t KEY_W2;                        /*!< Offset: 0x001C  External Bus Interface Crypto Key Word 2            */
    __IO uint32_t KEY_W3;                        /*!< Offset: 0x0020  External Bus Interface Crypto Key Word 3            */
} EBI_T;


/* EBI_EBICON Bit Field Definitions */
#define EBI_EBICON_EXTCS3_Pos     31                                      /*!< EBI EBICON: Chip 3 Chip Select Active */
#define EBI_EBICON_EXTCS3_Msk     (0x1ul << EBI_EBICON_EXTCS3_Pos)        /*!< EBI EBICON: EXTCS3 Mask */
#define EBI_EBICON_EXTCS2_Pos     30                                      /*!< EBI EBICON: Chip 2 Chip Select Active */
#define EBI_EBICON_EXTCS2_Msk     (0x1ul << EBI_EBICON_EXTCS2_Pos)        /*!< EBI EBICON: EXTCS2 Mask */
#define EBI_EBICON_EXTCS1_Pos     29                                      /*!< EBI EBICON: Chip 1 Chip Select Active */
#define EBI_EBICON_EXTCS1_Msk     (0x1ul << EBI_EBICON_EXTCS1_Pos)        /*!< EBI EBICON: EXTCS1 Mask */
#define EBI_EBICON_EXTCS0_Pos     28                                      /*!< EBI EBICON: Chip 0 Chip Select Active */
#define EBI_EBICON_EXTCS0_Msk     (0x1ul << EBI_EBICON_EXTCS0_Pos)        /*!< EBI EBICON: EXTCS0 Mask */
#define EBI_EBICON_EXTCS_Msk      (0xFul << EBI_EBICON_EXTCS0_Pos)        /*!< EBI EBICON: EXTCS Mask */
#define EBI_EBICON_CRYPT3_Pos     27                                      /*!< EBI EBICON: Chip 3 Encrypt/Decrypt Function Enable Register */
#define EBI_EBICON_CRYPT3_Msk     (0x1ul << EBI_EBICON_CRYPT3_Pos)        /*!< EBI EBICON: CRYPT3 Mask */
#define EBI_EBICON_CRYPT2_Pos     26                                      /*!< EBI EBICON: Chip 2 Encrypt/Decrypt Function Enable Register */
#define EBI_EBICON_CRYPT2_Msk     (0x1ul << EBI_EBICON_CRYPT2_Pos)        /*!< EBI EBICON: CRYPT2 Mask */
#define EBI_EBICON_CRYPT1_Pos     25                                      /*!< EBI EBICON: Chip 1 Encrypt/Decrypt Function Enable Register */
#define EBI_EBICON_CRYPT1_Msk     (0x1ul << EBI_EBICON_CRYPT1_Pos)        /*!< EBI EBICON: CRYPT1 Mask */
#define EBI_EBICON_CRYPT0_Pos     24                                      /*!< EBI EBICON: Chip 0 Encrypt/Decrypt Function Enable Register */
#define EBI_EBICON_CRYPT0_Msk     (0x1ul << EBI_EBICON_CRYPT0_Pos)        /*!< EBI EBICON: CRYPT0 Mask */
#define EBI_EBICON_CRYPT_Msk      (0xFul << EBI_EBICON_CRYPT0_Pos)        /*!< EBI EBICON: CRYPT Mask */
#define EBI_EBICON_MCLKDIV_Pos    8                                       /*!< EBI EBICON: External Output Clock Divider */
#define EBI_EBICON_MCLKDIV_Msk    (0x7ul << EBI_EBICON_MCLKDIV_Pos)       /*!< EBI EBICON: MCLKDIV Mask */

/* EBI_EXTIMEx Bit Field Definitions */
#define EBI_EXTIME_SEPEN_Pos      30                                      /*!< EBI EBICON: EBI Bank Address/Data Bus Separating Enable */
#define EBI_EXTIME_SEPEN_Msk      (0x1ul << EBI_EXTIME_SEPEN_Pos)         /*!< EBI EBICON: SEPEN Mask */
#define EBI_EXTIME_BW16_Pos       29                                      /*!< EBI EBICON: Bank data width */
#define EBI_EXTIME_BW16_Msk       (0x1ul << EBI_EXTIME_BW16_Pos)          /*!< EBI EBICON: BW16 Mask */
#define EBI_EXTIME_EXTEN_Pos      28                                      /*!< EBI EBICON: EBI function Enabled */
#define EBI_EXTIME_EXTEN_Msk      (0x1ul << EBI_EXTIME_EXTEN_Pos)         /*!< EBI EBICON: EXTEN Mask */
#define EBI_EXTIME_IR2R_Pos       24                                      /*!< EBI EBICON: Bank Idle State Cycle Between Read-Read */
#define EBI_EXTIME_IR2R_Msk       (0xFul << EBI_EXTIME_IR2R_Pos)          /*!< EBI EBICON: IR2R Mask */
#define EBI_EXTIME_IR2W_Pos       16                                      /*!< EBI EBICON: Bank Idle State Cycle Between Read-Write */
#define EBI_EXTIME_IR2W_Msk       (0xFul << EBI_EXTIME_IR2W_Pos)          /*!< EBI EBICON: IR2W Mask */
#define EBI_EXTIME_IW2X_Pos       12                                      /*!< EBI EBICON: Bank Idle State Cycle After Write */
#define EBI_EXTIME_IW2X_Msk       (0xFul << EBI_EXTIME_IW2X_Pos)          /*!< EBI EBICON: IW2X Mask */
#define EBI_EXTIME_TAHD_Pos       8                                       /*!< EBI EBICON: Bank Data Access Hold Time */
#define EBI_EXTIME_TAHD_Msk       (0x7ul << EBI_EXTIME_TAHD_Pos)          /*!< EBI EBICON: TAHD Mask */
#define EBI_EXTIME_TACC_Pos       3                                       /*!< EBI EBICON: Bank Data Access Time */
#define EBI_EXTIME_TACC_Msk       (0x1Ful << EBI_EXTIME_TACC_Pos)         /*!< EBI EBICON: TACC Mask */
#define EBI_EXTIME_ETALE_Pos      0                                       /*!< EBI EBICON: Bank Expand Time of ALE */
#define EBI_EXTIME_ETALE_Msk      (0x7ul << EBI_EXTIME_ETALE_Pos)         /*!< EBI EBICON: ETALE Mask */
/*@}*/ /* end of group NUC400_EBI */


/*------------- Watchdog Timer Control Register (WDT) -----------------------------*/
/** @addtogroup NUC400_WDT NUC400 Watchdog Timer Control Register (WDT)
  @{
*/
/**
  * @brief WDT register map
  */
typedef struct {
    __IO uint32_t WTCR;                       /*!< Offset: 0x0000   Watchdog Timer Control Register                    */
    __IO uint32_t WTCRALT;                    /*!< Offset: 0x0004   Watchdog Timer Alternative Control Register        */
    __I  uint32_t RESERVED;                   /*!< Offset: 0x0008   Reserved                                           */
    __IO uint32_t WDTIPVER;                   /*!< Offset: 0x0010   Watchdog Timer IP Version Register                 */
} WDT_T;

