coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
    __IO uint32_t FCR;                        /*!< Offset: 0x0008   RTC Frequency Compensation Register                */

    __IO uint32_t TLR;                        /*!< Offset: 0x000C   Time Loading Register                                */

    __IO uint32_t CLR;                        /*!< Offset: 0x0010   Calendar Loading Register                            */

    __IO uint32_t TSSR;                        /*!< Offset: 0x0014   Time Scale Selection Register                        */

    __IO uint32_t DWR;                       /*!< Offset: 0x0018   Day of the Week Register                              */

    __IO uint32_t TAR;                      /*!< Offset: 0x001C   Time Alarm Register                                */

    __IO uint32_t CAR;                        /*!< Offset: 0x0020   Calendar Alarm Register                            */

    __I  uint32_t LIR;                        /*!< Offset: 0x0024   Leap Year Indicator Register                        */

    __IO uint32_t RIER;                        /*!< Offset: 0x0028   RTC Interrupt Enable Register                        */

    __IO uint32_t RIIR;                        /*!< Offset: 0x002C   RTC Interrupt Indicator Register                    */

    __IO uint32_t TTR;                        /*!< Offset: 0x0030   RTC Time Tick Register                            */

    __I  uint32_t RESERVED0[2];                /*!< Offset: 0x0034 ~ 0x0038   Reserved                                    */

    __IO uint32_t SPRCTL;                    /*!< Offset: 0x003C   RTC Spare Functional Control Register                */

    __IO uint32_t SPR[24];                    /*!< Offset: 0x0040 ~ 0x009C   RTC Spare Register 0 ~ 23                */

    __I  uint32_t RESERVED1[28];            /*!< Offset: 0x00A0 ~ 0x010C   Reserved                                    */

    __IO uint32_t TAMPCTRL;                    /*!< Offset: 0x0110   Tamper Control Register                            */

    __IO uint32_t TAMPSTS ;                    /*!< Offset: 0x0114   Tamper Status  Register                            */

    __I  uint32_t RESERVED2[2];                /*!< Offset: 0x0118 ~ 0x011C   Reserved                                    */

    __IO uint32_t X32KOSCGAIN;                /*!< Offset: 0x0120   Trim value for OSC32K                                */

    __IO uint32_t SDI0_PADCTL;                /*!< Offset: 0x0124   SDI0 Pin I/O Mode Control                            */

    __IO uint32_t SDI1_PADCTL;                /*!< Offset: 0x0128   SDI1 Pin I/O Mode Control                            */

    __IO uint32_t XI32_PADCTL;                /*!< Offset: 0x012C   32K Input Pin I/O Mode Control                    */

    __IO uint32_t XO32_PADCTL;                /*!< Offset: 0x0130   32K Output Pin I/O Mode Control                    */

    __I  uint32_t RESERVED3[3];                /*!< Offset: 0x0134 ~ 0x013C   Reserved                                    */

    __IO uint32_t MTAR;                        /*!< Offset: 0x0140   Time Alarm MASK Register                             */

    __IO uint32_t MCAR;                        /*!< Offset: 0x0144   Calendar Alarm MASK Register                         */
} RTC_T;

/* RTC INIR Bit Field Definitions */
#define RTC_INIR_INIR_Pos       0                                               /*!< RTC INIR: INIR Position */
#define RTC_INIR_INIR_Msk       (0xFFFFFFFFul << RTC_INIR_INIR_Pos)             /*!< RTC INIR: INIR Mask */

#define RTC_INIR_ACTIVE_Pos     0                                               /*!< RTC INIR: ACTIVE Position */
#define RTC_INIR_ACTIVE_Msk     (1ul << RTC_INIR_ACTIVE_Pos)                    /*!< RTC INIR: ACTIVE Mask */

/* RTC AER Bit Field Definitions */
#define RTC_AER_ENF_Pos         16                                              /*!< RTC AER: ENF Position */
#define RTC_AER_ENF_Msk         (1ul << RTC_AER_ENF_Pos)                        /*!< RTC AER: ENF Mask */

#define RTC_AER_AER_Pos         0                                               /*!< RTC AER: AER Position */
#define RTC_AER_AER_Msk         (0xFFFFul << RTC_AER_AER_Pos)                   /*!< RTC AER: AER Mask */

/* RTC FCR Bit Field Definitions */
#define RTC_FCR_INTEGER_Pos     8                                               /*!< RTC FCR: INTEGER Position */
#define RTC_FCR_INTEGER_Msk     (0xFul << RTC_FCR_INTEGER_Pos)                  /*!< RTC FCR: INTEGER Mask */

#define RTC_FCR_FRACTION_Pos    0                                               /*!< RTC FCR: FRACTION Position */
#define RTC_FCR_FRACTION_Msk    (0x3Ful << RTC_FCR_FRACTION_Pos)                /*!< RTC FCR: FRACTION Mask */

/* RTC TLR Bit Field Definitions */
#define RTC_TLR_10HR_Pos        20                                              /*!< RTC TLR: 10HR Position */
#define RTC_TLR_10HR_Msk        (0x3ul << RTC_TLR_10HR_Pos)                     /*!< RTC TLR: 10HR Mask */

#define RTC_TLR_1HR_Pos         16                                              /*!< RTC TLR: 1HR Position */
#define RTC_TLR_1HR_Msk         (0xFul << RTC_TLR_1HR_Pos)                      /*!< RTC TLR: 1HR Mask */

#define RTC_TLR_10MIN_Pos       12                                              /*!< RTC TLR: 10MIN Position */
#define RTC_TLR_10MIN_Msk       (0x7ul << RTC_TLR_10MIN_Pos)                    /*!< RTC TLR: 10MIN Mask */

#define RTC_TLR_1MIN_Pos        8                                               /*!< RTC TLR: 1MIN Position */
#define RTC_TLR_1MIN_Msk        (0xFul << RTC_TLR_1MIN_Pos)                     /*!< RTC TLR: 1MIN Mask */

#define RTC_TLR_10SEC_Pos       4                                               /*!< RTC TLR: 10SEC Position */
#define RTC_TLR_10SEC_Msk       (0x7ul << RTC_TLR_10SEC_Pos)                    /*!< RTC TLR: 10SEC Mask */

#define RTC_TLR_1SEC_Pos        0                                               /*!< RTC TLR: 1SEC Position */
#define RTC_TLR_1SEC_Msk        (0xFul << RTC_TLR_1SEC_Pos)                     /*!< RTC TLR: 1SEC Mask */

/* RTC CLR Bit Field Definitions */
#define RTC_CLR_10YEAR_Pos      20                                              /*!< RTC CLR: 10YEAR Position */
#define RTC_CLR_10YEAR_Msk      (0xFul << RTC_CLR_10YEAR_Pos)                   /*!< RTC CLR: 10YEAR Mask */

#define RTC_CLR_1YEAR_Pos       16                                              /*!< RTC CLR: 1YEAR Position */
#define RTC_CLR_1YEAR_Msk       (0xFul << RTC_CLR_1YEAR_Pos)                    /*!< RTC CLR: 1YEAR Mask */

#define RTC_CLR_10MON_Pos       12                                              /*!< RTC CLR: 10MON Position */
#define RTC_CLR_10MON_Msk       (1ul << RTC_CLR_10MON_Pos)                      /*!< RTC CLR: 10MON Mask */

#define RTC_CLR_1MON_Pos        8                                               /*!< RTC CLR: 1MON Position */
#define RTC_CLR_1MON_Msk        (0xFul << RTC_CLR_1MON_Pos)                     /*!< RTC CLR: 1MON Mask */

#define RTC_CLR_10DAY_Pos       4                                               /*!< RTC CLR: 10DAY Position */
#define RTC_CLR_10DAY_Msk       (0x3ul << RTC_CLR_10DAY_Pos)                    /*!< RTC CLR: 10DAY Mask */

#define RTC_CLR_1DAY_Pos        0                                               /*!< RTC CLR: 1DAY Position */
#define RTC_CLR_1DAY_Msk        (0xFul << RTC_CLR_1DAY_Pos)                     /*!< RTC CLR: 1DAY Mask */

/* RTC TSSR Bit Field Definitions */
#define RTC_TSSR_24H_12H_Pos    0                                               /*!< RTC TSSR: 24H_12H Position */
#define RTC_TSSR_24H_12H_Msk    (1ul << RTC_TSSR_24H_12H_Pos)                   /*!< RTC TSSR: 24H_12H Mask */

