coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* RTC DWR Bit Field Definitions */
#define RTC_DWR_DWR_Pos         0                                               /*!< RTC DWR: DWR Position */
#define RTC_DWR_DWR_Msk         (0x7ul << RTC_DWR_DWR_Pos)                      /*!< RTC DWR: DWR Mask */

/* RTC TAR Bit Field Definitions */
#define RTC_TAR_10HR_Pos        20                                              /*!< RTC TAR: 10HR Position */
#define RTC_TAR_10HR_Msk        (0x3ul << RTC_TAR_10HR_Pos)                     /*!< RTC TAR: 10HR Mask */

#define RTC_TAR_1HR_Pos         16                                              /*!< RTC TAR: 1HR Position */
#define RTC_TAR_1HR_Msk         (0xFul << RTC_TAR_1HR_Pos)                      /*!< RTC TAR: 1HR Mask */

#define RTC_TAR_10MIN_Pos       12                                              /*!< RTC TAR: 10MIN Position */
#define RTC_TAR_10MIN_Msk       (0x7ul << RTC_TAR_10MIN_Pos)                    /*!< RTC TAR: 10MIN Mask */

#define RTC_TAR_1MIN_Pos        8                                               /*!< RTC TAR: 1MIN Position */
#define RTC_TAR_1MIN_Msk        (0xFul << RTC_TAR_1MIN_Pos)                     /*!< RTC TAR: 1MIN Mask */

#define RTC_TAR_10SEC_Pos       4                                               /*!< RTC TAR: 10SEC Position */
#define RTC_TAR_10SEC_Msk       (0x7ul << RTC_TAR_10SEC_Pos)                    /*!< RTC TAR: 10SEC Mask */

#define RTC_TAR_1SEC_Pos        0                                               /*!< RTC TAR: 1SEC Position */
#define RTC_TAR_1SEC_Msk        (0xFul << RTC_TAR_1SEC_Pos)                     /*!< RTC TAR: 1SEC Mask */

/* RTC CAR Bit Field Definitions */
#define RTC_CAR_10YEAR_Pos      20                                              /*!< RTC CAR: 10YEAR Position */
#define RTC_CAR_10YEAR_Msk      (0xFul << RTC_CAR_10YEAR_Pos)                   /*!< RTC CAR: 10YEAR Mask */

#define RTC_CAR_1YEAR_Pos       16                                              /*!< RTC CAR: 1YEAR Position */
#define RTC_CAR_1YEAR_Msk       (0xFul << RTC_CAR_1YEAR_Pos)                    /*!< RTC CAR: 1YEAR Mask */

#define RTC_CAR_10MON_Pos       12                                              /*!< RTC CAR: 10MON Position */
#define RTC_CAR_10MON_Msk       (1ul << RTC_CAR_10MON_Pos)                      /*!< RTC CAR: 10MON Mask */

#define RTC_CAR_1MON_Pos        8                                               /*!< RTC CAR: 1MON Position */
#define RTC_CAR_1MON_Msk        (0xFul << RTC_CAR_1MON_Pos)                     /*!< RTC CAR: 1MON Mask */

#define RTC_CAR_10DAY_Pos       4                                               /*!< RTC CAR: 10DAY Position */
#define RTC_CAR_10DAY_Msk       (0x3ul << RTC_CAR_10DAY_Pos)                    /*!< RTC CAR: 10DAY Mask */

#define RTC_CAR_1DAY_Pos        0                                               /*!< RTC CAR: 1DAY Position */
#define RTC_CAR_1DAY_Msk        (0xFul << RTC_CAR_1DAY_Pos)                     /*!< RTC CAR: 1DAY Mask */

/* RTC LIR Bit Field Definitions */
#define RTC_LIR_LIR_Pos         0                                               /*!< RTC LIR: LIR Position */
#define RTC_LIR_LIR_Msk         (1ul << RTC_LIR_LIR_Pos)                        /*!< RTC LIR: LIR Mask */

/* RTC RIER Bit Field Definitions */
#define RTC_RIER_TIER_Pos       1                                               /*!< RTC RIER: TIER Position */
#define RTC_RIER_TIER_Msk       (1ul << RTC_RIER_TIER_Pos)                      /*!< RTC RIER: TIER Mask */

#define RTC_RIER_AIER_Pos       0                                               /*!< RTC RIER: AIER Position */
#define RTC_RIER_AIER_Msk       (1ul << RTC_RIER_AIER_Pos)                      /*!< RTC RIER: AIER Mask */

/* RTC RIIR Bit Field Definitions */
#define RTC_RIIR_TIF_Pos        1                                               /*!< RTC RIIR: TIF Position */
#define RTC_RIIR_TIF_Msk        (1ul << RTC_RIIR_TIF_Pos)                       /*!< RTC RIIR: TIF Mask */

#define RTC_RIIR_AIF_Pos        0                                               /*!< RTC RIIR: AIF Position */
#define RTC_RIIR_AIF_Msk        (1ul << RTC_RIIR_AIF_Pos)                       /*!< RTC RIIR: AIF Mask */

/* RTC TTR Bit Field Definitions */
#define RTC_TTR_TTR_Pos         0                                               /*!< RTC TTR: TTR Position */
#define RTC_TTR_TTR_Msk         (0x7ul << RTC_TTR_TTR_Pos)                      /*!< RTC TTR: TTR Mask */

/* RTC SPRCTL Bit Field Definitions */
#define RTC_SPRCTL_SPRRDY_Pos   7                                               /*!< RTC SPRCTL: SPRRDY Position */
#define RTC_SPRCTL_SPRRDY_Msk   (1ul << RTC_SPRCTL_SPRRDY_Pos)                  /*!< RTC SPRCTL: SPRRDY Mask */

#define RTC_SPRCTL_SPREN_Pos    2                                               /*!< RTC SPRCTL: SPREN Position */
#define RTC_SPRCTL_SPREN_Msk    (1ul << RTC_SPRCTL_SPREN_Pos)                   /*!< RTC SPRCTL: SPREN Mask */

/* RTC TAMPCTRL Bit Field Definitions */
#define RTC_TAMPCTRL_SDI1LV_Pos     7                                           /*!< RTC TAMPCTRL: SDI1LV Position */
#define RTC_TAMPCTRL_SDI1LV_Msk     (1ul << RTC_TAMPCTRL_SDI1LV_Pos)            /*!< RTC TAMPCTRL: SDI1LV Mask */

#define RTC_TAMPCTRL_SDI0LV_Pos     6                                           /*!< RTC TAMPCTRL: SDI0LV Position */
#define RTC_TAMPCTRL_SDI0LV_Msk     (1ul << RTC_TAMPCTRL_SDI0LV_Pos)            /*!< RTC TAMPCTRL: SDI0LV Mask */

#define RTC_TAMPCTRL_SDIDBEN1_Pos   5                                           /*!< RTC TAMPCTRL: SDIDBEN1 Position */
#define RTC_TAMPCTRL_SDIDBEN1_Msk   (1ul << RTC_TAMPCTRL_SDIDBEN1_Pos)          /*!< RTC TAMPCTRL: SDIDBEN1 Mask */

#define RTC_TAMPCTRL_SDIDBEN0_Pos   4                                           /*!< RTC TAMPCTRL: SDIDBEN0 Position */
#define RTC_TAMPCTRL_SDIDBEN0_Msk   (1ul << RTC_TAMPCTRL_SDIDBEN0_Pos)          /*!< RTC TAMPCTRL: SDIDBEN0 Mask */

#define RTC_TAMPCTRL_SDIEN1_Pos     3                                           /*!< RTC TAMPCTRL: SDIEN1 Position */
#define RTC_TAMPCTRL_SDIEN1_Msk     (1ul << RTC_TAMPCTRL_SDIEN1_Pos)            /*!< RTC TAMPCTRL: SDIEN1 Mask */

