coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define RTC_TAMPCTRL_SDIEN0_Pos     2                                           /*!< RTC TAMPCTRL: SDIEN0 Position */
#define RTC_TAMPCTRL_SDIEN0_Msk     (1ul << RTC_TAMPCTRL_SDIEN0_Pos)            /*!< RTC TAMPCTRL: SDIEN0 Mask */

#define RTC_TAMPCTRL_DESTROYEN_Pos  1                                           /*!< RTC TAMPCTRL: DESTROYEN Position */
#define RTC_TAMPCTRL_DESTROYEN_Msk  (1ul << RTC_TAMPCTRL_DESTROYEN_Pos)         /*!< RTC TAMPCTRL: DESTROYEN Mask */

#define RTC_TAMPCTRL_TIEN_Pos       0                                           /*!< RTC TAMPCTRL: TIEN Position */
#define RTC_TAMPCTRL_TIEN_Msk       (1ul << RTC_TAMPCTRL_TIEN_Pos)              /*!< RTC TAMPCTRL: TIEN Mask */

/* RTC TAMPSTS Bit Field Definitions */
#define RTC_TAMPSTS_SDI1STS_Pos     1                                           /*!< RTC TAMPSTS : SDI1STS Position */
#define RTC_TAMPSTS_SDI1STS_Msk     (1ul << RTC_TAMPSTS_SDI1STS_Pos)            /*!< RTC TAMPSTS : SDI1STS Mask */

#define RTC_TAMPSTS_SDI0STS_Pos     0                                           /*!< RTC TAMPSTS : SDI0STS Position */
#define RTC_TAMPSTS_SDI0STS_Msk     (1ul << RTC_TAMPSTS_SDI0STS_Pos)            /*!< RTC TAMPSTS : SDI0STS Mask */

/* RTC OSC32KGAIN Bit Field Definitions */
#define RTC_OSC32KGAIN_OSC32KGAIN_Pos   0                                           /*!< RTC OSC32KGAIN : OSC32KGAIN Position */
#define RTC_OSC32KGAIN_OSC32KGAIN_Msk   (0xFul << RTC_OSC32KGAIN_OSC32KGAIN_Pos)    /*!< RTC OSC32KGAIN : OSC32KGAIN Mask */

/* RTC SDI0_PADCTL Bit Field Definitions */
#define RTC_SDI0_PADCTL_OFFD_Pos    4                                           /*!< RTC SDI0_PADCTL : OFFD Position */
#define RTC_SDI0_PADCTL_OFFD_Msk    (1ul << RTC_SDI0_PADCTL_OFFD_Pos)           /*!< RTC SDI0_PADCTL : OFFD Mask */

#define RTC_SDI0_PADCTL_TYPE_Pos    3                                           /*!< RTC SDI0_PADCTL : TYPE Position */
#define RTC_SDI0_PADCTL_TYPE_Msk    (1ul << RTC_SDI0_PADCTL_TYPE_Pos)           /*!< RTC SDI0_PADCTL : TYPE Mask */

#define RTC_SDI0_PADCTL_TRI_EN_Pos  2                                           /*!< RTC SDI0_PADCTL : TRI_EN Position */
#define RTC_SDI0_PADCTL_TRI_EN_Msk  (1ul << RTC_SDI0_PADCTL_TRI_EN_Pos)         /*!< RTC SDI0_PADCTL : TRI_EN Mask */

#define RTC_SDI0_PADCTL_DOUT_EN_Pos 1                                           /*!< RTC SDI0_PADCTL : DOUT_EN Position */
#define RTC_SDI0_PADCTL_DOUT_EN_Msk (1ul << RTC_SDI0_PADCTL_DOUT_EN_Pos)        /*!< RTC SDI0_PADCTL : DOUT_EN Mask */

#define RTC_SDI0_PADCTL_DOUT_LV_Pos 0                                           /*!< RTC SDI0_PADCTL : DOUT_LV Position */
#define RTC_SDI0_PADCTL_DOUT_LV_Msk (1ul << RTC_SDI0_PADCTL_DOUT_LV_Pos)        /*!< RTC SDI0_PADCTL : DOUT_LV Mask */

/* RTC SDI1_PADCTL Bit Field Definitions */
#define RTC_SDI1_PADCTL_OFFD_Pos    4                                           /*!< RTC SDI1_PADCTL : OFFD Position */
#define RTC_SDI1_PADCTL_OFFD_Msk    (1ul << RTC_SDI1_PADCTL_OFFD_Pos)           /*!< RTC SDI1_PADCTL : OFFD Mask */

#define RTC_SDI1_PADCTL_TYPE_Pos    3                                           /*!< RTC SDI1_PADCTL : TYPE Position */
#define RTC_SDI1_PADCTL_TYPE_Msk    (1ul << RTC_SDI1_PADCTL_TYPE_Pos)           /*!< RTC SDI1_PADCTL : TYPE Mask */

#define RTC_SDI1_PADCTL_TRI_EN_Pos  2                                           /*!< RTC SDI1_PADCTL : TRI_EN Position */
#define RTC_SDI1_PADCTL_TRI_EN_Msk  (1ul << RTC_SDI1_PADCTL_TRI_EN_Pos)         /*!< RTC SDI1_PADCTL : TRI_EN Mask */

#define RTC_SDI1_PADCTL_DOUT_EN_Pos 1                                           /*!< RTC SDI1_PADCTL : DOUT_EN Position */
#define RTC_SDI1_PADCTL_DOUT_EN_Msk (1ul << RTC_SDI1_PADCTL_DOUT_EN_Pos)        /*!< RTC SDI1_PADCTL : DOUT_EN Mask */

#define RTC_SDI1_PADCTL_DOUT_LV_Pos 0                                           /*!< RTC SDI1_PADCTL : DOUT_LV Position */
#define RTC_SDI1_PADCTL_DOUT_LV_Msk (1ul << RTC_SDI1_PADCTL_DOUT_LV_Pos)        /*!< RTC SDI1_PADCTL : DOUT_LV Mask */

/* RTC XI32_PADCTL Bit Field Definitions */
#define RTC_XI32_PADCTL_OFFD_Pos    4                                           /*!< RTC XI32_PADCTL : OFFD Position */
#define RTC_XI32_PADCTL_OFFD_Msk    (1ul << RTC_XI32_PADCTL_OFFD_Pos)           /*!< RTC XI32_PADCTL : OFFD Mask */

#define RTC_XI32_PADCTL_TYPE_Pos    3                                           /*!< RTC XI32_PADCTL : TYPE Position */
#define RTC_XI32_PADCTL_TYPE_Msk    (1ul << RTC_XI32_PADCTL_TYPE_Pos)           /*!< RTC XI32_PADCTL : TYPE Mask */

#define RTC_XI32_PADCTL_TRI_EN_Pos  2                                           /*!< RTC XI32_PADCTL : TRI_EN Position */
#define RTC_XI32_PADCTL_TRI_EN_Msk  (1ul << RTC_XI32_PADCTL_TRI_EN_Pos)         /*!< RTC XI32_PADCTL : TRI_EN Mask */

#define RTC_XI32_PADCTL_DOUT_EN_Pos 1                                           /*!< RTC XI32_PADCTL : DOUT_EN Position */
#define RTC_XI32_PADCTL_DOUT_EN_Msk (1ul << RTC_XI32_PADCTL_DOUT_EN_Pos)        /*!< RTC XI32_PADCTL : DOUT_EN Mask */

#define RTC_XI32_PADCTL_DOUT_LV_Pos 0                                           /*!< RTC XI32_PADCTL : DOUT_LV Position */
#define RTC_XI32_PADCTL_DOUT_LV_Msk (1ul << RTC_XI32_PADCTL_DOUT_LV_Pos)        /*!< RTC XI32_PADCTL : DOUT_LV Mask */

/* RTC XO32_PADCTL Bit Field Definitions */
#define RTC_XO32_PADCTL_OFFD_Pos    4                                           /*!< RTC XO32_PADCTL : OFFD Position */
#define RTC_XO32_PADCTL_OFFD_Msk    (1ul << RTC_XO32_PADCTL_OFFD_Pos)           /*!< RTC XO32_PADCTL : OFFD Mask */

#define RTC_XO32_PADCTL_TYPE_Pos    3                                           /*!< RTC XO32_PADCTL : TYPE Position */
#define RTC_XO32_PADCTL_TYPE_Msk    (1ul << RTC_XO32_PADCTL_TYPE_Pos)           /*!< RTC XO32_PADCTL : TYPE Mask */

#define RTC_XO32_PADCTL_TRI_EN_Pos  2                                           /*!< RTC XO32_PADCTL : TRI_EN Position */
#define RTC_XO32_PADCTL_TRI_EN_Msk  (1ul << RTC_XO32_PADCTL_TRI_EN_Pos)         /*!< RTC XO32_PADCTL : TRI_EN Mask */

