coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define RTC_XO32_PADCTL_DOUT_EN_Pos 1                                           /*!< RTC XO32_PADCTL : DOUT_EN Position */
#define RTC_XO32_PADCTL_DOUT_EN_Msk (1ul << RTC_XO32_PADCTL_DOUT_EN_Pos)        /*!< RTC XO32_PADCTL : DOUT_EN Mask */

#define RTC_XO32_PADCTL_DOUT_LV_Pos 0                                           /*!< RTC XO32_PADCTL : DOUT_LV Position */
#define RTC_XO32_PADCTL_DOUT_LV_Msk (1ul << RTC_XO32_PADCTL_DOUT_LV_Pos)        /*!< RTC XO32_PADCTL : DOUT_LV Mask */

/* RTC MTAR Bit Field Definitions */
#define RTC_MTAR_M10HR_Pos          5                                           /*!< RTC MTAR : M10HR Position */
#define RTC_MTAR_M10HR_Msk          (1ul << RTC_MTAR_M10HR_Pos)                 /*!< RTC MTAR : M10HR Mask */

#define RTC_MTAR_M1HR_Pos           4                                           /*!< RTC MTAR : M1HR Position */
#define RTC_MTAR_M1HR_Msk           (1ul << RTC_MTAR_M1HR_Pos)                  /*!< RTC MTAR : M1HR Mask */

#define RTC_MTAR_M10MIN_Pos         3                                           /*!< RTC MTAR : M10MIN Position */
#define RTC_MTAR_M10MIN_Msk         (1ul << RTC_MTAR_M10MIN_Pos)                /*!< RTC MTAR : M10MIN Mask */

#define RTC_MTAR_M1MIN_Pos          2                                           /*!< RTC MTAR : M1MIN Position */
#define RTC_MTAR_M1MIN_Msk          (1ul << RTC_MTAR_M1MIN_Pos)                 /*!< RTC MTAR : M1MIN Mask */

#define RTC_MTAR_M10SEC_Pos         1                                           /*!< RTC MTAR : M10SEC Position */
#define RTC_MTAR_M10SEC_Msk         (1ul << RTC_MTAR_M10SEC_Pos)                /*!< RTC MTAR : M10SEC Mask */

#define RTC_MTAR_M1SEC_Pos          0                                           /*!< RTC MTAR : M1SEC Position */
#define RTC_MTAR_M1SEC_Msk          (1ul << RTC_MTAR_M1SEC_Pos)                 /*!< RTC MTAR : M1SEC Mask */


/* RTC MCAR Bit Field Definitions */
#define RTC_MCAR_M10YEAR_Pos        5                                           /*!< RTC MCAR : M10YEAR Position */
#define RTC_MCAR_M10YEAR_Msk        (1ul << RTC_MCAR_M10YEAR_Pos)               /*!< RTC MCAR : M10YEAR Mask */

#define RTC_MCAR_M1YEAR_Pos         4                                           /*!< RTC MCAR : M1YEAR Position */
#define RTC_MCAR_M1YEAR_Msk         (1ul << RTC_MCAR_M1YEAR_Pos)                /*!< RTC MCAR : M1YEAR Mask */

#define RTC_MCAR_M10MON_Pos         3                                           /*!< RTC MCAR : M10MON Position */
#define RTC_MCAR_M10MON_Msk         (1ul << RTC_MCAR_M10MON_Pos)                /*!< RTC MCAR : M10MON Mask */

#define RTC_MCAR_M1MON_Pos          2                                           /*!< RTC MCAR : M1MON Position */
#define RTC_MCAR_M1MON_Msk          (1ul << RTC_MCAR_M1MON_Pos)                 /*!< RTC MCAR : M1MON Mask */

#define RTC_MCAR_M10DAY_Pos         1                                           /*!< RTC MCAR : M10DAY Position */
#define RTC_MCAR_M10DAY_Msk         (1ul << RTC_MCAR_M10DAY_Pos)                /*!< RTC MCAR : M10DAY Mask */

#define RTC_MCAR_M1DAY_Pos          0                                           /*!< RTC MCAR : M1DAY Position */
#define RTC_MCAR_M1DAY_Msk          (1ul << RTC_MCAR_M1DAY_Msk)                 /*!< RTC MCAR : M1DAY Mask */
/*@}*/ /* end of group NUC400_RTC */


/*----------------------------- ADC Controller -------------------------------*/
/** @addtogroup NUC400_ADC NUC400 A/D Converter (ADC)
  @{
*/
typedef struct {
    __I  uint32_t DR0;                        /*!< Offset: 0x0000   ADC Data Register 0 */

    __I  uint32_t DR1;                        /*!< Offset: 0x0004   ADC Data Register 1 */

    __I  uint32_t DR2;                        /*!< Offset: 0x0008   ADC Data Register 2 */

    __I  uint32_t DR3;                        /*!< Offset: 0x000C   ADC Data Register 3 */

    __I  uint32_t DR4;                        /*!< Offset: 0x0010   ADC Data Register 4 */

    __I  uint32_t DR5;                        /*!< Offset: 0x0014   ADC Data Register 5 */

    __I  uint32_t DR6;                        /*!< Offset: 0x0018   ADC Data Register 6 */

    __I  uint32_t DR7;                        /*!< Offset: 0x001C   ADC Data Register 7 */

    __I  uint32_t DR8;                        /*!< Offset: 0x0020   ADC Data Register 8 */

    __I  uint32_t DR9;                        /*!< Offset: 0x0024   ADC Data Register 9 */

    __I  uint32_t DR10;                       /*!< Offset: 0x0028   ADC Data Register 10 */

    __I  uint32_t DR11;                       /*!< Offset: 0x002C   ADC Data Register 11 */

    __I  uint32_t DR12;                       /*!< Offset: 0x0030   ADC Data Register for Internal Temperature Sensor  */

    __I  uint32_t DR13;                       /*!< Offset: 0x0034   ADC Data Register for Internal Band-Gap Voltage    */

    uint32_t RESERVED0[2];               /*!< Offset: 0x0038 ~ 0x003C   Reserved                                  */

    __IO uint32_t CR;                         /*!< Offset: 0x0040   ADC Control Register                               */

    __IO uint32_t CHER;                       /*!< Offset: 0x0044   ADC Channel Enable Register                        */

    __IO uint32_t CMPR0;                      /*!< Offset: 0x0048   ADC Compare Register 0                */

    __IO uint32_t CMPR1;                      /*!< Offset: 0x004C   ADC Compare Register 1                */

    __IO uint32_t SR0;                        /*!< Offset: 0x0050   ADC Status Register                                */

    __IO uint32_t SR1;                        /*!< Offset: 0x0054   ADC Status Register 1                              */

    uint32_t RESERVED1[2];               /*!< Offset: 0x0058 ~ 0x005C   Reserved                                  */

    __I  uint32_t PDMADATA;                   /*!< Offset: 0x0060   ADC PDMA Current Transfer Data                     */
} ADC_T;


/* ADC_DR Bit Field Definitions */
#define ADC_DR_RSLT_Pos           0                               /*!< ADC DR: RSLT Position */
#define ADC_DR_RSLT_Msk           (0xFFFFul << ADC_DR_RSLT_Pos)   /*!< ADC DR: RSLT Mask */
#define ADC_DR_OVERRUN_Pos        16                              /*!< ADC DR: OVERRUN Position */
#define ADC_DR_OVERRUN_Msk        (1ul << ADC_DR_OVERRUN_Pos)     /*!< ADC DR: OVERRUN Mask */
#define ADC_DR_VALID_Pos          17                              /*!< ADC DR: VALID Position */
#define ADC_DR_VALID_Msk          (1ul << ADC_DR_VALID_Pos)       /*!< ADC DR: VALID Mask */

