coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* ADC_CR Bit Field Definitions */
#define ADC_CR_ADC_EN_Pos         0                                 /*!< ADC CR: ADC_EN Position */
#define ADC_CR_ADC_EN_Msk         (1ul << ADC_CR_ADC_EN_Pos)        /*!< ADC CR: ADC_EN Mask */
#define ADC_CR_ADC_IE_Pos         1                                 /*!< ADC CR: ADC_IE Position */
#define ADC_CR_ADC_IE_Msk         (1ul << ADC_CR_ADC_IE_Pos)        /*!< ADC CR: ADC_IE Mask */
#define ADC_CR_ADC_OPMODE_Pos     2                                 /*!< ADC CR: ADC_OPMODE Position */
#define ADC_CR_ADC_OPMODE_Msk     (3ul << ADC_CR_ADC_OPMODE_Pos)    /*!< ADC CR: ADC_OPMODE Mask */
#define ADC_CR_HWTRG_SRC_Pos      4                                 /*!< ADC CR: HWTRG_SRC Position */
#define ADC_CR_HWTRG_SRC_Msk      (3ul << ADC_CR_HWTRG_SRC_Pos)     /*!< ADC CR: HWTRG_SRC Mask */
#define ADC_CR_PINTRG_COND_Pos    6                                 /*!< ADC CR: PINTRG_COND Position */
#define ADC_CR_PINTRG_COND_Msk    (3ul << ADC_CR_PINTRG_COND_Pos)   /*!< ADC CR: PINTRG_COND Mask */
#define ADC_CR_HWTRG_EN_Pos       8                                 /*!< ADC CR: HWTRG_EN Position */
#define ADC_CR_HWTRG_EN_Msk       (1ul << ADC_CR_HWTRG_EN_Pos)      /*!< ADC CR: HWTRG_EN Mask */
#define ADC_CR_PDMA_EN_Pos        9                                 /*!< ADC CR: PDMA_EN Position */
#define ADC_CR_PDMA_EN_Msk        (1ul << ADC_CR_PDMA_EN_Pos)       /*!< ADC CR: PDMA_EN Mask */
#define ADC_CR_DIFFEN_Pos         10                                /*!< ADC CR: DIFFEN Position */
#define ADC_CR_DIFFEN_Msk         (1ul << ADC_CR_DIFFEN_Pos)        /*!< ADC CR: DIFFEN Mask */
#define ADC_CR_ADST_Pos           11                                /*!< ADC CR: ADST Position */
#define ADC_CR_ADST_Msk           (1ul << ADC_CR_ADST_Pos)          /*!< ADC CR: ADST Mask */
#define ADC_CR_REFVSEL_Pos        15                                /*!< ADC CR: REFVSEL Position */
#define ADC_CR_REFVSEL_Msk        (1ul << ADC_CR_REFVSEL_Pos)       /*!< ADC CR: REFVSEL Mask */
#define ADC_CR_PWMTRG_DT_Pos      16                                /*!< ADC CR: PWMTRG_DT Position */
#define ADC_CR_PWMTRG_DT_Msk      (0xFFul << ADC_CR_PWMTRG_DT_Pos)  /*!< ADC CR: PWMTRG_DT Mask */
#define ADC_CR_DMOF_Pos           31                                /*!< ADC CR: DMOF Position */
#define ADC_CR_DMOF_Msk           (1ul << ADC_CR_DMOF_Pos)          /*!< ADC CR: DMOF Mask */

/* ADC_CHER Bit Field Definitions */
#define ADC_CHER_CHEN_Pos         0                                 /*!< ADC CHER: CHEN Position */
#define ADC_CHER_CHEN_Msk         (0xFFFul << ADC_CHER_CHEN_Pos)    /*!< ADC CHER: CHEN Mask */
#define ADC_CHER_ADTS_EN_Pos      16                                /*!< ADC CHER: ADTS_EN Position */
#define ADC_CHER_ADTS_EN_Msk      (1ul << ADC_CHER_ADTS_EN_Pos)     /*!< ADC CHER: ADTS_EN Mask */
#define ADC_CHER_ADBG_EN_Pos      17                                /*!< ADC CHER: ADBG_EN Position */
#define ADC_CHER_ADBG_EN_Msk      (1ul << ADC_CHER_ADBG_EN_Pos)     /*!< ADC CHER: ADBG_EN Mask */

/* ADC_CMPR Bit Field Definitions */
#define ADC_CMPR_CMPEN_Pos        0                                 /*!< ADC CMPR: CMPEN Position */
#define ADC_CMPR_CMPEN_Msk        (1ul << ADC_CMPR_CMPEN_Pos)       /*!< ADC CMPR: CMPEN Mask */
#define ADC_CMPR_CMPIE_Pos        1                                 /*!< ADC CMPR: CMPIE Position */
#define ADC_CMPR_CMPIE_Msk        (1ul << ADC_CMPR_CMPIE_Pos)       /*!< ADC CMPR: CMPIE Mask */
#define ADC_CMPR_CMPIE_Pos        1                                 /*!< ADC CMPR: CMPIE Position */
#define ADC_CMPR_CMPIE_Msk        (1ul << ADC_CMPR_CMPIE_Pos)       /*!< ADC CMPR: CMPIE Mask */
#define ADC_CMPR_CMPCOND_Pos      2                                 /*!< ADC CMPR: CMPCOND Position */
#define ADC_CMPR_CMPCOND_Msk      (1ul << ADC_CMPR_CMPCOND_Pos)     /*!< ADC CMPR: CMPCOND Mask */
#define ADC_CMPR_CMPCH_Pos        3                                 /*!< ADC CMPR: CMPCH Position */
#define ADC_CMPR_CMPCH_Msk        (0xFul << ADC_CMPR_CMPCH_Pos)     /*!< ADC CMPR: CMPCH Mask */
#define ADC_CMPR_CMPMATCNT_Pos    8                                 /*!< ADC CMPR: CMPMATCNT Position */
#define ADC_CMPR_CMPMATCNT_Msk    (0xFul << ADC_CMPR_CMPMATCNT_Pos) /*!< ADC CMPR: CMPMATCNT Mask */
#define ADC_CMPR_CMPD_Pos         16                                /*!< ADC CMPR: CMPD Position */
#define ADC_CMPR_CMPD_Msk         (0xFFFul << ADC_CMPR_CMPD_Pos)    /*!< ADC CMPR: CMPD Mask */

/* ADC_SR0 Bit Field Definitions */
#define ADC_SR0_ADC_IF_Pos        0                                 /*!< ADC SR0: ADC_IF Position */
#define ADC_SR0_ADC_IF_Msk        (1ul << ADC_SR0_ADC_IF_Pos)       /*!< ADC SR0: ADC_IF Mask */
#define ADC_SR0_CMPIF0_Pos        1                                 /*!< ADC SR0: CMPIF0 Position */
#define ADC_SR0_CMPIF0_Msk        (1ul << ADC_SR0_CMPIF0_Pos)       /*!< ADC SR0: CMPIF0 Mask */
#define ADC_SR0_CMPIF1_Pos        2                                 /*!< ADC SR0: CMPIF1 Position */
#define ADC_SR0_CMPIF1_Msk        (1ul << ADC_SR0_CMPIF1_Pos)       /*!< ADC SR0: CMPIF1 Mask */
#define ADC_SR0_BUSY_Pos          3                                 /*!< ADC SR0: BUSY Position */
#define ADC_SR0_BUSY_Msk          (1ul << ADC_SR0_BUSY_Pos)         /*!< ADC SR0: BUSY Mask */
#define ADC_SR0_CHANNEL_Pos       4                                 /*!< ADC SR0: CHANNEL Position */
#define ADC_SR0_CHANNEL_Msk       (0xFul << ADC_SR0_CHANNEL_Pos)    /*!< ADC SR0: CHANNEL Mask */

/* ADC_SR1 Bit Field Definitions */
#define ADC_SR1_VALID_Pos        0                                  /*!< ADC SR1: VALID Position */
#define ADC_SR1_VALID_Msk        (0x3FFFul << ADC_SR1_VALID_Pos)    /*!< ADC SR1: VALID Mask */
#define ADC_SR1_OVERRUN_Pos      16                                 /*!< ADC SR1: OVERRUN Position */
#define ADC_SR1_OVERRUN_Msk      (0x3FFFul << ADC_SR1_OVERRUN_Pos)  /*!< ADC SR1: OVERRUN Mask */

/* ADC_PDMADATA Bit Field Definitions */
#define ADC_PDMADATA_AD_PDMA_Pos   0                                         /*!< ADC PDMADATA: AD_PDMA Position */
#define ADC_PDMADATA_AD_PDMA_Msk   (0x3FFFFul << ADC_PDMADATA_AD_PDMA_Pos)   /*!< ADC PDMADATA: AD_PDMA Mask */

