coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/*@}*/ /* end of group NUC400_ADC */


/*------------------------- Analog Comparator (ACMP) --------------------------*/
/** @addtogroup NUC400_ACMP NUC400 Analog Comparator (ACMP)
  @{
*/
typedef struct {
    __IO uint32_t CR0;                      /*!< Offset: 0x0000   Analog Comparator Control Register 0    */
    __IO uint32_t CR1;                      /*!< Offset: 0x0004   Analog Comparator Control Register 1    */
    __IO uint32_t CR2;                      /*!< Offset: 0x0008   Analog Comparator Control Register 2    */
    __IO uint32_t SR;                       /*!< Offset: 0x000C   Analog Comparator Status Register       */
    __IO uint32_t RVCR;                     /*!< Offset: 0x0010   Analog Comparator Reference Voltage Control Register */
} ACMP_T;


/* ACMP_CR Bit Field Definitions */
#define ACMP_CR_ACMPEN_Pos        0                             /*!< ACMP CR: ACMPEN Position */
#define ACMP_CR_ACMPEN_Msk        (1ul << ACMP_CR_ACMPEN_Pos)   /*!< ACMP CR: ACMPEN Mask */
#define ACMP_CR_ACMPIE_Pos        1                             /*!< ACMP CR: ACMPIE Position */
#define ACMP_CR_ACMPIE_Msk        (1ul << ACMP_CR_ACMPIE_Pos)   /*!< ACMP CR: ACMPIE Mask */
#define ACMP_CR_HYSEN_Pos         2                             /*!< ACMP CR: HYSEN Position */
#define ACMP_CR_HYSEN_Msk         (1ul << ACMP_CR_HYSEN_Pos)    /*!< ACMP CR: HYSEN Mask */
#define ACMP_CR_ACMPOINV_Pos      3                             /*!< ACMP CR: ACMPOINV Position */
#define ACMP_CR_ACMPOINV_Msk      (1ul << ACMP_CR_ACMPOINV_Pos) /*!< ACMP CR: ACMPOINV Mask */
#define ACMP_CR_NEGSEL_Pos        4                             /*!< ACMP CR: NEGSEL Position */
#define ACMP_CR_NEGSEL_Msk        (1ul << ACMP_CR_NEGSEL_Pos)   /*!< ACMP CR: NEGSEL Mask */
#define ACMP_CR_POSSEL_Pos        5                             /*!< ACMP CR: POSSEL Position */
#define ACMP_CR_POSSEL_Msk        (7ul << ACMP_CR_POSSEL_Pos)   /*!< ACMP CR: POSSEL Mask */

/* ACMP_SR Bit Field Definitions */
#define ACMP_SR_ACMPF0_Pos        0                             /*!< ACMP SR: ACMPF0 Position */
#define ACMP_SR_ACMPF0_Msk        (1ul << ACMP_SR_ACMPF0_Pos)   /*!< ACMP SR: ACMPF0 Mask */
#define ACMP_SR_ACMPF1_Pos        1                             /*!< ACMP SR: ACMPF1 Position */
#define ACMP_SR_ACMPF1_Msk        (1ul << ACMP_SR_ACMPF1_Pos)   /*!< ACMP SR: ACMPF1 Mask */
#define ACMP_SR_ACMPF2_Pos        2                             /*!< ACMP SR: ACMPF2 Position */
#define ACMP_SR_ACMPF2_Msk        (1ul << ACMP_SR_ACMPF2_Pos)   /*!< ACMP SR: ACMPF2 Mask */
#define ACMP_SR_ACMPO0_Pos        3                             /*!< ACMP SR: ACMPO0 Position */
#define ACMP_SR_ACMPO0_Msk        (1ul << ACMP_SR_ACMPO0_Pos)   /*!< ACMP SR: ACMPO0 Mask */
#define ACMP_SR_ACMPO1_Pos        4                             /*!< ACMP SR: ACMPO1 Position */
#define ACMP_SR_ACMPO1_Msk        (1ul << ACMP_SR_ACMPO1_Pos)   /*!< ACMP SR: ACMPO1 Mask */
#define ACMP_SR_ACMPO2_Pos        5                             /*!< ACMP SR: ACMPO2 Position */
#define ACMP_SR_ACMPO2_Msk        (1ul << ACMP_SR_ACMPO2_Pos)   /*!< ACMP SR: ACMPO2 Mask */

/* ACMP_RVCR Bit Field Definitions */
#define ACMP_RVCR_CRVS_Pos        0                                 /*!< ACMP RVCRR: CRVS Position */
#define ACMP_RVCR_CRVS_Msk        (0xFul << ACMP_RVCR_CRVS_Pos)     /*!< ACMP RVCRR: CRVS Mask */
#define ACMP_RVCR_CRVSRC_SEL_Pos  6                                 /*!< ACMP RVCRR: CRVSRC_SEL Position */
#define ACMP_RVCR_CRVSRC_SEL_Msk  (1ul << ACMP_RVCR_CRVSRC_SEL_Pos) /*!< ACMP RVCRR: CRVSRC_SEL Mask */
#define ACMP_RVCR_INTREF_SEL_Pos  7                                 /*!< ACMP RVCRR: INTREF_SEL Position */
#define ACMP_RVCR_INTREF_SEL_Msk  (1ul << ACMP_RVCR_INTREF_SEL_Pos) /*!< ACMP RVCRR: INTREF_SEL Mask */

/*@}*/ /* end of group NUC400_ACMP */

/*------------- I2S Control Register (I2S) -----------------------------*/
/** @addtogroup NUC400_I2S NUC400 I2S Control Register (I2S)
  @{
*/
typedef struct {
    __IO uint32_t CON;                        /*!< Offset: 0x0000   I2S Control Register                                */
    __IO uint32_t CLKDIV;                        /*!< Offset: 0x0004   I2S Clock Divider Control Register                  */
    __IO uint32_t IE;                            /*!< Offset: 0x0008   I2S Interrupt Enable Register                      */
    __IO uint32_t STATUS;                        /*!< Offset: 0x000C   I2S Status Register                                  */
    __O  uint32_t TXFIFO;                        /*!< Offset: 0x0010   I2S Transmit FIFO    Register                         */
    __I  uint32_t RXFIFO;                        /*!< Offset: 0x0014   I2S Receive FIFO Register                             */
} I2S_T;


/* I2S_CON Bit Field Definitions */
#define I2S_CON_I2SEN_Pos             0                                       /*!< I2S_CON: I2S enable */
#define I2S_CON_I2SEN_Msk             (0x1ul << I2S_CON_I2SEN_Pos)            /*!< I2S_CON: I2SEN Mask */
#define I2S_CON_TXEN_Pos             1                                       /*!< I2S_CON: Data transmit enable */
#define I2S_CON_TXEN_Msk             (0x1ul << I2S_CON_TXEN_Pos)                /*!< I2S_CON: TXEN Mask */
#define I2S_CON_RXEN_Pos             2                                       /*!< I2S_CON: Data receive enable */
#define I2S_CON_RXEN_Msk             (0x1ul << I2S_CON_RXEN_Pos)                /*!< I2S_CON: RXEN Mask */
#define I2S_CON_MUTE_Pos             3                                       /*!< I2S_CON: Transmit mute enable */
#define I2S_CON_MUTE_Msk             (0x1ul << I2S_CON_MUTE_Pos)                /*!< I2S_CON: MUTE Mask */
#define I2S_CON_WORDWIDTH_Pos         4                                       /*!< I2S_CON: Word length */
#define I2S_CON_WORDWIDTH_Msk         (0x3ul << I2S_CON_WORDWIDTH_Pos)        /*!< I2S_CON: WORDWIDTH Mask */
#define I2S_CON_MONO_Pos             6                                       /*!< I2S_CON: Stereo or mono format select */
#define I2S_CON_MONO_Msk             (0x1ul << I2S_CON_MONO_Pos)                /*!< I2S_CON: MONO Mask */
#define I2S_CON_FORMAT_Pos             7                                       /*!< I2S_CON: I2S or MSB-justified format select */
#define I2S_CON_FORMAT_Msk             (0x1ul << I2S_CON_FORMAT_Pos)            /*!< I2S_CON: FORMAT Mask */
#define I2S_CON_SLAVE_Pos             8                                       /*!< I2S_CON: Slave or master mode */
#define I2S_CON_SLAVE_Msk             (0x1ul << I2S_CON_SLAVE_Pos)            /*!< I2S_CON: SLAVE Mask */
#define I2S_CON_TXTH_Pos             9                                       /*!< I2S_CON: Transmit FIFO threshold level */
#define I2S_CON_TXTH_Msk             (0x7ul << I2S_CON_TXTH_Pos)                /*!< I2S_CON: TXTH Mask */
#define I2S_CON_RXTH_Pos             12                                      /*!< I2S_CON: Receive FIFO threshold level */
#define I2S_CON_RXTH_Msk             (0x7ul << I2S_CON_RXTH_Pos)                /*!< I2S_CON: RXTH Mask */
#define I2S_CON_MCLKEN_Pos             15                                      /*!< I2S_CON: Master clock enable */
#define I2S_CON_MCLKEN_Msk             (0x1ul << I2S_CON_MCLKEN_Pos)            /*!< I2S_CON: MCLKEN Mask */
#define I2S_CON_RCHZCEN_Pos         16                                      /*!< I2S_CON: Right channel zero-cross detection enable */
#define I2S_CON_RCHZCEN_Msk         (0x1ul << I2S_CON_RCHZCEN_Pos)            /*!< I2S_CON: RCHZCEN Mask */
#define I2S_CON_LCHZCEN_Pos         17                                      /*!< I2S_CON: Left channel zero-cross detect enable */
#define I2S_CON_LCHZCEN_Msk         (0x1ul << I2S_CON_LCHZCEN_Pos)            /*!< I2S_CON: LCHZCEN Mask */
#define I2S_CON_CLR_TXFIFO_Pos         18                                      /*!< I2S_CON: Clear transmit FIFO */
#define I2S_CON_CLR_TXFIFO_Msk         (0x1ul << I2S_CON_CLR_TXFIFO_Pos)       /*!< I2S_CON: CLR_TXFIFO Mask */
#define I2S_CON_CLR_RXFIFO_Pos         19                                      /*!< I2S_CON: Clear receive FIFO */
#define I2S_CON_CLR_RXFIFO_Msk         (0x1ul << I2S_CON_CLR_RXFIFO_Pos)       /*!< I2S_CON: CLR_RXFIFO Mask */
#define I2S_CON_TXDMA_Pos             20                                      /*!< I2S_CON: Enable transmit DMA */
#define I2S_CON_TXDMA_Msk             (0x1ul << I2S_CON_TXDMA_Pos)               /*!< I2S_CON: TXDMA Mask */
#define I2S_CON_RXDMA_Pos             21                                      /*!< I2S_CON: Enable receive DMA */
#define I2S_CON_RXDMA_Msk             (0x1ul << I2S_CON_RXDMA_Pos)               /*!< I2S_CON: RXDMA Mask */
#define I2S_CON_RXLCH_Pos             23                                      /*!< I2S_CON: Receive left channel enable */
#define I2S_CON_RXLCH_Msk             (0x1ul << I2S_CON_RXLCH_Pos)               /*!< I2S_CON: RXLCH Mask */
#define I2S_CON_PCM_Pos             24                                      /*!< I2S_CON: PCM interface enable */
#define I2S_CON_PCM_Msk             (0x1ul << I2S_CON_PCM_Pos)               /*!< I2S_CON: PCM Mask */

/* I2S_CLKDIV Bit Field Definitions */
#define I2S_CLKDIV_MCLK_DIV_Pos        0                                       /*!< I2S_CLKDIV: Master clock divider */
#define I2S_CLKDIV_MCLK_DIV_Msk        (0x3Ful << I2S_CLKDIV_MCLK_DIV_Pos)        /*!< I2S_CLKDIV: MCLK_DIV Mask */
#define I2S_CLKDIV_BCLK_DIV_Pos        8                                       /*!< I2S_CLKDIV: Bit clock divider */
#define I2S_CLKDIV_BCLK_DIV_Msk        (0x1FFul << I2S_CLKDIV_BCLK_DIV_Pos)       /*!< I2S_CLKDIV: BCLK_DIV Mask */

