coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* I2S_IE Bit Field Definitions */
#define I2S_IE_RXUDFIE_Pos            0                                       /*!< I2S_IE: Receive FIFO underflow interrupt enable */
#define I2S_IE_RXUDFIE_Msk            (0x1ul << I2S_IE_RXUDFIE_Pos)            /*!< I2S_IE: RXUDFIE Mask */
#define I2S_IE_RXOVFIE_Pos            1                                       /*!< I2S_IE: Receive FIFO overflow interrupt enable */
#define I2S_IE_RXOVFIE_Msk            (0x1ul << I2S_IE_RXOVFIE_Pos)           /*!< I2S_IE: RXOVFIE Mask */
#define I2S_IE_RXTHIE_Pos            2                                       /*!< I2S_IE: Receive FIFO underflow interrupt enable */
#define I2S_IE_RXTHIE_Msk            (0x1ul << I2S_IE_RXTHIE_Pos)            /*!< I2S_IE: RXTHIE Mask */
#define I2S_IE_TXUDFIE_Pos            8                                       /*!< I2S_IE: Transmit FIFO underflow interrupt enable */
#define I2S_IE_TXUDFIE_Msk            (0x1ul << I2S_IE_TXUDFIE_Pos)           /*!< I2S_IE: TXUDFIE Mask */
#define I2S_IE_TXOVFIE_Pos            9                                       /*!< I2S_IE: Transmit FIFO overflow interrupt enable */
#define I2S_IE_TXOVFIE_Msk            (0x1ul << I2S_IE_TXOVFIE_Pos)           /*!< I2S_IE: TXOVFIE_ Mask */
#define I2S_IE_TXTHIE_Pos            10                                      /*!< I2S_IE: Transmit FIFO threshold level interrupt enable */
#define I2S_IE_TXTHIE_Msk            (0x1ul << I2S_IE_TXTHIE_Pos)            /*!< I2S_IE: TXTHIE Mask */
#define I2S_IE_RZCIE_Pos            11                                      /*!< I2S_IE: Right channel zero-cross interrupt enable */
#define I2S_IE_RZCIE_Msk            (0x1ul << I2S_IE_RZCIE_Pos)               /*!< I2S_IE: RZCIE Mask */
#define I2S_IE_LZCIE_Pos            12                                      /*!< I2S_IE: Left channel zero-cross interrupt enable */
#define I2S_IE_LZCIE_Msk            (0x1ul << I2S_IE_LZCIE_Pos)               /*!< I2S_IE: LZCIE Mask */

/* I2S_STATUS Bit Field Definitions */
#define I2S_STATUS_I2SINT_Pos        0                                       /*!< I2S_STATUS: I2S interrupt flag */
#define I2S_STATUS_I2SINT_Msk        (0x1ul << I2S_STATUS_I2SINT_Pos)        /*!< I2S_STATUS: I2SINT Mask */
#define I2S_STATUS_I2SRXINT_Pos        1                                       /*!< I2S_STATUS: Receive interrupt flag */
#define I2S_STATUS_I2SRXINT_Msk        (0x1ul << I2S_STATUS_I2SRXINT_Pos)        /*!< I2S_STATUS: I2SRXINT Mask */
#define I2S_STATUS_I2STXINT_Pos        2                                       /*!< I2S_STATUS: Transmit interrupt flag */
#define I2S_STATUS_I2STXINT_Msk        (0x1ul << I2S_STATUS_I2STXINT_Pos)        /*!< I2S_STATUS: I2STXINT Mask */
#define I2S_STATUS_RIGHT_Pos        3                                       /*!< I2S_STATUS: Right or left channel select */
#define I2S_STATUS_RIGHT_Msk        (0x1ul << I2S_STATUS_RIGHT_Pos)            /*!< I2S_STATUS: RIGHT Mask */
#define I2S_STATUS_RXUDF_Pos        8                                       /*!< I2S_STATUS: Receive FIFO underflow flag */
#define I2S_STATUS_RXUDF_Msk        (0x1ul << I2S_STATUS_RXUDF_Pos)            /*!< I2S_STATUS: RXUDF Mask */
#define I2S_STATUS_RXOVF_Pos        9                                       /*!< I2S_STATUS: Receive FIFO overflow flag */
#define I2S_STATUS_RXOVF_Msk        (0x1ul << I2S_STATUS_RXOVF_Pos)            /*!< I2S_STATUS: RXOVF Mask */
#define I2S_STATUS_RXTHF_Pos        10                                      /*!< I2S_STATUS: Receive FIFO threshold flag */
#define I2S_STATUS_RXTHF_Msk        (0x1ul << I2S_STATUS_RXTHF_Pos)            /*!< I2S_STATUS: RXTHF Mask */
#define I2S_STATUS_RXFULL_Pos        11                                      /*!< I2S_STATUS: Receive FIFO full flag */
#define I2S_STATUS_RXFULL_Msk        (0x1ul << I2S_STATUS_RXFULL_Pos)        /*!< I2S_STATUS: RXFULL Mask */
#define I2S_STATUS_RXEMPTY_Pos        12                                      /*!< I2S_STATUS: Receive FIFO empty flag */
#define I2S_STATUS_RXEMPTY_Msk        (0x1ul << I2S_STATUS_RXEMPTY_Pos)        /*!< I2S_STATUS: RXEMPTY Mask */
#define I2S_STATUS_TXUDF_Pos        16                                      /*!< I2S_STATUS: Transmit FIFO underflow flag */
#define I2S_STATUS_TXUDF_Msk        (0x1ul << I2S_STATUS_TXUDF_Pos)            /*!< I2S_STATUS: TXUDF Mask */
#define I2S_STATUS_TXOVF_Pos        17                                      /*!< I2S_STATUS: Transmit FIFO overflow flag */
#define I2S_STATUS_TXOVF_Msk        (0x1ul << I2S_STATUS_TXOVF_Pos)            /*!< I2S_STATUS: TXOVF Mask */
#define I2S_STATUS_TXTHF_Pos        18                                      /*!< I2S_STATUS: Transmit FIFO threshold flag */
#define I2S_STATUS_TXTHF_Msk        (0x1ul << I2S_STATUS_TXTHF_Pos)            /*!< I2S_STATUS: TXTHF Mask */
#define I2S_STATUS_TXFULL_Pos        19                                      /*!< I2S_STATUS: Transmit FIFO full flag */
#define I2S_STATUS_TXFULL_Msk        (0x1ul << I2S_STATUS_TXFULL_Pos)        /*!< I2S_STATUS: TXFULL Mask */
#define I2S_STATUS_TXEMPTY_Pos        20                                      /*!< I2S_STATUS: Transmit FIFO empty flag */
#define I2S_STATUS_TXEMPTY_Msk        (0x1ul << I2S_STATUS_TXEMPTY_Pos)        /*!< I2S_STATUS: TXEMPTY Mask */
#define I2S_STATUS_TXBUSY_Pos        21                                      /*!< I2S_STATUS: Transmit under busy */
#define I2S_STATUS_TXBUSY_Msk        (0x1ul << I2S_STATUS_TXBUSY_Pos)        /*!< I2S_STATUS: TXBUSY Mask */
#define I2S_STATUS_RZCIE_Pos        22                                      /*!< I2S_STATUS: Right channel zero-cross flag */
#define I2S_STATUS_RZCIE_Msk        (0x1ul << I2S_STATUS_RZCIE_Pos)            /*!< I2S_STATUS: RZCIE Mask */
#define I2S_STATUS_LZCIE_Pos        23                                      /*!< I2S_STATUS: Left channel zero-cross flag */
#define I2S_STATUS_LZCIE_Msk        (0x1ul << I2S_STATUS_LZCIE_Pos)            /*!< I2S_STATUS: LZCIE Mask */
#define I2S_STATUS_RX_LEVEL_Pos        24                                      /*!< I2S_STATUS: Receive FIFO level */
#define I2S_STATUS_RX_LEVEL_Msk        (0xFul << I2S_STATUS_RX_LEVEL_Pos)        /*!< I2S_STATUS: RX_LEVEL Mask */
#define I2S_STATUS_TX_LEVEL_Pos        28                                      /*!< I2S_STATUS: Transmit FIFO level */
#define I2S_STATUS_TX_LEVEL_Msk        (0xFul << I2S_STATUS_TX_LEVEL_Pos)        /*!< I2S_STATUS: TX_LEVEL Mask */

/*@}*/ /* end of group NUC400_I2S */

