coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/*------------- USB Device Control Register (USBD) -----------------------------*/
/** @addtogroup NUC400_USBD NUC400 USB Device Control Register (USBD)
  @{
*/
typedef struct {
    __IO uint32_t IRQ_STAT_L;                    /*!< Offset: 0x0000   Interrupt Register */
    uint32_t RESERVED0;                          /*!< Offset: 0x0004   Reserved */
    __IO uint32_t IRQ_ENB_L;                     /*!< Offset: 0x0008   Interrupt Enable Low Register */
    uint32_t RESERVED1;                          /*!< Offset: 0x000C   Reserved */
    __IO uint32_t IRQ_STAT;                      /*!< Offset: 0x0010   USB Interrupt Status Register */
    __IO uint32_t IRQ_ENB;                       /*!< Offset: 0x0014   USB Interrupt Enable Register */
    __IO uint32_t OPER;                          /*!< Offset: 0x0018   USB Operational Register */
    __I  uint32_t FRAME_CNT;                     /*!< Offset: 0x001C   USB Frame Count Register */
    __IO uint32_t ADDR;                          /*!< Offset: 0x0020   USB Address Register */
    __IO uint32_t TEST;                          /*!< Offset: 0x0024   USB Test Mode Register */
    union {
        __IO uint32_t CEP_DATA_BUF;                  /*!< Offset: 0x0028   Control-ep Data Buffer */
        __IO uint8_t  CEP_DATA_BUF_BYTE;
    };
    __IO uint32_t CEP_CTRL_STAT;                 /*!< Offset: 0x002C   Control-ep Control and Status */
    __IO uint32_t CEP_IRQ_ENB;                   /*!< Offset: 0x0030   Control-ep Interrupt Enable */
    __IO uint32_t CEP_IRQ_STAT;                  /*!< Offset: 0x0034   Control-ep Interrupt Status */
    __IO uint32_t IN_TRF_CNT;                    /*!< Offset: 0x0038   In-transfer Data Count */
    __I  uint32_t OUT_TRF_CNT;                   /*!< Offset: 0x003C   Out-transfer Data Count */
    __I  uint32_t CEP_CNT;                       /*!< Offset: 0x0040   Control-ep Data Count */
    __I  uint32_t SETUP1_0;                      /*!< Offset: 0x0044   Setup1 & Setup0 bytes */
    __I  uint32_t SETUP3_2;                      /*!< Offset: 0x0048   Setup3 & Setup2 bytes */
    __I  uint32_t SETUP5_4;                      /*!< Offset: 0x004C   Setup5 & Setup4 bytes */
    __I  uint32_t SETUP7_6;                      /*!< Offset: 0x0050   Setup7 & Setup6 bytes */
    __IO uint32_t CEP_START_ADDR;                /*!< Offset: 0x0054   Control-ep RAM Start Address Register */
    __IO uint32_t CEP_END_ADDR;                  /*!< Offset: 0x0058   Control-ep RAM End Address Register */
    __IO uint32_t DMA_CTRL_STS;                  /*!< Offset: 0x005C   DMA Control Status Register */
    __IO uint32_t DMA_CNT;                       /*!< Offset: 0x0060   DMA Count Register */
    union {
        __IO uint32_t EPA_DATA_BUF;                  /*!< Offset: 0x0064   Endpoint A Data Register */
        __IO uint8_t EPA_DATA_BUF_BYTE;
    };
    __IO uint32_t EPA_IRQ_STAT;                  /*!< Offset: 0x0068   Endpoint A Interrupt Status Register */
    __IO uint32_t EPA_IRQ_ENB;                   /*!< Offset: 0x006C   Endpoint A Interrupt Enable Register */
    __I  uint32_t EPA_DATA_CNT;                  /*!< Offset: 0x0070   Endpoint A Data Available count Register */
    __IO uint32_t EPA_RSP_SC;                    /*!< Offset: 0x0074   Endpoint A Response Set/Clear Register */
    __IO uint32_t EPA_MPS;                       /*!< Offset: 0x0078   Endpoint A Maximum Packet Size Register */
    __IO uint32_t EPA_TRF_CNT;                   /*!< Offset: 0x007C   Endpoint A Transfer Count Register */
    __IO uint32_t EPA_CFG;                       /*!< Offset: 0x0080   Endpoint A Configuration Register */
    __IO uint32_t EPA_START_ADDR;                /*!< Offset: 0x0084   Endpoint A RAM Start Address Register */
    __IO uint32_t EPA_END_ADDR;                  /*!< Offset: 0x0088   Endpoint A RAM End Address Register */
    union {
        __IO uint32_t EPB_DATA_BUF;                  /*!< Offset: 0x008c   Endpoint B Data Register */
        __IO uint8_t EPB_DATA_BUF_BYTE;
    };
    __IO uint32_t EPB_IRQ_STAT;                  /*!< Offset: 0x0090   Endpoint B Interrupt Status Register */
    __IO uint32_t EPB_IRQ_ENB;                   /*!< Offset: 0x0094   Endpoint B Interrupt Enable Register */
    __I  uint32_t EPB_DATA_CNT;                  /*!< Offset: 0x0098   Endpoint B Data Available count Register */
    __IO uint32_t EPB_RSP_SC;                    /*!< Offset: 0x009C   Endpoint B Response Set/Clear Register */
    __IO uint32_t EPB_MPS;                       /*!< Offset: 0x00A0   Endpoint B Maximum Packet Size Register */
    __IO uint32_t EPB_TRF_CNT;                   /*!< Offset: 0x00A4   Endpoint B Transfer Count Register */
    __IO uint32_t EPB_CFG;                       /*!< Offset: 0x00A8   Endpoint B Configuration Register */
    __IO uint32_t EPB_START_ADDR;                /*!< Offset: 0x00AC   Endpoint B RAM Start Address Register */
    __IO uint32_t EPB_END_ADDR;                  /*!< Offset: 0x00B0   Endpoint B RAM End Address Register */
    union {
        __IO uint32_t EPC_DATA_BUF;                  /*!< Offset: 0x00B4   Endpoint C Data Register */
        __IO uint8_t EPC_DATA_BUF_BYTE;
    };
    __IO uint32_t EPC_IRQ_STAT;                  /*!< Offset: 0x00B8   Endpoint C Interrupt Status Register */
    __IO uint32_t EPC_IRQ_ENB;                   /*!< Offset: 0x00BC   Endpoint C Interrupt Enable Register */
    __I  uint32_t EPC_DATA_CNT;                  /*!< Offset: 0x00C0   Endpoint C Data Available count Register */
    __IO uint32_t EPC_RSP_SC;                    /*!< Offset: 0x00C4   Endpoint C Response Set/Clear Register */
    __IO uint32_t EPC_MPS;                       /*!< Offset: 0x00C8   Endpoint C Maximum Packet Size Register */
    __IO uint32_t EPC_TRF_CNT;                   /*!< Offset: 0x00CC   Endpoint C Transfer Count Register */
    __IO uint32_t EPC_CFG;                       /*!< Offset: 0x00D0   Endpoint C Configuration Register */
    __IO uint32_t EPC_START_ADDR;                /*!< Offset: 0x00D4   Endpoint C RAM Start Address Register */
    __IO uint32_t EPC_END_ADDR;                  /*!< Offset: 0x00D8   Endpoint C RAM End Address Register */
    union {
        __IO uint32_t EPD_DATA_BUF;                  /*!< Offset: 0x00dc   Endpoint D Data Register */
        __IO uint8_t EPD_DATA_BUF_BYTE;
    };
    __IO uint32_t EPD_IRQ_STAT;                  /*!< Offset: 0x00E0   Endpoint D Interrupt Status Register */
    __IO uint32_t EPD_IRQ_ENB;                   /*!< Offset: 0x00E4   Endpoint D Interrupt Enable Register */
    __I  uint32_t EPD_DATA_CNT;                  /*!< Offset: 0x00E8   Endpoint D Data Available count Register */
    __IO uint32_t EPD_RSP_SC;                    /*!< Offset: 0x00EC   Endpoint D Response Set/Clear Register */
    __IO uint32_t EPD_MPS;                       /*!< Offset: 0x00F0   Endpoint D Maximum Packet Size Register */
    __IO uint32_t EPD_TRF_CNT;                   /*!< Offset: 0x00F4   Endpoint D Transfer Count Register */
    __IO uint32_t EPD_CFG;                       /*!< Offset: 0x00F8   Endpoint D Configuration Register */
    __IO uint32_t EPD_START_ADDR;                /*!< Offset: 0x00FC   Endpoint D RAM Start Address Register */
    __IO uint32_t EPD_END_ADDR;                  /*!< Offset: 0x0100   Endpoint D RAM End Address Register */
    union {
        __IO uint32_t EPE_DATA_BUF;                  /*!< Offset: 0x0104   Endpoint E Data Register */
        __IO uint8_t EPE_DATA_BUF_BYTE;
    };
    __IO uint32_t EPE_IRQ_STAT;                  /*!< Offset: 0x0108   Endpoint E Interrupt Status Register */
    __IO uint32_t EPE_IRQ_ENB;                   /*!< Offset: 0x010C   Endpoint E Interrupt Enable Register */
    __I  uint32_t EPE_DATA_CNT;                  /*!< Offset: 0x0110   Endpoint E Data Available count Register */
    __IO uint32_t EPE_RSP_SC;                    /*!< Offset: 0x0114   Endpoint E Response Set/Clear Register */
    __IO uint32_t EPE_MPS;                       /*!< Offset: 0x0118   Endpoint E Maximum Packet Size Register */
    __IO uint32_t EPE_TRF_CNT;                   /*!< Offset: 0x011C   Endpoint E Transfer Count Register */
    __IO uint32_t EPE_CFG;                       /*!< Offset: 0x0120   Endpoint E Configuration Register */
    __IO uint32_t EPE_START_ADDR;                /*!< Offset: 0x0124   Endpoint E RAM Start Address Register */
    __IO uint32_t EPE_END_ADDR;                  /*!< Offset: 0x0128   Endpoint E RAM End Address Register */
    union {
        __IO uint32_t EPF_DATA_BUF;                  /*!< Offset: 0x012c   Endpoint F Data Register */
        __IO uint8_t EPF_DATA_BUF_BYTE;
    };
    __IO uint32_t EPF_IRQ_STAT;                  /*!< Offset: 0x0130   Endpoint F Interrupt Status Register */
    __IO uint32_t EPF_IRQ_ENB;                   /*!< Offset: 0x0134   Endpoint F Interrupt Enable Register */
    __I  uint32_t EPF_DATA_CNT;                  /*!< Offset: 0x0138   Endpoint F Data Available count Register */
    __IO uint32_t EPF_RSP_SC;                    /*!< Offset: 0x013C   Endpoint F Response Set/Clear Register */
    __IO uint32_t EPF_MPS;                       /*!< Offset: 0x0140   Endpoint F Maximum Packet Size Register */
    __IO uint32_t EPF_TRF_CNT;                   /*!< Offset: 0x0144   Endpoint F Transfer Count Register */
    __IO uint32_t EPF_CFG;                       /*!< Offset: 0x0148   Endpoint F Configuration Register */
    __IO uint32_t EPF_START_ADDR;                /*!< Offset: 0x014C   Endpoint F RAM Start Address Register */
    __IO uint32_t EPF_END_ADDR;                  /*!< Offset: 0x0150   Endpoint F RAM End Address Register */
    union {
        __IO uint32_t EPG_DATA_BUF;                  /*!< Offset: 0x0154   Endpoint F Data Register */
        __IO uint8_t EPG_DATA_BUF_BYTE;
    };
    __IO uint32_t EPG_IRQ_STAT;                  /*!< Offset: 0x0158   Endpoint G Interrupt Status Register */
    __IO uint32_t EPG_IRQ_ENB;                   /*!< Offset: 0x015C   Endpoint G Interrupt Enable Register */
    __I  uint32_t EPG_DATA_CNT;                  /*!< Offset: 0x0160   Endpoint G Data Available count Register */
    __IO uint32_t EPG_RSP_SC;                    /*!< Offset: 0x0164   Endpoint G Response Set/Clear Register */
    __IO uint32_t EPG_MPS;                       /*!< Offset: 0x0168   Endpoint G Maximum Packet Size Register */
    __IO uint32_t EPG_TRF_CNT;                   /*!< Offset: 0x016C   Endpoint G Transfer Count Register */
    __IO uint32_t EPG_CFG;                       /*!< Offset: 0x0170   Endpoint G Configuration Register */
    __IO uint32_t EPG_START_ADDR;                /*!< Offset: 0x0174   Endpoint G RAM Start Address Register */
    __IO uint32_t EPG_END_ADDR;                  /*!< Offset: 0x0178   Endpoint G RAM End Address Register */
    union {
        __IO uint32_t EPH_DATA_BUF;                  /*!< Offset: 0x017c   Endpoint H Data Register */
        __IO uint8_t EPH_DATA_BUF_BYTE;
    };
    __IO uint32_t EPH_IRQ_STAT;                  /*!< Offset: 0x0180   Endpoint H Interrupt Status Register */
    __IO uint32_t EPH_IRQ_ENB;                   /*!< Offset: 0x0184   Endpoint H Interrupt Enable Register */
    __I  uint32_t EPH_DATA_CNT;                  /*!< Offset: 0x0188   Endpoint H Data Available count Register */
    __IO uint32_t EPH_RSP_SC;                    /*!< Offset: 0x018C   Endpoint H Response Set/Clear Register */
    __IO uint32_t EPH_MPS;                       /*!< Offset: 0x0190   Endpoint H Maximum Packet Size Register */
    __IO uint32_t EPH_TRF_CNT;                   /*!< Offset: 0x0194   Endpoint H Transfer Count Register */
    __IO uint32_t EPH_CFG;                       /*!< Offset: 0x0198   Endpoint H Configuration Register */
    __IO uint32_t EPH_START_ADDR;                /*!< Offset: 0x019C   Endpoint H RAM Start Address Register */
    __IO uint32_t EPH_END_ADDR;                  /*!< Offset: 0x01A0   Endpoint H RAM End Address Register */
    union {
        __IO uint32_t EPI_DATA_BUF;                  /*!< Offset: 0x01A4   Endpoint I Data Register */
        __IO uint8_t EPI_DATA_BUF_BYTE;
    };
    __IO uint32_t EPI_IRQ_STAT;                  /*!< Offset: 0x01A8   Endpoint I Interrupt Status Register */
    __IO uint32_t EPI_IRQ_ENB;                   /*!< Offset: 0x01AC   Endpoint I Interrupt Enable Register */
    __I  uint32_t EPI_DATA_CNT;                  /*!< Offset: 0x01B0   Endpoint I Data Available count Register */
    __IO uint32_t EPI_RSP_SC;                    /*!< Offset: 0x01B4   Endpoint I Response Set/Clear Register */
    __IO uint32_t EPI_MPS;                       /*!< Offset: 0x01B8   Endpoint I Maximum Packet Size Register */
    __IO uint32_t EPI_TRF_CNT;                   /*!< Offset: 0x01BC   Endpoint I Transfer Count Register */
    __IO uint32_t EPI_CFG;                       /*!< Offset: 0x01C0   Endpoint I Configuration Register */
    __IO uint32_t EPI_START_ADDR;                /*!< Offset: 0x01C4   Endpoint I RAM Start Address Register */
    __IO uint32_t EPI_END_ADDR;                  /*!< Offset: 0x01C8   Endpoint I RAM End Address Register */
    union {
        __IO uint32_t EPJ_DATA_BUF;                  /*!< Offset: 0x01cc   Endpoint J Data Register */
        __IO uint8_t EPJ_DATA_BUF_BYTE;
    };
    __IO uint32_t EPJ_IRQ_STAT;                  /*!< Offset: 0x01D0   Endpoint J Interrupt Status Register */
    __IO uint32_t EPJ_IRQ_ENB;                   /*!< Offset: 0x01D4   Endpoint J Interrupt Enable Register */
    __I  uint32_t EPJ_DATA_CNT;                  /*!< Offset: 0x01D8   Endpoint J Data Available count Register */
    __IO uint32_t EPJ_RSP_SC;                    /*!< Offset: 0x01DC   Endpoint J Response Set/Clear Register */
    __IO uint32_t EPJ_MPS;                       /*!< Offset: 0x01E0   Endpoint J Maximum Packet Size Register */
    __IO uint32_t EPJ_TRF_CNT;                   /*!< Offset: 0x01E4   Endpoint J Transfer Count Register */
    __IO uint32_t EPJ_CFG;                       /*!< Offset: 0x01E8   Endpoint J Configuration Register */
    __IO uint32_t EPJ_START_ADDR;                /*!< Offset: 0x01EC   Endpoint J RAM Start Address Register */
    __IO uint32_t EPJ_END_ADDR;                  /*!< Offset: 0x01F0   Endpoint J RAM End Address Register */
    union {
        __IO uint32_t EPK_DATA_BUF;                  /*!< Offset: 0x01f4   Endpoint K Data Register */
        __IO uint8_t EPK_DATA_BUF_BYTE;
    };
    __IO uint32_t EPK_IRQ_STAT;                  /*!< Offset: 0x01F8   Endpoint K Interrupt Status Register */
    __IO uint32_t EPK_IRQ_ENB;                   /*!< Offset: 0x01FC   Endpoint K Interrupt Enable Register */
    __I  uint32_t EPK_DATA_CNT;                  /*!< Offset: 0x0200   Endpoint K Data Available count Register */
    __IO uint32_t EPK_RSP_SC;                    /*!< Offset: 0x0204   Endpoint K Response Set/Clear Register */
    __IO uint32_t EPK_MPS;                       /*!< Offset: 0x0208   Endpoint K Maximum Packet Size Register */
    __IO uint32_t EPK_TRF_CNT;                   /*!< Offset: 0x020C   Endpoint K Transfer Count Register */
    __IO uint32_t EPK_CFG;                       /*!< Offset: 0x0210   Endpoint K Configuration Register */
    __IO uint32_t EPK_START_ADDR;                /*!< Offset: 0x0214   Endpoint K RAM Start Address Register */
    __IO uint32_t EPK_END_ADDR;                  /*!< Offset: 0x0218   Endpoint K RAM End Address Register */
    union {
        __IO uint32_t EPL_DATA_BUF;                  /*!< Offset: 0x021c   Endpoint L Data Register */
        __IO uint8_t EPL_DATA_BUF_BYTE;
    };
    __IO uint32_t EPL_IRQ_STAT;                  /*!< Offset: 0x0220   Endpoint L Interrupt Status Register */
    __IO uint32_t EPL_IRQ_ENB;                   /*!< Offset: 0x0224   Endpoint L Interrupt Enable Register */
    __I  uint32_t EPL_DATA_CNT;                  /*!< Offset: 0x0228   Endpoint L Data Available count Register */
    __IO uint32_t EPL_RSP_SC;                    /*!< Offset: 0x022C   Endpoint L Response Set/Clear Register */
    __IO uint32_t EPL_MPS;                       /*!< Offset: 0x0230   Endpoint L Maximum Packet Size Register */
    __IO uint32_t EPL_TRF_CNT;                   /*!< Offset: 0x0234   Endpoint L Transfer Count Register */
    __IO uint32_t EPL_CFG;                       /*!< Offset: 0x0238   Endpoint L Configuration Register */
    __IO uint32_t EPL_START_ADDR;                /*!< Offset: 0x023C   Endpoint L RAM Start Address Register */
    __IO uint32_t EPL_END_ADDR;                  /*!< Offset: 0x0240   Endpoint L RAM End Address Register */
    uint32_t RESERVED2;                       /*!< Offset: 0x0244   Reserved */
    __IO uint32_t HEAD_WORD0;                    /*!< Offset: 0x0248   USB head word 0 Register */
    __IO uint32_t HEAD_WORD1;                    /*!< Offset: 0x024C   USB head word 1 Register */
    __IO uint32_t HEAD_WORD2;                    /*!< Offset: 0x0250   USB head word 2 Register */
    __IO uint32_t EPA_HEAD_CNT;                  /*!< Offset: 0x0254   Endpoint A head count Register */
    __IO uint32_t EPB_HEAD_CNT;                  /*!< Offset: 0x0258   Endpoint B head count Register */
    __IO uint32_t EPC_HEAD_CNT;                  /*!< Offset: 0x025C   Endpoint C head count Register */
    __IO uint32_t EPD_HEAD_CNT;                  /*!< Offset: 0x0260   Endpoint D head count Register */
    __IO uint32_t EPE_HEAD_CNT;                  /*!< Offset: 0x0264   Endpoint E head count Register */
    __IO uint32_t EPF_HEAD_CNT;                  /*!< Offset: 0x0268   Endpoint F head count Register */
    __IO uint32_t EPG_HEAD_CNT;                  /*!< Offset: 0x026C   Endpoint G head count Register */
    __IO uint32_t EPH_HEAD_CNT;                  /*!< Offset: 0x0270   Endpoint H head count Register */
    __IO uint32_t EPI_HEAD_CNT;                  /*!< Offset: 0x0274   Endpoint I head count Register */
    __IO uint32_t EPJ_HEAD_CNT;                  /*!< Offset: 0x0278   Endpoint J head count Register */
    __IO uint32_t EPK_HEAD_CNT;                  /*!< Offset: 0x027C   Endpoint K head count Register */
    __IO uint32_t EPL_HEAD_CNT;                  /*!< Offset: 0x0280   Endpoint L head count Register */
    uint32_t RESERVED3[287];                     /*!< Offset: 0x0284 ~ 0x6FC   Reserved  */
    __IO uint32_t AHB_DMA_ADDR;                  /*!< Offset: 0x0700   AHB Address Register */
    __IO uint32_t PHY_CTL;                       /*!< Offset: 0x0704   USB PHY Control Register */

} USBD_T;

/* USBD IRQ_STAT_L Bit Field Definitions */
#define USBD_IRQ_STAT_L_EPL_Pos            13                                      /*!< USBD IRQ_STAT_L : EPL Position */
#define USBD_IRQ_STAT_L_EPL_Msk            (1ul << USBD_IRQ_STAT_L_EPL_Pos)        /*!< USBD IRQ_STAT_L : EPL Mask */

#define USBD_IRQ_STAT_L_EPK_Pos            12                                      /*!< USBD IRQ_STAT_L : EPK Position */
#define USBD_IRQ_STAT_L_EPK_Msk            (1ul << USBD_IRQ_STAT_L_EPK_Pos)        /*!< USBD IRQ_STAT_L : EPK Mask */

#define USBD_IRQ_STAT_L_EPJ_Pos            11                                      /*!< USBD IRQ_STAT_L : EPJ Position */
#define USBD_IRQ_STAT_L_EPJ_Msk            (1ul << USBD_IRQ_STAT_L_EPJ_Pos)        /*!< USBD IRQ_STAT_L : EPJ Mask */

#define USBD_IRQ_STAT_L_EPI_Pos            10                                      /*!< USBD IRQ_STAT_L : EPI Position */
#define USBD_IRQ_STAT_L_EPI_Msk            (1ul << USBD_IRQ_STAT_L_EPI_Pos)        /*!< USBD IRQ_STAT_L : EPI Mask */

#define USBD_IRQ_STAT_L_EPH_Pos            9                                       /*!< USBD IRQ_STAT_L : EPH Position */
#define USBD_IRQ_STAT_L_EPH_Msk            (1ul << USBD_IRQ_STAT_L_EPH_Pos)        /*!< USBD IRQ_STAT_L : EPH Mask */

