coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define USBD_IRQ_STAT_L_EPG_Pos            8                                       /*!< USBD IRQ_STAT_L : EPG Position */
#define USBD_IRQ_STAT_L_EPG_Msk            (1ul << USBD_IRQ_STAT_L_EPG_Pos)        /*!< USBD IRQ_STAT_L : EPG Mask */

#define USBD_IRQ_STAT_L_EPF_Pos            7                                       /*!< USBD IRQ_STAT_L : EPF Position */
#define USBD_IRQ_STAT_L_EPF_Msk            (1ul << USBD_IRQ_STAT_L_EPF_Pos)        /*!< USBD IRQ_STAT_L : EPF Mask */

#define USBD_IRQ_STAT_L_EPE_Pos            6                                       /*!< USBD IRQ_STAT_L : EPE Position */
#define USBD_IRQ_STAT_L_EPE_Msk            (1ul << USBD_IRQ_STAT_L_EPE_Pos)        /*!< USBD IRQ_STAT_L : EPE Mask */

#define USBD_IRQ_STAT_L_EPD_Pos            5                                       /*!< USBD IRQ_STAT_L : EPD Position */
#define USBD_IRQ_STAT_L_EPD_Msk            (1ul << USBD_IRQ_STAT_L_EPD_Pos)        /*!< USBD IRQ_STAT_L : EPD Mask */

#define USBD_IRQ_STAT_L_EPC_Pos            4                                       /*!< USBD IRQ_STAT_L : EPC Position */
#define USBD_IRQ_STAT_L_EPC_Msk            (1ul << USBD_IRQ_STAT_L_EPC_Pos)        /*!< USBD IRQ_STAT_L : EPC Mask */

#define USBD_IRQ_STAT_L_EPB_Pos            3                                       /*!< USBD IRQ_STAT_L : EPB Position */
#define USBD_IRQ_STAT_L_EPB_Msk            (1ul << USBD_IRQ_STAT_L_EPB_Pos)        /*!< USBD IRQ_STAT_L : EPB Mask */

#define USBD_IRQ_STAT_L_EPA_Pos            2                                       /*!< USBD IRQ_STAT_L : EPA Position */
#define USBD_IRQ_STAT_L_EPA_Msk            (1ul << USBD_IRQ_STAT_L_EPA_Pos)        /*!< USBD IRQ_STAT_L : EPA Mask */

#define USBD_IRQ_STAT_L_CEP_Pos            1                                       /*!< USBD IRQ_STAT_L : CEP Position */
#define USBD_IRQ_STAT_L_CEP_Msk            (1ul << USBD_IRQ_STAT_L_CEP_Pos)        /*!< USBD IRQ_STAT_L : CEP Mask */

#define USBD_IRQ_STAT_L_USB_Pos            0                                       /*!< USBD IRQ_STAT_L : USB Position */
#define USBD_IRQ_STAT_L_USB_Msk            (1ul << USBD_IRQ_STAT_L_USB_Pos)        /*!< USBD IRQ_STAT_L : USB Mask */

/* USBD IRQ_ENB_L Bit Field Definitions */
#define USBD_IRQ_ENB_L_EPL_Pos            13                                      /*!< USBD IRQ_ENB_L : EPL Position */
#define USBD_IRQ_ENB_L_EPL_Msk            (1ul << USBD_IRQ_ENB_L_EPL_Pos)         /*!< USBD IRQ_ENB_L : EPL Mask */

#define USBD_IRQ_ENB_L_EPK_Pos            12                                      /*!< USBD IRQ_ENB_L : EPK Position */
#define USBD_IRQ_ENB_L_EPK_Msk            (1ul << USBD_IRQ_ENB_L_EPK_Pos)         /*!< USBD IRQ_ENB_L : EPK Mask */

#define USBD_IRQ_ENB_L_EPJ_Pos            11                                      /*!< USBD IRQ_ENB_L : EPJ Position */
#define USBD_IRQ_ENB_L_EPJ_Msk            (1ul << USBD_IRQ_ENB_L_EPJ_Pos)         /*!< USBD IRQ_ENB_L : EPJ Mask */

#define USBD_IRQ_ENB_L_EPI_Pos            10                                      /*!< USBD IRQ_ENB_L : EPI Position */
#define USBD_IRQ_ENB_L_EPI_Msk            (1ul << USBD_IRQ_ENB_L_EPI_Pos)         /*!< USBD IRQ_ENB_L : EPI Mask */

#define USBD_IRQ_ENB_L_EPH_Pos            9                                       /*!< USBD IRQ_ENB_L : EPH Position */
#define USBD_IRQ_ENB_L_EPH_Msk            (1ul << USBD_IRQ_ENB_L_EPH_Pos)         /*!< USBD IRQ_ENB_L : EPH Mask */

#define USBD_IRQ_ENB_L_EPG_Pos            8                                       /*!< USBD IRQ_ENB_L : EPG Position */
#define USBD_IRQ_ENB_L_EPG_Msk            (1ul << USBD_IRQ_ENB_L_EPG_Pos)         /*!< USBD IRQ_ENB_L : EPG Mask */

#define USBD_IRQ_ENB_L_EPF_Pos            7                                       /*!< USBD IRQ_ENB_L : EPF Position */
#define USBD_IRQ_ENB_L_EPF_Msk            (1ul << USBD_IRQ_ENB_L_EPF_Pos)         /*!< USBD IRQ_ENB_L : EPF Mask */

#define USBD_IRQ_ENB_L_EPE_Pos            6                                       /*!< USBD IRQ_ENB_L : EPE Position */
#define USBD_IRQ_ENB_L_EPE_Msk            (1ul << USBD_IRQ_ENB_L_EPE_Pos)         /*!< USBD IRQ_ENB_L : EPE Mask */

#define USBD_IRQ_ENB_L_EPD_Pos            5                                       /*!< USBD IRQ_ENB_L : EPD Position */
#define USBD_IRQ_ENB_L_EPD_Msk            (1ul << USBD_IRQ_ENB_L_EPD_Pos)         /*!< USBD IRQ_ENB_L : EPD Mask */

#define USBD_IRQ_ENB_L_EPC_Pos            4                                       /*!< USBD IRQ_ENB_L : EPC Position */
#define USBD_IRQ_ENB_L_EPC_Msk            (1ul << USBD_IRQ_ENB_L_EPC_Pos)         /*!< USBD IRQ_ENB_L : EPC Mask */

#define USBD_IRQ_ENB_L_EPB_Pos            3                                       /*!< USBD IRQ_ENB_L : EPB Position */
#define USBD_IRQ_ENB_L_EPB_Msk            (1ul << USBD_IRQ_ENB_L_EPB_Pos)         /*!< USBD IRQ_ENB_L : EPB Mask */

#define USBD_IRQ_ENB_L_EPA_Pos            2                                       /*!< USBD IRQ_ENB_L : EPA Position */
#define USBD_IRQ_ENB_L_EPA_Msk            (1ul << USBD_IRQ_ENB_L_EPA_Pos)         /*!< USBD IRQ_ENB_L : EPA Mask */

#define USBD_IRQ_ENB_L_CEP_Pos            1                                       /*!< USBD IRQ_ENB_L : CEP Position */
#define USBD_IRQ_ENB_L_CEP_Msk            (1ul << USBD_IRQ_ENB_L_CEP_Pos)         /*!< USBD IRQ_ENB_L : CEP Mask */

#define USBD_IRQ_ENB_L_USB_Pos            0                                       /*!< USBD IRQ_ENB_L : USB Position */
#define USBD_IRQ_ENB_L_USB_Msk            (1ul << USBD_IRQ_ENB_L_USB_Pos)         /*!< USBD IRQ_ENB_L : USB Mask */

/* USBD IRQ_STAT Bit Field Definitions */
#define USBD_IRQ_STAT_FLODET_Pos          8                                      /*!< USBD IRQ_STAT : FLODET Position */
#define USBD_IRQ_STAT_FLODET_Msk          (1ul << USBD_IRQ_STAT_FLODET_Pos)      /*!< USBD IRQ_STAT : FLODET Mask */

#define USBD_IRQ_STAT_TCLKOK_Pos          6                                      /*!< USBD IRQ_STAT : TCLKOK Position */
#define USBD_IRQ_STAT_TCLKOK_Msk          (1ul << USBD_IRQ_STAT_TCLKOK_Pos)      /*!< USBD IRQ_STAT : TCLKOK Mask */

#define USBD_IRQ_STAT_DMACOM_Pos          5                                      /*!< USBD IRQ_STAT : DMACOM Position */
#define USBD_IRQ_STAT_DMACOM_Msk          (1ul << USBD_IRQ_STAT_DMACOM_Pos)      /*!< USBD IRQ_STAT : DMACOM Mask */

#define USBD_IRQ_STAT_HISPD_Pos           4                                      /*!< USBD IRQ_STAT : HISPD Position */
#define USBD_IRQ_STAT_HISPD_Msk           (1ul << USBD_IRQ_STAT_HISPD_Pos)       /*!< USBD IRQ_STAT : HISPD Mask */

#define USBD_IRQ_STAT_SUS_Pos             3                                      /*!< USBD IRQ_STAT : SUS Position */
#define USBD_IRQ_STAT_SUS_Msk             (1ul << USBD_IRQ_STAT_SUS_Pos)         /*!< USBD IRQ_STAT : SUS Mask */

#define USBD_IRQ_STAT_RUM_Pos             2                                      /*!< USBD IRQ_STAT : RUM Position */
#define USBD_IRQ_STAT_RUM_Msk             (1ul << USBD_IRQ_STAT_RUM_Pos)         /*!< USBD IRQ_STAT : RUM Mask */

#define USBD_IRQ_STAT_RST_Pos             1                                      /*!< USBD IRQ_STAT : RST Position */
#define USBD_IRQ_STAT_RST_Msk             (1ul << USBD_IRQ_STAT_RST_Pos)         /*!< USBD IRQ_STAT : RST Mask */

#define USBD_IRQ_STAT_SOF_Pos             0                                      /*!< USBD IRQ_STAT : SOF Position */
#define USBD_IRQ_STAT_SOF_Msk             (1ul << USBD_IRQ_STAT_SOF_Pos)         /*!< USBD IRQ_STAT : SOF Mask */

/* USBD IRQ_ENB Bit Field Definitions */
#define USBD_IRQ_ENB_FLODET_Pos           8                                      /*!< USBD IRQ_ENB : FLODET Position */
#define USBD_IRQ_ENB_FLODET_Msk           (1ul << USBD_IRQ_ENB_FLODET_Pos)       /*!< USBD IRQ_ENB : FLODET Mask */

#define USBD_IRQ_ENB_TCLKOK_Pos           6                                      /*!< USBD IRQ_ENB : TCLKOK Position */
#define USBD_IRQ_ENB_TCLKOK_Msk           (1ul << USBD_IRQ_ENB_TCLKOK_Pos)       /*!< USBD IRQ_ENB : TCLKOK Mask */

#define USBD_IRQ_ENB_DMACOM_Pos           5                                      /*!< USBD IRQ_ENB : DMACOM Position */
#define USBD_IRQ_ENB_DMACOM_Msk           (1ul << USBD_IRQ_ENB_DMACOM_Pos)       /*!< USBD IRQ_ENB : DMACOM Mask */

#define USBD_IRQ_ENB_HISPD_Pos            4                                      /*!< USBD IRQ_ENB : HISPD Position */
#define USBD_IRQ_ENB_HISPD_Msk            (1ul << USBD_IRQ_ENB_HISPD_Pos)        /*!< USBD IRQ_ENB : HISPD Mask */

#define USBD_IRQ_ENB_SUS_Pos              3                                      /*!< USBD IRQ_ENB : SUS Position */
#define USBD_IRQ_ENB_SUS_Msk              (1ul << USBD_IRQ_ENB_SUS_Pos)          /*!< USBD IRQ_ENB : SUS Mask */

#define USBD_IRQ_ENB_RUM_Pos              2                                      /*!< USBD IRQ_ENB : RUM Position */
#define USBD_IRQ_ENB_RUM_Msk              (1ul << USBD_IRQ_ENB_RUM_Pos)          /*!< USBD IRQ_ENB : RUM Mask */

#define USBD_IRQ_ENB_RST_Pos              1                                      /*!< USBD IRQ_ENB : RST Position */
#define USBD_IRQ_ENB_RST_Msk              (1ul << USBD_IRQ_ENB_RST_Pos)          /*!< USBD IRQ_ENB : RST Mask */

#define USBD_IRQ_ENB_SOF_Pos              0                                      /*!< USBD IRQ_ENB : SOF Position */
#define USBD_IRQ_ENB_SOF_Msk              (1ul << USBD_IRQ_ENB_SOF_Pos)          /*!< USBD IRQ_ENB : SOF Mask */

