coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* USBD OPER Bit Field Definitions */
#define USBD_OPER_CUR_SPD_Pos             2                                      /*!< USBD OPER : CUR_SPD Position */
#define USBD_OPER_CUR_SPD_Msk             (1ul << USBD_OPER_CUR_SPD_Pos)         /*!< USBD OPER : CUR_SPD Mask */

#define USBD_OPER_SET_HISPD_Pos           1                                      /*!< USBD OPER : SET_HISPD Position */
#define USBD_OPER_SET_HISPD_Msk           (1ul << USBD_OPER_SET_HISPD_Pos)       /*!< USBD OPER : SET_HISPD Mask */

#define USBD_OPER_GEN_RUM_Pos             0                                      /*!< USBD OPER : GEN_RUM Position */
#define USBD_OPER_GEN_RUM_Msk             (1ul << USBD_OPER_GEN_RUM_Pos)         /*!< USBD OPER : GEN_RUM Mask */

/* USBD FRAME_CNT Bit Field Definitions */
#define USBD_FRAME_CNT_FRAME_CNT_Pos      3                                          /*!< USBD FRAME_CNT : FRAME_CNT Position */
#define USBD_FRAME_CNT_FRAME_CNT_Msk      (0X7FFul << USBD_FRAME_CNT_FRAME_CNT_Pos)  /*!< USBD FRAME_CNT : FRAME_CNT Mask */

#define USBD_FRAME_CNT_MFRAME_CNT_Pos     0                                          /*!< USBD FRAME_CNT : MFRAME_CNT Position */
#define USBD_FRAME_CNT_MFRAME_CNT_Msk     (0X7ul << USBD_FRAME_CNT_MFRAME_CNT_Pos)   /*!< USBD FRAME_CNT : MFRAME_CNT Mask */

/* USBD ADDR Bit Field Definitions */
#define USBD_ADDR_ADDR_Pos                3                                          /*!< USBD ADDR : ADDR Position */
#define USBD_ADDR_ADDR_Msk                (0X7FFul << USBD_ADDR_ADDR_Pos)            /*!< USBD ADDR : ADDR Mask */

/* USBD CEP_DATA_BUF Bit Field Definitions */
#define USBD_CEP_DATA_BUF_Pos             0                                          /*!< USBD CEP_DATA_BUF : DATA_BUF Position */
#define USBD_CEP_DATA_BUF_Msk             (0XFFFFFFFFul << USBD_CEP_DATA_BUF_Pos)    /*!< USBD CEP_DATA_BUF : DATA_BUF Mask */

/* USBD CEP_CTRL_STAT Bit Field Definitions */
#define USBD_CEP_CTRL_STAT_FLUSH_Pos      3                                          /*!< USBD CEP_CTRL_STAT : FLUSH Position */
#define USBD_CEP_CTRL_STAT_FLUSH_Msk      (1ul << USBD_CEP_CTRL_STAT_FLUSH_Pos)      /*!< USBD CEP_CTRL_STAT : FLUSH Mask */

#define USBD_CEP_CTRL_STAT_ZEROLEN_Pos    2                                          /*!< USBD CEP_CTRL_STAT : ZEROLEN Position */
#define USBD_CEP_CTRL_STAT_ZEROLEN_Msk    (1ul << USBD_CEP_CTRL_STAT_ZEROLEN_Pos)    /*!< USBD CEP_CTRL_STAT : ZEROLEN Mask */

#define USBD_CEP_CTRL_STAT_STLALL_Pos     1                                          /*!< USBD CEP_CTRL_STAT : STLALL Position */
#define USBD_CEP_CTRL_STAT_STLALL_Msk     (1ul << USBD_CEP_CTRL_STAT_STLALL_Pos)     /*!< USBD CEP_CTRL_STAT : STLALL Mask */

#define USBD_CEP_CTRL_STAT_NAK_CLEAR_Pos  0                                          /*!< USBD CEP_CTRL_STAT : NAK_CLEAR Position */
#define USBD_CEP_CTRL_STAT_NAK_CLEAR_Msk  (1ul << USBD_CEP_CTRL_STAT_NAK_CLEAR_Pos)  /*!< USBD CEP_CTRL_STAT : NAK_CLEAR Mask */

/* USBD CEP_IRQ_ENB Bit Field Definitions */
#define USBD_CEP_IRQ_ENB_EMPTY_Pos        12                                         /*!< USBD CEP_IRQ_ENB : EMPTY Position */
#define USBD_CEP_IRQ_ENB_EMPTY_Msk        (1ul << USBD_CEP_IRQ_ENB_EMPTY_Pos)        /*!< USBD CEP_IRQ_ENB : EMPTY Mask */

#define USBD_CEP_IRQ_ENB_FULL_Pos         11                                         /*!< USBD CEP_IRQ_ENB : FULL Position */
#define USBD_CEP_IRQ_ENB_FULL_Msk         (1ul << USBD_CEP_IRQ_ENB_FULL_Pos)         /*!< USBD CEP_IRQ_ENB : FULL Mask */

#define USBD_CEP_IRQ_ENB_STACOM_Pos       10                                         /*!< USBD CEP_IRQ_ENB : STACOM Position */
#define USBD_CEP_IRQ_ENB_STACOM_Msk       (1ul << USBD_CEP_IRQ_ENB_STACOM_Pos)       /*!< USBD CEP_IRQ_ENB : STACOM Mask */

#define USBD_CEP_IRQ_ENB_ERR_Pos          9                                          /*!< USBD CEP_IRQ_ENB : ERR Position */
#define USBD_CEP_IRQ_ENB_ERR_Msk          (1ul << USBD_CEP_IRQ_ENB_ERR_Pos)          /*!< USBD CEP_IRQ_ENB : ERR Mask */

#define USBD_CEP_IRQ_ENB_STALL_Pos        8                                          /*!< USBD CEP_IRQ_ENB : STALL Position */
#define USBD_CEP_IRQ_ENB_STALL_Msk        (1ul << USBD_CEP_IRQ_ENB_STALL_Pos)        /*!< USBD CEP_IRQ_ENB : STALL Mask */

#define USBD_CEP_IRQ_ENB_NAK_Pos          7                                          /*!< USBD CEP_IRQ_ENB : NAK Position */
#define USBD_CEP_IRQ_ENB_NAK_Msk          (1ul << USBD_CEP_IRQ_ENB_NAK_Pos)          /*!< USBD CEP_IRQ_ENB : NAK Mask */

#define USBD_CEP_IRQ_ENB_DATA_RxED_Pos    6                                          /*!< USBD CEP_IRQ_ENB : DATA_RxED Position */
#define USBD_CEP_IRQ_ENB_DATA_RxED_Msk    (1ul << USBD_CEP_IRQ_ENB_DATA_RxED_Pos)    /*!< USBD CEP_IRQ_ENB : DATA_RxED Mask */

#define USBD_CEP_IRQ_ENB_DATA_TxED_Pos    5                                          /*!< USBD CEP_IRQ_ENB : DATA_TxED Position */
#define USBD_CEP_IRQ_ENB_DATA_TxED_Msk    (1ul << USBD_CEP_IRQ_ENB_DATA_TxED_Pos)    /*!< USBD CEP_IRQ_ENB : DATA_TxED Mask */

#define USBD_CEP_IRQ_ENB_PING_Pos         4                                          /*!< USBD CEP_IRQ_ENB : PING Position */
#define USBD_CEP_IRQ_ENB_PING_Msk         (1ul << USBD_CEP_IRQ_ENB_PING_Pos)         /*!< USBD CEP_IRQ_ENB : PING Mask */

#define USBD_CEP_IRQ_ENB_IN_TK_Pos        3                                          /*!< USBD CEP_IRQ_ENB : IN_TK Position */
#define USBD_CEP_IRQ_ENB_IN_TK_Msk        (1ul << USBD_CEP_IRQ_ENB_IN_TK_Pos)        /*!< USBD CEP_IRQ_ENB : IN_TK Mask */

#define USBD_CEP_IRQ_ENB_OUT_TK_Pos       2                                          /*!< USBD CEP_IRQ_ENB : OUT_TK Position */
#define USBD_CEP_IRQ_ENB_OUT_TK_Msk       (1ul << USBD_CEP_IRQ_ENB_OUT_TK_Pos)       /*!< USBD CEP_IRQ_ENB : OUT_TK Mask */

#define USBD_CEP_IRQ_ENB_SETUP_PK_Pos     1                                          /*!< USBD CEP_IRQ_ENB : SETUP_PK Position */
#define USBD_CEP_IRQ_ENB_SETUP_PK_Msk     (1ul << USBD_CEP_IRQ_ENB_SETUP_PK_Pos)     /*!< USBD CEP_IRQ_ENB : SETUP_PK Mask */

#define USBD_CEP_IRQ_ENB_SETUP_TK_Pos     0                                          /*!< USBD CEP_IRQ_ENB : SETUP_TK Position */
#define USBD_CEP_IRQ_ENB_SETUP_TK_Msk     (1ul << USBD_CEP_IRQ_ENB_SETUP_TK_Pos)     /*!< USBD CEP_IRQ_ENB : SETUP_TK Mask */

/* USBD CEP_IRQ_STAT Bit Field Definitions */
#define USBD_CEP_IRQ_STAT_EMPTY_Pos       12                                         /*!< USBD CEP_IRQ_STAT : EMPTY Position */
#define USBD_CEP_IRQ_STAT_EMPTY_Msk       (1ul << USBD_CEP_IRQ_STAT_EMPTY_Pos)       /*!< USBD CEP_IRQ_STAT : EMPTY Mask */

#define USBD_CEP_IRQ_STAT_FULL_Pos        11                                         /*!< USBD CEP_IRQ_STAT : FULL Position */
#define USBD_CEP_IRQ_STAT_FULL_Msk        (1ul << USBD_CEP_IRQ_STAT_FULL_Pos)        /*!< USBD CEP_IRQ_STAT : FULL Mask */

#define USBD_CEP_IRQ_STAT_STACOM_Pos      10                                         /*!< USBD CEP_IRQ_STAT : STACOM Position */
#define USBD_CEP_IRQ_STAT_STACOM_Msk      (1ul << USBD_CEP_IRQ_STAT_STACOM_Pos)      /*!< USBD CEP_IRQ_STAT : STACOM Mask */

