coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define USBD_CEP_IRQ_STAT_ERR_Pos         9                                          /*!< USBD CEP_IRQ_STAT : ERR Position */
#define USBD_CEP_IRQ_STAT_ERR_Msk         (1ul << USBD_CEP_IRQ_STAT_ERR_Pos)         /*!< USBD CEP_IRQ_STAT : ERR Mask */

#define USBD_CEP_IRQ_STAT_STALL_Pos       8                                          /*!< USBD CEP_IRQ_STAT : STALL Position */
#define USBD_CEP_IRQ_STAT_STALL_Msk       (1ul << USBD_CEP_IRQ_STAT_STALL_Pos)       /*!< USBD CEP_IRQ_STAT : STALL Mask */

#define USBD_CEP_IRQ_STAT_NAK_Pos         7                                          /*!< USBD CEP_IRQ_STAT : NAK Position */
#define USBD_CEP_IRQ_STAT_NAK_Msk         (1ul << USBD_CEP_IRQ_STAT_NAK_Pos)         /*!< USBD CEP_IRQ_STAT : NAK Mask */

#define USBD_CEP_IRQ_STAT_DATA_RxED_Pos   6                                          /*!< USBD CEP_IRQ_STAT : DATA_RxED Position */
#define USBD_CEP_IRQ_STAT_DATA_RxED_Msk   (1ul << USBD_CEP_IRQ_STAT_DATA_RxED_Pos)   /*!< USBD CEP_IRQ_STAT : DATA_RxED Mask */

#define USBD_CEP_IRQ_STAT_DATA_TxED_Pos   5                                          /*!< USBD CEP_IRQ_STAT : DATA_TxED Position */
#define USBD_CEP_IRQ_STAT_DATA_TxED_Msk   (1ul << USBD_CEP_IRQ_STAT_DATA_TxED_Pos)   /*!< USBD CEP_IRQ_STAT : DATA_TxED Mask */

#define USBD_CEP_IRQ_STAT_PING_Pos        4                                          /*!< USBD CEP_IRQ_STAT : PING Position */
#define USBD_CEP_IRQ_STAT_PING_Msk        (1ul << USBD_CEP_IRQ_STAT_PING_Pos)        /*!< USBD CEP_IRQ_STAT : PING Mask */

#define USBD_CEP_IRQ_STAT_IN_TK_Pos       3                                          /*!< USBD CEP_IRQ_STAT : IN_TK Position */
#define USBD_CEP_IRQ_STAT_IN_TK_Msk       (1ul << USBD_CEP_IRQ_STAT_IN_TK_Pos)       /*!< USBD CEP_IRQ_STAT : IN_TK Mask */

#define USBD_CEP_IRQ_STAT_OUT_TK_Pos      2                                          /*!< USBD CEP_IRQ_STAT : OUT_TK Position */
#define USBD_CEP_IRQ_STAT_OUT_TK_Msk      (1ul << USBD_CEP_IRQ_STAT_OUT_TK_Pos)      /*!< USBD CEP_IRQ_STAT : OUT_TK Mask */

#define USBD_CEP_IRQ_STAT_SETUP_PK_Pos    1                                          /*!< USBD CEP_IRQ_STAT : SETUP_PK Position */
#define USBD_CEP_IRQ_STAT_SETUP_PK_Msk    (1ul << USBD_CEP_IRQ_STAT_SETUP_PK_Pos)    /*!< USBD CEP_IRQ_STAT : SETUP_PK Mask */

#define USBD_CEP_IRQ_STAT_SETUP_TK_Pos    0                                          /*!< USBD CEP_IRQ_STAT : SETUP_TK Position */
#define USBD_CEP_IRQ_STAT_SETUP_TK_Msk    (1ul << USBD_CEP_IRQ_STAT_SETUP_TK_Pos)    /*!< USBD CEP_IRQ_ENB : SETUP_TK Mask */

/* USBD IN_TRF_CNT Bit Field Definitions */
#define USBD_IN_TRF_CNT_Pos               0                                          /*!< USBD IN_TRF_CNT : IN_TRF_CNT Position */
#define USBD_IN_TRF_CNT_Msk               (0XFFul << USBD_IN_TRF_CNT_Pos)            /*!< USBD IN_TRF_CNT : IN_TRF_CNT Mask */

/* USBD OUT_TRF_CNT Bit Field Definitions */
#define USBD_OUT_TRF_CNT_Pos              0                                          /*!< USBD OUT_TRF_CNT : OUT_TRF_CNT Position */
#define USBD_OUT_TRF_CNT_Msk              (0XFFFFul << USBD_OUT_TRF_CNT_Pos)         /*!< USBD OUT_TRF_CNT : OUT_TRF_CNT Mask */

/* USBD CEP_CNT Bit Field Definitions */
#define USBD_CEP_CNT_Pos                  0                                          /*!< USBD CEP_CNT : CEP_CNT Position */
#define USBD_CEP_CNT_Msk                  (0XFFFFul << USBD_CEP_CNT_Pos)             /*!< USBD CEP_CNT : CEP_CNT Mask */

/* USBD SETUP1_0 Bit Field Definitions */
#define USBD_SETUP1_0_SETUP1_Pos          8                                          /*!< USBD SETUP1_0 : SETUP1 Position */
#define USBD_SETUP1_0_SETUP1_Msk          (0XFFul << USBD_SETUP1_0_SETUP1_Pos)       /*!< USBD SETUP1_0 : SETUP1 Mask */

#define USBD_SETUP1_0_SETUP0_Pos          0                                          /*!< USBD SETUP1_0 : SETUP0 Position */
#define USBD_SETUP1_0_SETUP0_Msk          (0XFFul << USBD_SETUP1_0_SETUP0_Pos)       /*!< USBD SETUP1_0 : SETUP0 Mask */

/* USBD SETUP3_2 Bit Field Definitions */
#define USBD_SETUP3_2_SETUP3_Pos          8                                          /*!< USBD SETUP3_2 : SETUP3 Position */
#define USBD_SETUP3_2_SETUP3_Msk          (0XFFul << USBD_SETUP3_2_SETUP3_Pos)       /*!< USBD SETUP3_2 : SETUP3 Mask */

#define USBD_SETUP3_2_SETUP2_Pos          0                                          /*!< USBD SETUP3_2 : SETUP2 Position */
#define USBD_SETUP3_2_SETUP2_Msk          (0XFFul << USBD_SETUP3_2_SETUP2_Pos)       /*!< USBD SETUP3_2 : SETUP2 Mask */

/* USBD SETUP5_4 Bit Field Definitions */
#define USBD_SETUP5_4_SETUP5_Pos          8                                          /*!< USBD SETUP5_4 : SETUP5 Position */
#define USBD_SETUP5_4_SETUP5_Msk          (0XFFul << USBD_SETUP5_4_SETUP5_Pos)       /*!< USBD SETUP5_4 : SETUP5 Mask */

#define USBD_SETUP5_4_SETUP4_Pos          0                                          /*!< USBD SETUP5_4 : SETUP4 Position */
#define USBD_SETUP5_4_SETUP4_Msk          (0XFFul << USBD_SETUP5_4_SETUP4_Pos)       /*!< USBD SETUP5_4 : SETUP4 Mask */

/* USBD SETUP7_6 Bit Field Definitions */
#define USBD_SETUP7_6_SETUP7_Pos          8                                          /*!< USBD SETUP7_6 : SETUP7 Position */
#define USBD_SETUP7_6_SETUP7_Msk          (0XFFul << USBD_SETUP7_6_SETUP7_Pos)       /*!< USBD SETUP7_6 : SETUP7 Mask */

#define USBD_SETUP7_6_SETUP6_Pos          0                                          /*!< USBD SETUP7_6 : SETUP6 Position */
#define USBD_SETUP7_6_SETUP6_Msk          (0XFFul << USBD_SETUP7_6_SETUP6_Pos)       /*!< USBD SETUP7_6 : SETUP6 Mask */

/* USBD CEP_START_ADDR Bit Field Definitions */
#define USBD_CEP_START_ADDR_Pos           0                                          /*!< USBD CEP_START_ADDR : CEP_START_ADDR Position */
#define USBD_CEP_START_ADDR_Msk           (0X7FFul << USBD_CEP_START_ADDR_Pos)       /*!< USBD CEP_START_ADDR : CEP_START_ADDR Mask */

/* USBD CEP_END_ADDR Bit Field Definitions */
#define USBD_CEP_END_ADDR_Pos             0                                          /*!< USBD CEP_END_ADDR : CEP_END_ADDR Position */
#define USBD_CEP_END_ADDR_Msk             (0X7FFul << USBD_CEP_END_ADDR_Pos)         /*!< USBD CEP_END_ADDR : CEP_END_ADDR Mask */

/* USBD DMA_CTRL_STS Bit Field Definitions */
#define USBD_DMA_CTRL_STS_RST_DMA_Pos     7                                          /*!< USBD DMA_CTRL_STS : RST_DMA Position */
#define USBD_DMA_CTRL_STS_RST_DMA_Msk     (1ul << USBD_DMA_CTRL_STS_RST_DMA_Pos)     /*!< USBD DMA_CTRL_STS : RST_DMA Mask */

#define USBD_DMA_CTRL_STS_SCAT_GA_EN_Pos  6                                          /*!< USBD DMA_CTRL_STS : SCAT_GA_EN Position */
#define USBD_DMA_CTRL_STS_SCAT_GA_EN_Msk  (1ul << USBD_DMA_CTRL_STS_SCAT_GA_EN_Pos)  /*!< USBD DMA_CTRL_STS : SCAT_GA_EN Mask */

