coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define USBD_DMA_CTRL_STS_DMA_EN_Pos      5                                          /*!< USBD DMA_CTRL_STS : DMA_EN Position */
#define USBD_DMA_CTRL_STS_DMA_EN_Msk      (1ul << USBD_DMA_CTRL_STS_DMA_EN_Pos)      /*!< USBD DMA_CTRL_STS : DMA_EN Mask */

#define USBD_DMA_CTRL_STS_DMA_RD_Pos      4                                          /*!< USBD DMA_CTRL_STS : DMA_RD Position */
#define USBD_DMA_CTRL_STS_DMA_RD_Msk      (1ul << USBD_DMA_CTRL_STS_DMA_RD_Pos)      /*!< USBD DMA_CTRL_STS : DMA_RD Mask */

#define USBD_DMA_CTRL_STS_DMA_ADDR_Pos    0                                          /*!< USBD DMA_CTRL_STS : DMA_ADDR Position */
#define USBD_DMA_CTRL_STS_DMA_ADDR_Msk    (0xFul << USBD_DMA_CTRL_STS_DMA_ADDR_Pos)  /*!< USBD DMA_CTRL_STS : DMA_ADDR Mask */

/* USBD DMA_CNT Bit Field Definitions */
#define USBD_DMA_CNT_Pos                  0                                          /*!< USBD DMA_CNT : DMA_CNT Position */
#define USBD_DMA_CNT_Msk                  (0XFFFFFul << USBD_DMA_CNT_Pos)            /*!< USBD DMA_CNT : DMA_CNT Mask */

/* USBD EPx_DATA_BUF Bit Field Definitions */
#define USBD_EP_DATA_BUF_Pos              0                                          /*!< USBD EPx_DATA_BUF : EP_DATA_BUF Position */
#define USBD_EP_DATA_BUF_Msk              (0XFFFFFFFFul << USBD_EPx_DATA_BUF_Pos)    /*!< USBD EPx_DATA_BUF : EP_DATA_BUF Mask */

/* USBD EPx_IRQ_STAT Bit Field Definitions */
#define USBD_EP_IRQ_STAT_O_SHORT_PKT_Pos  12                                         /*!< USBD EPx_IRQ_STAT : O_SHORT_PKT Position */
#define USBD_EP_IRQ_STAT_O_SHORT_PKT_Msk  (1ul << USBD_EP_IRQ_STAT_O_SHORT_PKT_Pos)  /*!< USBD EPx_IRQ_STAT : O_SHORT_PKT Mask */

#define USBD_EP_IRQ_STAT_ERR_Pos          11                                         /*!< USBD EPx_IRQ_STAT : ERR Position */
#define USBD_EP_IRQ_STAT_ERR_Msk          (1ul << USBD_EP_IRQ_STAT_ERR_Pos)          /*!< USBD EPx_IRQ_STAT : ERR Mask */

#define USBD_EP_IRQ_STAT_NYET_Pos         10                                         /*!< USBD EPx_IRQ_STAT : NYET Position */
#define USBD_EP_IRQ_STAT_NYET_Msk         (1ul << USBD_EP_IRQ_STAT_NYET_Pos)         /*!< USBD EPx_IRQ_STAT : NYET Mask */

#define USBD_EP_IRQ_STAT_STALL_Pos        9                                          /*!< USBD EPx_IRQ_STAT : STALL Position */
#define USBD_EP_IRQ_STAT_STALL_Msk        (1ul << USBD_EP_IRQ_STAT_STALL_Pos)        /*!< USBD EPx_IRQ_STAT : STALL Mask */

#define USBD_EP_IRQ_STAT_NAK_Pos          8                                          /*!< USBD EPx_IRQ_STAT : NAK Position */
#define USBD_EP_IRQ_STAT_NAK_Msk          (1ul << USBD_EP_IRQ_STAT_NAK_Pos)          /*!< USBD EPx_IRQ_STAT : NAK Mask */

#define USBD_EP_IRQ_STAT_PING_Pos         7                                          /*!< USBD EPx_IRQ_STAT : PING Position */
#define USBD_EP_IRQ_STAT_PING_Msk         (1ul << USBD_EP_IRQ_STAT_PING_Pos)         /*!< USBD EPx_IRQ_STAT : PING Mask */

#define USBD_EP_IRQ_STAT_IN_TK_Pos        6                                          /*!< USBD EPx_IRQ_STAT : IN_TK Position */
#define USBD_EP_IRQ_STAT_IN_TK_Msk        (1ul << USBD_EP_IRQ_STAT_IN_TK_Pos)        /*!< USBD EPx_IRQ_STAT : IN_TK Mask */

#define USBD_EP_IRQ_STAT_OUT_TK_Pos       5                                          /*!< USBD EPx_IRQ_STAT : OUT_TK Position */
#define USBD_EP_IRQ_STAT_OUT_TK_Msk       (1ul << USBD_EP_IRQ_STAT_OUT_TK_Pos)       /*!< USBD EPx_IRQ_STAT : OUT_TK Mask */

#define USBD_EP_IRQ_STAT_DATA_RxED_Pos    4                                          /*!< USBD EPx_IRQ_STAT : DATA_RxED Position */
#define USBD_EP_IRQ_STAT_DATA_RxED_Msk    (1ul << USBD_EP_IRQ_STAT_DATA_RxED_Pos)    /*!< USBD EPx_IRQ_STAT : DATA_RxED Mask */

#define USBD_EP_IRQ_STAT_DATA_TxED_Pos    3                                          /*!< USBD EPx_IRQ_STAT : DATA_TxED Position */
#define USBD_EP_IRQ_STAT_DATA_TxED_Msk    (1ul << USBD_EP_IRQ_STAT_DATA_TxED_Pos)    /*!< USBD EPx_IRQ_STAT : DATA_TxED Mask */

#define USBD_EP_IRQ_STAT_SHORT_PKT_Pos    2                                          /*!< USBD EPx_IRQ_STAT : SHORT_PKT Position */
#define USBD_EP_IRQ_STAT_SHORT_PKT_Msk    (1ul << USBD_EP_IRQ_STAT_SHORT_PKT_Pos)    /*!< USBD EPx_IRQ_STAT : SHORT_PKT Mask */

#define USBD_EP_IRQ_STAT_EMPTY_Pos        1                                          /*!< USBD EPx_IRQ_STAT : EMPTY Position */
#define USBD_EP_IRQ_STAT_EMPTY_Msk        (1ul << USBD_EP_IRQ_STAT_EMPTY_Pos)        /*!< USBD EPx_IRQ_STAT : EMPTY Mask */

#define USBD_EP_IRQ_STAT_FULL_Pos         0                                          /*!< USBD EPx_IRQ_STAT : FULL Position */
#define USBD_EP_IRQ_STAT_FULL_Msk         (1ul << USBD_EP_IRQ_STAT_FULL_Pos)         /*!< USBD EPx_IRQ_STAT : FULL Mask */

/* USBD EPx_IRQ_ENB Bit Field Definitions */
#define USBD_EP_IRQ_ENB_O_SHORT_PKT_Pos   12                                         /*!< USBD EPx_IRQ_ENB : O_SHORT_PKT Position */
#define USBD_EP_IRQ_ENB_O_SHORT_PKT_Msk   (1ul << USBD_EP_IRQ_ENB_O_SHORT_PKT_Pos)   /*!< USBD EPx_IRQ_ENB : O_SHORT_PKT Mask */

#define USBD_EP_IRQ_ENB_ERR_Pos           11                                         /*!< USBD EPx_IRQ_ENB : ERR Position */
#define USBD_EP_IRQ_ENB_ERR_Msk           (1ul << USBD_EP_IRQ_ENB_ERR_Pos)           /*!< USBD EPx_IRQ_ENB : ERR Mask */

#define USBD_EP_IRQ_ENB_NYET_Pos          10                                         /*!< USBD EPx_IRQ_ENB : NYET Position */
#define USBD_EP_IRQ_ENB_NYET_Msk          (1ul << USBD_EP_IRQ_ENB_NYET_Pos)          /*!< USBD EPx_IRQ_ENB : NYET Mask */

#define USBD_EP_IRQ_ENB_STALL_Pos         9                                          /*!< USBD EPx_IRQ_ENB : STALL Position */
#define USBD_EP_IRQ_ENB_STALL_Msk         (1ul << USBD_EP_IRQ_ENB_STALL_Pos)         /*!< USBD EPx_IRQ_ENB : STALL Mask */

#define USBD_EP_IRQ_ENB_NAK_Pos           8                                          /*!< USBD EPx_IRQ_ENB : NAK Position */
#define USBD_EP_IRQ_ENB_NAK_Msk           (1ul << USBD_EP_IRQ_ENB_NAK_Pos)           /*!< USBD EPx_IRQ_ENB : NAK Mask */

