coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define USBD_EP_IRQ_ENB_PING_Pos          7                                          /*!< USBD EPx_IRQ_ENB : PING Position */
#define USBD_EP_IRQ_ENB_PING_Msk          (1ul << USBD_EP_IRQ_ENB_PING_Pos)          /*!< USBD EPx_IRQ_ENB : PING Mask */

#define USBD_EP_IRQ_ENB_IN_TK_Pos         6                                          /*!< USBD EPx_IRQ_ENB : IN_TK Position */
#define USBD_EP_IRQ_ENB_IN_TK_Msk         (1ul << USBD_EP_IRQ_ENB_IN_TK_Pos)         /*!< USBD EPx_IRQ_ENB : IN_TK Mask */

#define USBD_EP_IRQ_ENB_OUT_TK_Pos        5                                          /*!< USBD EPx_IRQ_ENB : OUT_TK Position */
#define USBD_EP_IRQ_ENB_OUT_TK_Msk        (1ul << USBD_EP_IRQ_ENB_OUT_TK_Pos)        /*!< USBD EPx_IRQ_ENB : OUT_TK Mask */

#define USBD_EP_IRQ_ENB_DATA_RxED_Pos     4                                          /*!< USBD EPx_IRQ_ENB : DATA_RxED Position */
#define USBD_EP_IRQ_ENB_DATA_RxED_Msk     (1ul << USBD_EP_IRQ_ENB_DATA_RxED_Pos)     /*!< USBD EPx_IRQ_ENB : DATA_RxED Mask */

#define USBD_EP_IRQ_ENB_DATA_TxED_Pos     3                                          /*!< USBD EPx_IRQ_ENB : DATA_TxED Position */
#define USBD_EP_IRQ_ENB_DATA_TxED_Msk     (1ul << USBD_EP_IRQ_ENB_DATA_TxED_Pos)     /*!< USBD EPx_IRQ_ENB : DATA_TxED Mask */

#define USBD_EP_IRQ_ENB_SHORT_PKT_Pos     2                                          /*!< USBD EPx_IRQ_ENB : SHORT_PKT Position */
#define USBD_EP_IRQ_ENB_SHORT_PKT_Msk     (1ul << USBD_EP_IRQ_ENB_SHORT_PKT_Pos)     /*!< USBD EPx_IRQ_ENB : SHORT_PKT Mask */

#define USBD_EP_IRQ_ENB_EMPTY_Pos         1                                          /*!< USBD EPx_IRQ_ENB : EMPTY Position */
#define USBD_EP_IRQ_ENB_EMPTY_Msk         (1ul << USBD_EP_IRQ_ENB_EMPTY_Pos)         /*!< USBD EPx_IRQ_ENB : EMPTY Mask */

#define USBD_EP_IRQ_ENB_FULL_Pos          0                                          /*!< USBD EPx_IRQ_ENB : FULL Position */
#define USBD_EP_IRQ_ENB_FULL_Msk          (1ul << USBD_EP_IRQ_ENB_FULL_Pos)          /*!< USBD EPx_IRQ_ENB : FULL Mask */

/* USBD EPx_DATA_CNT Bit Field Definitions */
#define USBD_EP_DATA_CNT_DMA_LOOP_Pos     16                                           /*!< USBD EPx_DATA_CNT : DMA_LOOP Position */
#define USBD_EP_DATA_CNT_DMA_LOOP_Msk     (0X7FFFul << USBD_EP_DATA_CNT_DMA_LOOP_Pos)  /*!< USBD EPx_DATA_CNT : DMA_LOOP Mask */

#define USBD_EP_DATA_CNT_DATA_CNT_Pos     0                                            /*!< USBD EPx_DATA_CNT : DATA_CNT Position */
#define USBD_EP_DATA_CNT_DATA_CNT_Msk     (0XFFFFul << USBD_EP_DATA_CNT_DATA_CNT_Pos)  /*!< USBD EPx_DATA_CNT : DATA_CNT Mask */

/* USBD EPx_RSP_SC Bit Field Definitions */
#define USBD_EP_RSP_SC_DIS_BUF_Pos        7                                          /*!< USBD EPx_RSP_SC : DIS_BUF Position */
#define USBD_EP_RSP_SC_DIS_BUF_Msk        (1ul << USBD_EP_RSP_SC_DIS_BUF_Pos)        /*!< USBD EPx_RSP_SC : DIS_BUF Mask */

#define USBD_EP_RSP_SC_PK_END_Pos         6                                          /*!< USBD EPx_RSP_SC : PK_END Position */
#define USBD_EP_RSP_SC_PK_END_Msk         (1ul << USBD_EP_RSP_SC_PK_END_Pos)         /*!< USBD EPx_RSP_SC : PK_END Mask */

#define USBD_EP_RSP_SC_ZEROLEN_Pos        5                                          /*!< USBD EPx_RSP_SC : ZEROLEN Position */
#define USBD_EP_RSP_SC_ZEROLEN_Msk        (1ul << USBD_EP_RSP_SC_ZEROLEN_Pos)        /*!< USBD EPx_RSP_SC : ZEROLEN Mask */

#define USBD_EP_RSP_SC_HALT_Pos           4                                          /*!< USBD EPx_RSP_SC : HALT Position */
#define USBD_EP_RSP_SC_HALT_Msk           (1ul << USBD_EP_RSP_SC_HALT_Pos)           /*!< USBD EPx_RSP_SC : HALT Mask */

#define USBD_EP_RSP_SC_TOGGLE_Pos         3                                          /*!< USBD EPx_RSP_SC : TOGGLE Position */
#define USBD_EP_RSP_SC_TOGGLE_Msk         (1ul << USBD_EP_RSP_SC_TOGGLE_Pos)         /*!< USBD EPx_RSP_SC : TOGGLE Mask */

#define USBD_EP_RSP_SC_MODE_Pos           1                                          /*!< USBD EPx_RSP_SC : MODE Position */
#define USBD_EP_RSP_SC_MODE_Msk           (3ul << USBD_EP_RSP_SC_MODE_Pos)           /*!< USBD EPx_RSP_SC : MODE Mask */

#define USBD_EP_RSP_SC_BUF_FLUSH_Pos      0                                          /*!< USBD EPx_RSP_SC : BUF_FLUSH Position */
#define USBD_EP_RSP_SC_BUF_FLUSH_Msk      (1ul << USBD_EP_RSP_SC_BUF_FLUSH_Pos)      /*!< USBD EPx_RSP_SC : BUF_FLUSH Mask */

/* USBD EPx_MPS Bit Field Definitions */
#define USBD_EP_MPS_Pos                   0                                          /*!< USBD EPx_MPS : MPS Position */
#define USBD_EP_MPS_Msk                   (0X7FFul << USBD_EP_MPS_Pos)               /*!< USBD EPx_MPS : MPS Mask */

/* USBD EPx_TRF_CNT Bit Field Definitions */
#define USBD_EP_TRF_CNT_Pos               0                                          /*!< USBD EPx_TRF_CNT : TRF_CNT Position */
#define USBD_EP_TRF_CNT_Msk               (0X7FFul << USBD_EP_TRF_CNT_Pos)           /*!< USBD EPx_TRF_CNT : TRF_CNT Mask */

/* USBD EPx_CFG Bit Field Definitions */
#define USBD_EP_CFG_EP_MULT_Pos           8                                          /*!< USBD EPx_CFG : EP_MULT Position */
#define USBD_EP_CFG_EP_MULT_Msk           (3ul << USBD_EP_CFG_EP_MULT_Pos)           /*!< USBD EPx_CFG : EP_MULT Mask */

#define USBD_EP_CFG_EP_NUM_Pos            4                                          /*!< USBD EPx_CFG : EP_NUM Position */
#define USBD_EP_CFG_EP_NUM_Msk            (0xFul << USBD_EP_CFG_EP_NUM_Pos)          /*!< USBD EPx_CFG : EP_NUM Mask */

#define USBD_EP_CFG_EP_DIR_Pos            3                                          /*!< USBD EPx_CFG : EP_DIR Position */
#define USBD_EP_CFG_EP_DIR_Msk            (1ul << USBD_EP_CFG_EP_DIR_Pos)            /*!< USBD EPx_CFG : EP_DIR Mask */

#define USBD_EP_CFG_EP_TYPE_Pos           1                                          /*!< USBD EPx_CFG : EP_TYPE Position */
#define USBD_EP_CFG_EP_TYPE_Msk           (3ul << USBD_EP_CFG_EP_TYPE_Pos)           /*!< USBD EPx_CFG : EP_TYPE Mask */

#define USBD_EP_CFG_EP_VALID_Pos          0                                          /*!< USBD EPx_CFG : EP_VALID Position */
#define USBD_EP_CFG_EP_VALID_Msk          (1ul << USBD_EP_CFG_EP_VALID_Pos)          /*!< USBD EPx_CFG : EP_VALID Mask */

