coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* USBD EPx_START_ADDR Bit Field Definitions */
#define USBD_EP_START_ADDR_Pos            0                                          /*!< USBD EPx_START_ADDR : START_ADDR Position */
#define USBD_EP_START_ADDR_Msk            (0X7FFul << USBD_EP_START_ADDR_Pos)        /*!< USBD EPx_START_ADDR : START_ADDR Mask */

/* USBD EPx_END_ADDR Bit Field Definitions */
#define USBD_EP_END_ADDR_Pos              0                                          /*!< USBD EPx_END_ADDR : END_ADDR Position */
#define USBD_EP_END_ADDR_Msk              (0X7FFul << USBD_EP_END_ADDR_Pos)          /*!< USBD EPx_END_ADDR : END_ADDR Mask */

/* USBD HEAD_WORDx Bit Field Definitions */
#define USBD_HEAD_WORD_Pos                0                                          /*!< USBD HEAD_WORDx : HEAD_WORDx Position */
#define USBD_HEAD_WORD_Msk                (0XFFFFFFFFul << USBD_HEAD_WORD_Pos)       /*!< USBD HEAD_WORDx : HEAD_WORDx Mask */

/* USBD EPx_HEAD_CNT Bit Field Definitions */
#define USBD_EP_HEAD_CNT_Pos              0                                          /*!< USBD EPx_HEAD_CNT : HEAD_CNT Position */
#define USBD_EP_HEAD_CNT_Msk              (0X7FFul << USBD_EP_HEAD_CNT_Pos)          /*!< USBD EPx_HEAD_CNT : HEAD_CNT Mask */

/* USBD AHB_DMA_ADDR Bit Field Definitions */
#define USBD_AHB_DMA_ADDR_Pos             0                                          /*!< USBD AHB_DMA_ADDR : AHB_DMA_ADDR Position */
#define USBD_AHB_DMA_ADDR_Msk             (0XFFFFFFFFul << USBD_AHB_DMA_ADDR_Pos)    /*!< USBD AHB_DMA_ADDR : AHB_DMA_ADDR Mask */

/* USBD PHY_CTL Bit Field Definitions */
#define USBD_PHY_CTL_VBUS_STATUS_Pos      31                                         /*!< USBD PHY_CTL : VBUS_STATUS Position */
#define USBD_PHY_CTL_VBUS_STATUS_Msk      (1ul << USBD_PHY_CTL_VBUS_STATUS_Pos)      /*!< USBD PHY_CTL : VBUS_STATUS Mask */

#define USBD_PHY_CTL_PHY_SUSPEND_Pos      9                                          /*!< USBD PHY_CTL : PHY_SUSPEND Position */
#define USBD_PHY_CTL_PHY_SUSPEND_Msk      (1ul << USBD_PHY_CTL_PHY_SUSPEND_Pos)      /*!< USBD PHY_CTL : PHY_SUSPEND Mask */

#define USBD_PHY_CTL_DP_PULLUP_Pos        8                                          /*!< USBD PHY_CTL : DP_PULLUP Position */
#define USBD_PHY_CTL_DP_PULLUP_Msk        (1ul << USBD_PHY_CTL_DP_PULLUP_Pos)        /*!< USBD PHY_CTL : DP_PULLUP Mask */

/*@}*/ /* end of group NUC400_USBD */


/*------------- USB OTG Control Register (OTG) -----------------------------*/
/** @addtogroup NUC400_OTG NUC400 USB OTG Control Register (OTG)
  @{
*/
typedef struct {
    __IO uint32_t CTL;                           /*!< Offset: 0x0000   OTG Control Register */
    __IO uint32_t PHYCTL;                        /*!< Offset: 0x0004   OTG Phy Control Register */
    __IO uint32_t IER;                           /*!< Offset: 0x0008   Interrupt Enable Register */
    __IO uint32_t ISR;                           /*!< Offset: 0x000C   Interrupt Status Register */
    __I  uint32_t STS;                           /*!< Offset: 0x0010   Status Register */

} OTG_T;

/* OTG CTL Bit Field Definitions */
#define OTG_CTL_WAKE_EN_Pos            8                                      /*!< OTG OTG_CTL : WK_EN Position */
#define OTG_CTL_WAKE_EN_Msk            (1ul << OTG_CTL_WAKE_EN_Pos)           /*!< OTG OTG_CTL : WK_EN Mask */

#define OTG_CTL_UDC_CLK_ON_Pos         7                                      /*!< OTG OTG_CTL : UDC_CLK_ON Position */
#define OTG_CTL_UDC_CLK_ON_Msk         (1ul << OTG_CTL_UDC_CLK_ON_Pos)        /*!< OTG OTG_CTL : UDC_CLK_ON Mask */

#define OTG_CTL_FORCE_A_IDLE_Pos       5                                      /*!< OTG OTG_CTL : FORCE_A_IDLE Position */
#define OTG_CTL_FORCE_A_IDLE_Msk       (1ul << OTG_CTL_FORCE_A_IDLE_Pos)      /*!< OTG OTG_CTL : FORCE_A_IDLE Mask */

#define OTG_CTL_OTG_ST_EN_Pos          4                                      /*!< OTG OTG_CTL : OTG_ST_EN Position */
#define OTG_CTL_OTG_ST_EN_Msk          (1ul << OTG_CTL_WAKE_EN_Pos)           /*!< OTG OTG_CTL : OTG_ST_EN Mask */

#define OTG_CTL_SRP_COMPLIANT_Pos      3                                      /*!< OTG OTG_CTL : SRP_COMPLIANT Position */
#define OTG_CTL_SRP_COMPLIANT_Msk      (1ul << OTG_CTL_SRP_COMPLIANT_Pos)     /*!< OTG OTG_CTL : SRP_COMPLIANT Mask */

#define OTG_CTL_B_HNP_ENREQ_Pos        2                                      /*!< OTG OTG_CTL : B_HNP_ENREQ Position */
#define OTG_CTL_B_HNP_ENREQ_Msk        (1ul << OTG_CTL_B_HNP_ENREQ_Pos)       /*!< OTG OTG_CTL : B_HNP_ENREQ Mask */

#define OTG_CTL_BUS_REQ_Pos            1                                      /*!< OTG OTG_CTL : BUS_REQ Position */
#define OTG_CTL_BUS_REQ_Msk            (1ul << OTG_CTL_BUS_REQ_Pos)           /*!< OTG OTG_CTL : BUS_REQ Mask */

#define OTG_CTL_VBUS_DROP_Pos          0                                      /*!< OTG OTG_CTL : VBUS_DROP Position */
#define OTG_CTL_VBUS_DROP_Msk          (1ul << OTG_CTL_VBUS_DROP_Pos)         /*!< OTG OTG_CTL : VBUS_DROP Mask */

/* OTG PHYCTL Bit Field Definitions */
#define OTG_PHYCTL_OTG_SUS_Pos         9                                      /*!< OTG OTG_PHYCTL : OTG_SUS Position */
#define OTG_PHYCTL_OTG_SUS_Msk         (1ul << OTG_PHYCTL_OTG_SUS_Pos)        /*!< OTG OTG_PHYCTL : OTG_SUS Mask */

#define OTG_PHYCTL_PHYCLK_S_Pos        8                                      /*!< OTG OTG_PHYCTL : PHYCLK_S Position */
#define OTG_PHYCTL_PHYCLK_S_Msk        (1ul << OTG_PHYCTL_PHYCLK_S_Pos)       /*!< OTG OTG_PHYCTL : PHYCLK_S Mask */

#define OTG_PHYCTL_ID_PU_EN_Pos        7                                      /*!< OTG OTG_PHYCTL : ID_PU_EN Position */
#define OTG_PHYCTL_ID_PU_EN_Msk        (1ul << OTG_PHYCTL_ID_PU_EN_Pos)       /*!< OTG OTG_PHYCTL : ID_PU_EN Mask */

#define OTG_PHYCTL_EN_VBUS_INV_Pos     6                                      /*!< OTG OTG_PHYCTL : EN_VBUS_INV Position */
#define OTG_PHYCTL_EN_VBUS_INV_Msk     (1ul << OTG_PHYCTL_EN_VBUS_INV_Pos)    /*!< OTG OTG_PHYCTL : EN_VBUS_INV Mask */

#define OTG_PHYCTL_BUS_VALID_INV_Pos   5                                      /*!< OTG OTG_PHYCTL : BUS_VALID_INV Position */
#define OTG_PHYCTL_BUS_VALID_INV_Msk   (1ul << OTG_PHYCTL_BUS_VALID_INV_Pos)  /*!< OTG OTG_PHYCTL : BUS_VALID_INV Mask */

#define OTG_PHYCTL_VBUS_VALID_SEL_Pos  3                                      /*!< OTG OTG_PHYCTL : VBUS_VALID_SEL Position */
#define OTG_PHYCTL_VBUS_VALID_SEL_Msk  (3ul << OTG_PHYCTL_VBUS_VALID_SEL_Pos) /*!< OTG OTG_PHYCTL : VBUS_VALID_SEL Mask */

#define OTG_PHYCTL_DMPD_EN_Pos         2                                      /*!< OTG OTG_PHYCTL : DMPD_EN Position */
#define OTG_PHYCTL_DMPD_EN_Msk         (1ul << OTG_PHYCTL_DMPD_EN_Pos)        /*!< OTG OTG_PHYCTL : DMPD_EN Mask */

