coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define OTG_PHYCTL_DPPD_EN_Pos         1                                      /*!< OTG OTG_PHYCTL : DPPD_EN Position */
#define OTG_PHYCTL_DPPD_EN_Msk         (1ul << OTG_PHYCTL_DPPD_EN_Pos)        /*!< OTG OTG_PHYCTL : DPPD_EN Mask */

#define OTG_PHYCTL_SPD_EN_Pos          0                                      /*!< OTG OTG_PHYCTL : SPD_EN Position */
#define OTG_PHYCTL_SPD_EN_Msk          (1ul << OTG_PHYCTL_SPD_EN_Pos)         /*!< OTG OTG_PHYCTL : SPD_EN Mask */

/* OTG IER Bit Field Definitions */
#define OTG_IER_SRP_DET_Pos            13                                     /*!< OTG OTG_IER : SRP_DET Position */
#define OTG_IER_SRP_DET_Msk            (1ul << OTG_IER_SRP_DET_Pos)           /*!< OTG OTG_IER : SRP_DET Mask */

#define OTG_IER_SRP_PWERR_IE_Pos       12                                     /*!< OTG OTG_IER : SRP_PWERR_IE Position */
#define OTG_IER_SRP_PWERR_IE_Msk       (1ul << OTG_IER_SRP_PWERR_IE_Pos)      /*!< OTG OTG_IER : SRP_PWERR_IE Mask */

#define OTG_IER_SESS_END_IE_Pos        11                                     /*!< OTG OTG_IER : SESS_END_IE Position */
#define OTG_IER_SESS_END_IE_Msk        (1ul << OTG_IER_SESS_END_IE_Pos)       /*!< OTG OTG_IER : SESS_END_IE Mask */

#define OTG_IER_VBUS_VALID_IE_Pos      10                                     /*!< OTG OTG_IER : VBUS_VALID_IE Position */
#define OTG_IER_VBUS_VALID_IE_Msk      (1ul << OTG_IER_VBUS_VALID_IE_Pos)     /*!< OTG OTG_IER : VBUS_VALID_IE Mask */

#define OTG_IER_A_VALID_IE_Pos         9                                      /*!< OTG OTG_IER : A_VALID_IE Position */
#define OTG_IER_A_VALID_IE_Msk         (1ul << OTG_IER_A_VALID_IE_Pos)        /*!< OTG OTG_IER : A_VALID_IE Mask */

#define OTG_IER_B_VALID_IE_Pos         8                                      /*!< OTG OTG_IER : B_VALID_IE Position */
#define OTG_IER_B_VALID_IE_Msk         (1ul << OTG_IER_B_VALID_IE_Pos)        /*!< OTG OTG_IER : B_VALID_IE Mask */

#define OTG_IER_ACT_AS_HOST_IE_Pos     7                                      /*!< OTG OTG_IER : ACT_AS_HOST_IE Position */
#define OTG_IER_ACT_AS_HOST_IE_Msk     (1ul << OTG_IER_ACT_AS_HOST_IE_Pos)    /*!< OTG OTG_IER : ACT_AS_HOST_IE Mask */

#define OTG_IER_ACT_AS_PERI_IE_Pos     6                                      /*!< OTG OTG_IER : ACT_AS_PERI_IE Position */
#define OTG_IER_ACT_AS_PERI_IE_Msk     (1ul << OTG_IER_ACT_AS_PERI_IE_Pos)    /*!< OTG OTG_IER : ACT_AS_PERI_IE Mask */

#define OTG_IER_IDDIG_IE_Pos           5                                      /*!< OTG OTG_IER : IDDIG_IE Position */
#define OTG_IER_IDDIG_IE_Msk           (1ul << OTG_IER_IDDIG_IE_Pos)          /*!< OTG OTG_IER : IDDIG_IE Mask */

#define OTG_IER_GO_IDLE_IE_Pos         4                                      /*!< OTG OTG_IER : GO_IDLE_IE Position */
#define OTG_IER_GO_IDLE_IE_Msk         (1ul << OTG_IER_GO_IDLE_IE_Pos)        /*!< OTG OTG_IER : GO_IDLE_IE Mask */

#define OTG_IER_HNP_FAIL_IE_Pos        3                                      /*!< OTG OTG_IER : HNP_FAIL_IE Position */
#define OTG_IER_HNP_FAIL_IE_Msk        (1ul << OTG_IER_HNP_FAIL_IE_Pos)       /*!< OTG OTG_IER : HNP_FAIL_IE Mask */

#define OTG_IER_SRP_FAIL_IE_Pos        2                                      /*!< OTG OTG_IER : SRP_FAIL_IE Position */
#define OTG_IER_SRP_FAIL_IE_Msk        (1ul << OTG_IER_SRP_FAIL_IE_Pos)       /*!< OTG OTG_IER : SRP_FAIL_IE Mask */

#define OTG_IER_VBUS_ERR_IE_Pos        1                                      /*!< OTG OTG_IER : VBUS_ERR_IE Position */
#define OTG_IER_VBUS_ERR_IE_Msk        (1ul << OTG_IER_VBUS_ERR_IE_Pos)       /*!< OTG OTG_IER : VBUS_ERR_IE Mask */

#define OTG_IER_ROLE_CHG_IE_Pos        0                                      /*!< OTG OTG_IER : ROLE_CHG_IE Position */
#define OTG_IER_ROLE_CHG_IE_Msk        (1ul << OTG_IER_ROLE_CHG_IE_Pos)       /*!< OTG OTG_IER : ROLE_CHG_IE Mask */

/* OTG ISR Bit Field Definitions */
#define OTG_ISR_SRP_DET_Pos            13                                     /*!< OTG OTG_ISR : SRP_DET Position */
#define OTG_ISR_SRP_DET_Msk            (1ul << OTG_ISR_SRP_DET_Pos)           /*!< OTG OTG_ISR : SRP_DET Mask */

#define OTG_ISR_SRP_PWERR_IS_Pos       12                                     /*!< OTG OTG_ISR : SRP_PWERR_IS Position */
#define OTG_ISR_SRP_PWERR_IS_Msk       (1ul << OTG_ISR_SRP_PWERR_IS_Pos)      /*!< OTG OTG_ISR : SRP_PWERR_IS Mask */

#define OTG_ISR_SESS_END_IS_Pos        11                                     /*!< OTG OTG_ISR : SESS_END_IS Position */
#define OTG_ISR_SESS_END_IS_Msk        (1ul << OTG_ISR_SESS_END_IS_Pos)       /*!< OTG OTG_ISR : SESS_END_IS Mask */

#define OTG_ISR_VBUS_VALID_IS_Pos      10                                     /*!< OTG OTG_ISR : VBUS_VALID_IS Position */
#define OTG_ISR_VBUS_VALID_IS_Msk      (1ul << OTG_ISR_VBUS_VALID_IS_Pos)     /*!< OTG OTG_ISR : VBUS_VALID_IS Mask */

#define OTG_ISR_A_VALID_IS_Pos         9                                      /*!< OTG OTG_ISR : A_VALID_IS Position */
#define OTG_ISR_A_VALID_IS_Msk         (1ul << OTG_ISR_A_VALID_IS_Pos)        /*!< OTG OTG_ISR : A_VALID_IS Mask */

#define OTG_ISR_B_VALID_IS_Pos         8                                      /*!< OTG OTG_ISR : B_VALID_IS Position */
#define OTG_ISR_B_VALID_IS_Msk         (1ul << OTG_ISR_B_VALID_IS_Pos)        /*!< OTG OTG_ISR : B_VALID_IS Mask */

#define OTG_ISR_ACT_AS_HOST_IS_Pos     7                                      /*!< OTG OTG_ISR : ACT_AS_HOST_IS Position */
#define OTG_ISR_ACT_AS_HOST_IS_Msk     (1ul << OTG_ISR_ACT_AS_HOST_IS_Pos)    /*!< OTG OTG_ISR : ACT_AS_HOST_IS Mask */

#define OTG_ISR_ACT_AS_PERI_IS_Pos     6                                      /*!< OTG OTG_ISR : ACT_AS_PERI_IS Position */
#define OTG_ISR_ACT_AS_PERI_IS_Msk     (1ul << OTG_ISR_ACT_AS_PERI_IS_Pos)    /*!< OTG OTG_ISR : ACT_AS_PERI_IS Mask */

#define OTG_ISR_IDDIG_IS_Pos           5                                      /*!< OTG OTG_ISR : IDDIG_IS Position */
#define OTG_ISR_IDDIG_IS_Msk           (1ul << OTG_ISR_IDDIG_IS_Pos)          /*!< OTG OTG_ISR : IDDIG_IS Mask */

#define OTG_ISR_GO_IDLE_IS_Pos         4                                      /*!< OTG OTG_ISR : GO_IDLE_IS Position */
#define OTG_ISR_GO_IDLE_IS_Msk         (1ul << OTG_ISR_GO_IDLE_IS_Pos)        /*!< OTG OTG_ISR : GO_IDLE_IS Mask */

#define OTG_ISR_HNP_FAIL_IS_Pos        3                                      /*!< OTG OTG_ISR : HNP_FAIL_IS Position */
#define OTG_ISR_HNP_FAIL_IS_Msk        (1ul << OTG_ISR_HNP_FAIL_IS_Pos)       /*!< OTG OTG_ISR : HNP_FAIL_IS Mask */

