coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define OTG_ISR_SRP_FAIL_IS_Pos        2                                      /*!< OTG OTG_ISR : SRP_FAIL_IS Position */
#define OTG_ISR_SRP_FAIL_IS_Msk        (1ul << OTG_ISR_SRP_FAIL_IS_Pos)       /*!< OTG OTG_ISR : SRP_FAIL_IS Mask */

#define OTG_ISR_VBUS_ERR_IS_Pos        1                                      /*!< OTG OTG_ISR : VBUS_ERR_IS Position */
#define OTG_ISR_VBUS_ERR_IS_Msk        (1ul << OTG_ISR_VBUS_ERR_IS_Pos)       /*!< OTG OTG_ISR : VBUS_ERR_IS Mask */

#define OTG_ISR_ROLE_CHG_IS_Pos        0                                      /*!< OTG OTG_ISR : ROLE_CHG_IS Position */
#define OTG_ISR_ROLE_CHG_IS_Msk        (1ul << OTG_ISR_ROLE_CHG_IS_Pos)       /*!< OTG OTG_ISR : ROLE_CHG_IS Mask */

/* OTG STS Bit Field Definitions */
#define OTG_STS_VBUS_VALID_Pos         5                                      /*!< OTG OTG_STS : VBUS_VALID Position */
#define OTG_STS_VBUS_VALID_Msk         (1ul << OTG_STS_VBUS_VALID_Pos)        /*!< OTG OTG_STS : VBUS_VALID Mask */

#define OTG_STS_B_VALID_Pos            4                                      /*!< OTG OTG_STS : B_VALID Position */
#define OTG_STS_B_VALID_Msk            (1ul << OTG_STS_B_VALID_Pos)           /*!< OTG OTG_STS : B_VALID Mask */

#define OTG_STS_A_VALID_Pos            3                                      /*!< OTG OTG_STS : A_VALID Position */
#define OTG_STS_A_VALID_Msk            (1ul << OTG_STS_A_VALID_Pos)           /*!< OTG OTG_STS : A_VALID Mask */

#define OTG_STS_SESS_END_Pos           2                                      /*!< OTG OTG_STS : SESS_END Position */
#define OTG_STS_SESS_END_Msk           (1ul << OTG_STS_SESS_END_Pos)          /*!< OTG OTG_STS : SESS_END Mask */

#define OTG_STS_IDDIG_Pos              1                                      /*!< OTG OTG_STS : IDDIG Position */
#define OTG_STS_IDDIG_Msk              (1ul << OTG_STS_IDDIG_Pos)             /*!< OTG OTG_STS : IDDIG Mask */

#define OTG_STS_VRISE_FAIL_Pos         0                                      /*!< OTG OTG_STS : VRISE_FAIL Position */
#define OTG_STS_VRISE_FAIL_Msk         (1ul << OTG_STS_VRISE_FAIL_Pos)        /*!< OTG OTG_STS : VRISE_FAIL Mask */


/*@}*/ /* end of group NUC400_OTG */


/*------------- Timer Control Register (TIMER) -----------------------------*/
/** @addtogroup NUC400_TIMER NUC400 TIMER Control Register (TIMER)
  @{
*/
/**
  * @brief Timer register map
  */
typedef struct {
    __IO uint32_t TCSR;                     /*!< Offset: 0x0000   Timer Control and Status Register                 */
    __IO uint32_t TCMPR;                    /*!< Offset: 0x0004   Timer Compare Register                            */
    __IO uint32_t TISR;                     /*!< Offset: 0x0008   Timer Interrupt Status Register                   */
    __I  uint32_t TDR;                      /*!< Offset: 0x000C   Timer Data Register                               */
    __I  uint32_t TCAP;                     /*!< Offset: 0x0010   Timer Capture Data Register                       */
    __IO uint32_t TEXCON;                   /*!< Offset: 0x0014   Timer External Control Register                   */
    __IO uint32_t TEXISR;                   /*!< Offset: 0x0018   Timer External Interrupt Status Register          */
} TIMER_T;

/* TIMER TCSR Bit Field Definitions */
#define TIMER_TCSR_DBGACK_TMR_Pos   31                                            /*!< TIMER TCSR: DBGACK_TMR Position */
#define TIMER_TCSR_DBGACK_TMR_Msk   (1ul << TIMER_TCSR_DBGACK_TMR_Pos)            /*!< TIMER TCSR: DBGACK_TMR Mask     */

#define TIMER_TCSR_CEN_Pos          30                                            /*!< TIMER TCSR: CEN Position */
#define TIMER_TCSR_CEN_Msk          (1ul << TIMER_TCSR_CEN_Pos)                   /*!< TIMER TCSR: CEN Mask     */

#define TIMER_TCSR_IE_Pos           29                                            /*!< TIMER TCSR: IE Position */
#define TIMER_TCSR_IE_Msk           (1ul << TIMER_TCSR_IE_Pos)                    /*!< TIMER TCSR: IE Mask     */

#define TIMER_TCSR_MODE_Pos         27                                            /*!< TIMER TCSR: MODE Position */
#define TIMER_TCSR_MODE_Msk         (0x3ul << TIMER_TCSR_MODE_Pos)                /*!< TIMER TCSR: MODE Mask     */

#define TIMER_TCSR_CRST_Pos         26                                            /*!< TIMER TCSR: CRST Position */
#define TIMER_TCSR_CRST_Msk         (1ul << TIMER_TCSR_CRST_Pos)                  /*!< TIMER TCSR: CRST Mask     */

#define TIMER_TCSR_CACT_Pos         25                                            /*!< TIMER TCSR: CACT Position */
#define TIMER_TCSR_CACT_Msk         (1ul << TIMER_TCSR_CACT_Pos)                  /*!< TIMER TCSR: CACT Mask     */

#define TIMER_TCSR_CTB_Pos          24                                            /*!< TIMER TCSR: CTB Position */
#define TIMER_TCSR_CTB_Msk          (1ul << TIMER_TCSR_CTB_Pos)                   /*!< TIMER TCSR: CTB Mask     */

#define TIMER_TCSR_WAKE_EN_Pos      23                                            /*!< TIMER TCSR: WAKE_EN Position */
#define TIMER_TCSR_WAKE_EN_Msk      (1ul << TIMER_TCSR_WAKE_EN_Pos)               /*!< TIMER TCSR: WAKE_EN Mask     */

#define TIMER_TCSR_OFFTOUT_2_Pos    22                                            /*!< TIMER TCSR: OFFTOUT_2 Position */
#define TIMER_TCSR_OFFTOUT_2_Msk    (1ul << TIMER_TCSR_OFFTOUT_2_Pos)             /*!< TIMER TCSR: OFFTOUT_2 Mask     */

#define TIMER_TCSR_OFFTOUT_1_Pos    21                                            /*!< TIMER TCSR: OFFTOUT_1 Position */
#define TIMER_TCSR_OFFTOUT_1_Msk    (1ul << TIMER_TCSR_OFFTOUT_1_Pos)             /*!< TIMER TCSR: OFFTOUT_1 Mask     */

#define TIMER_TCSR_TDR_EN_Pos       16                                            /*!< TIMER TCSR: TDR_EN Position */
#define TIMER_TCSR_TDR_EN_Msk       (1ul << TIMER_TCSR_TDR_EN_Pos)                /*!< TIMER TCSR: TDR_EN Mask     */

#define TIMER_TCSR_PRESCALE_Pos     0                                             /*!< TIMER TCSR: PRESCALE Position */
#define TIMER_TCSR_PRESCALE_Msk     (0xFFul << TIMER_TCSR_PRESCALE_Pos)           /*!< TIMER TCSR: PRESCALE Mask     */

/* TIMER TCMPR Bit Field Definitions */
#define TIMER_TCMP_TCMP_Pos         0                                             /*!< TIMER TCMPR: TCMP Position */
#define TIMER_TCMP_TCMP_Msk         (0xFFFFFFul << TIMER_TCMP_TCMP_Pos)           /*!< TIMER TCMPR: TCMP Mask     */

/* TIMER TISR Bit Field Definitions */
#define TIMER_TISR_TWF_Pos          1                                            /*!< TIMER TISR: TWF Position */
#define TIMER_TISR_TWF_Msk          (1ul << TIMER_TISR_TWF_Pos)                  /*!< TIMER TISR: TWF Mask     */

#define TIMER_TISR_TIF_Pos          0                                            /*!< TIMER TISR: TIF Position */
#define TIMER_TISR_TIF_Msk          (1ul << TIMER_TISR_TIF_Pos)                  /*!< TIMER TISR: TIF Mask     */

/* TIMER TDR Bit Field Definitions */
#define TIMER_TDR_TDR_Pos           0                                            /*!< TIMER TDR: TDR Position */
#define TIMER_TDR_TDR_Msk           (0xFFFFFFul << TIMER_TDR_TDR_Pos)            /*!< TIMER TDR: TDR Mask     */

/* TIMER TCAP Bit Field Definitions */
#define TIMER_TCAP_TCAP_Pos         0                                            /*!< TIMER TCAP: TCAP Position */
#define TIMER_TCAP_TCAP_Msk         (0xFFFFFFul << TIMER_TCAP_TCAP_Pos)          /*!< TIMER TCAP: TCAP Mask     */

