coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* TIMER TEXCON Bit Field Definitions */
#define TIMER_TEXCON_TCDB_Pos       7                                            /*!< TIMER TEXCON: TCDB Position */
#define TIMER_TEXCON_TCDB_Msk       (1ul << TIMER_TEXCON_TCDB_Pos)               /*!< TIMER TEXCON: TCDB Mask     */

#define TIMER_TEXCON_TEXDB_Pos      6                                            /*!< TIMER TEXCON: TEXDB Position */
#define TIMER_TEXCON_TEXDB_Msk      (1ul << TIMER_TEXCON_TEXDB_Pos)              /*!< TIMER TEXCON: TEXDB Mask     */

#define TIMER_TEXCON_TEXIEN_Pos     5                                            /*!< TIMER TEXCON: TEXIEN Position */
#define TIMER_TEXCON_TEXIEN_Msk     (1ul << TIMER_TEXCON_TEXIEN_Pos)             /*!< TIMER TEXCON: TEXIEN Mask     */

#define TIMER_TEXCON_RSTCAPSEL_Pos  4                                            /*!< TIMER TEXCON: RSTCAPSEL Position */
#define TIMER_TEXCON_RSTCAPSEL_Msk  (1ul << TIMER_TEXCON_RSTCAPSEL_Pos)          /*!< TIMER TEXCON: RSTCAPSEL Mask     */

#define TIMER_TEXCON_TEXEN_Pos      3                                            /*!< TIMER TEXCON: TEXEN Position */
#define TIMER_TEXCON_TEXEN_Msk      (1ul << TIMER_TEXCON_TEXEN_Pos)              /*!< TIMER TEXCON: TEXEN Mask     */

#define TIMER_TEXCON_TEX_EDGE_Pos   1                                            /*!< TIMER TEXCON: TEX_EDGE Position */
#define TIMER_TEXCON_TEX_EDGE_Msk   (0x3ul << TIMER_TEXCON_TEX_EDGE_Pos)         /*!< TIMER TEXCON: TEX_EDGE Mask     */

#define TIMER_TEXCON_TX_PHASE_Pos   0                                            /*!< TIMER TEXCON: TX_PHASE Position */
#define TIMER_TEXCON_TX_PHASE_Msk   (1ul << TIMER_TEXCON_TX_PHASE_Pos)           /*!< TIMER TEXCON: TX_PHASE Mask     */

/* TIMER TEXISR Bit Field Definitions */
#define TIMER_TEXISR_TEXIF_Pos      0                                            /*!< TIMER TEXISR: TEXIF Position */
#define TIMER_TEXISR_TEXIF_Msk      (1ul << TIMER_TEXISR_TEXIF_Pos)              /*!< TIMER TEXISR: TEXIF Mask     */
/*@}*/ /* end of group NUC400_TIMER */

/*----------------------------- PWM Controller ----------------------------*/
/** @addtogroup NUC400_PWM NUC400 PWM Control Register (PWM)
  @{
*/
typedef struct {
    __IO uint32_t CPR;     /*!< Offset: 0x0000   PWM Clock Prescale Register    */
    __IO uint32_t CDR;     /*!< Offset: 0x0004   PWM Clock Divide Register    */
    __IO uint32_t CONR;    /*!< Offset: 0x0008   PWM Control Register    */
    __IO uint32_t CER;     /*!< Offset: 0x000C   PWM Counter Enable Control Register    */
    __IO uint32_t CNR0;    /*!< Offset: 0x0010   PWM Counter Register 0    */
    __IO uint32_t CNR1;    /*!< Offset: 0x0014   PWM Counter Register 1    */
    __IO uint32_t CNR2;    /*!< Offset: 0x0018   PWM Counter Register 2    */
    __IO uint32_t CNR3;    /*!< Offset: 0x001C   PWM Counter Register 3    */
    __IO uint32_t CNR4;    /*!< Offset: 0x0020   PWM Counter Register 4    */
    __IO uint32_t CNR5;    /*!< Offset: 0x0024   PWM Counter Register 5    */
    __IO uint32_t CMR0;    /*!< Offset: 0x0028   PWM Comparator Register 0    */
    __IO uint32_t CMR1;    /*!< Offset: 0x002C   PWM Comparator Register 1    */
    __IO uint32_t CMR2;    /*!< Offset: 0x0030   PWM Comparator Register 2    */
    __IO uint32_t CMR3;    /*!< Offset: 0x0034   PWM Comparator Register 3    */
    __IO uint32_t CMR4;    /*!< Offset: 0x0038   PWM Comparator Register 4    */
    __IO uint32_t CMR5;    /*!< Offset: 0x003C   PWM Comparator Register 5    */
    __IO uint32_t DR0;     /*!< Offset: 0x0040   PWM Data Register 0    */
    __IO uint32_t DR1;     /*!< Offset: 0x0044   PWM Data Register 1    */
    __IO uint32_t DR2;     /*!< Offset: 0x0048   PWM Data Register 2    */
    __IO uint32_t DR3;     /*!< Offset: 0x004C   PWM Data Register 3    */
    __IO uint32_t DR4;     /*!< Offset: 0x0050   PWM Data Register 4    */
    __IO uint32_t DR5;     /*!< Offset: 0x0054   PWM Data Register 5    */
    __IO uint32_t MCR;     /*!< Offset: 0x0058   PWM Mask Control Register */
    __IO uint32_t MDR;     /*!< Offset: 0x005C   PWM Mask Data Register    */
    __IO uint32_t DZCR;    /*!< Offset: 0x0060   PWM Dead-zone Control Register  */
    __IO uint32_t TCR;     /*!< Offset: 0x0064   PWM Trigger Control Register    */
    __IO uint32_t TIR;     /*!< Offset: 0x0068   PWM Trigger Indication Register */
    __IO uint32_t BCR;     /*!< Offset: 0x006C   PWM Brake Control Register      */
    __IO uint32_t ICR;     /*!< Offset: 0x0070   PWM Interrupt Control Register  */
    __IO uint32_t IER;     /*!< Offset: 0x0074   PWM Interrupt Enable Register   */
    __IO uint32_t IFR;     /*!< Offset: 0x0078   PWM Interrupt Flag Register     */
    __IO uint32_t OER;     /*!< Offset: 0x007C   PWM Output Enable Register      */
    __IO uint32_t CCR;     /*!< Offset: 0x0080   PWM Capture Control Register    */
    __IO uint32_t CINER;   /*!< Offset: 0x0084   PWM Capture Input Enable Register */
    __IO uint32_t CAPSR;   /*!< Offset: 0x0088   PWM Capture Status Register     */
    uint32_t RESERVED0;
    __IO uint32_t CRLR0;   /*!< Offset: 0x0090   PWM Capture Rising Latch Register (channel 0)  */
    __IO uint32_t CFLR0;   /*!< Offset: 0x0094   PWM Capture Falling Latch Register (channel 0) */
    __IO uint32_t CRLR1;   /*!< Offset: 0x0098   PWM Capture Rising Latch Register (channel 1)  */
    __IO uint32_t CFLR1;   /*!< Offset: 0x009C   PWM Capture Falling Latch Register (channel 1) */
    __IO uint32_t CRLR2;   /*!< Offset: 0x00A0   PWM Capture Rising Latch Register (channel 2)  */
    __IO uint32_t CFLR2;   /*!< Offset: 0x00A4   PWM Capture Falling Latch Register (channel 2) */
    __IO uint32_t CRLR3;   /*!< Offset: 0x00A8   PWM Capture Rising Latch Register (channel 3)  */
    __IO uint32_t CFLR3;   /*!< Offset: 0x00AC   PWM Capture Falling Latch Register (channel 3) */
    __IO uint32_t CRLR4;   /*!< Offset: 0x00B0   PWM Capture Rising Latch Register (channel 4)  */
    __IO uint32_t CFLR4;   /*!< Offset: 0x00B4   PWM Capture Falling Latch Register (channel 4) */
    __IO uint32_t CRLR5;   /*!< Offset: 0x00B8   PWM Capture Rising Latch Register (channel 5)  */
    __IO uint32_t CFLR5;   /*!< Offset: 0x00BC   PWM Capture Falling Latch Register (channel 5) */
    uint32_t RESERVED1[8];
    __IO uint32_t SBS0;    /*!< Offset: 0x00E0   PWM Synchronous Busy Status Register */
    __IO uint32_t SBS1;    /*!< Offset: 0x00E4   PWM Synchronous Busy Status Register */
    __IO uint32_t SBS2;    /*!< Offset: 0x00E8   PWM Synchronous Busy Status Register */
    __IO uint32_t SBS3;    /*!< Offset: 0x00EC   PWM Synchronous Busy Status Register */
    __IO uint32_t SBS4;    /*!< Offset: 0x00F0   PWM Synchronous Busy Status Register */
    __IO uint32_t SBS5;    /*!< Offset: 0x00F4   PWM Synchronous Busy Status Register */
    __IO uint32_t VER_NUM;
} PWM_T;


