coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* PWM_CPR Bit Field Definitions */
#define PWM_CPR_CBP01_Pos       0                                     /*!< PWM CPR: PWM Counter Base-clock Pre-scale for PWM Pair of Channel 0 and Channel 1 */
#define PWM_CPR_CBP01_Msk       (0xFFul << PWM_CPR_CBP01_Pos)         /*!< PWM CPR: CPR01 Mask */
#define PWM_CPR_CBP23_Pos       8                                     /*!< PWM CPR: PWM Counter Base-clock Pre-scale for PWM Pair of Channel 2 and Channel 3 */
#define PWM_CPR_CBP23_Msk       (0xFFul << PWM_CPR_CBP23_Pos)         /*!< PWM CPR: CPR23 Mask */
#define PWM_CPR_CBP45_Pos       16                                    /*!< PWM CPR: PWM Counter Base-clock Pre-scale for PWM Pair of Channel 4 and Channel 5 */
#define PWM_CPR_CBP45_Msk       (0xFFul << PWM_CPR_CBP45_Pos)        /*!< PWM CPR: CPR45 Mask */

/* PWM_CDR Bit Field Definitions */
#define PWM_CDR_CBD0_Pos        0                                     /*!< PWM CDR: PWM Counter Base-clock Divide for PWM0 */
#define PWM_CDR_CBD0_Msk        (0x7ul << PWM_CDR_CBD0_Pos)           /*!< PWM CDR: CBD0 Mask */
#define PWM_CDR_CBD1_Pos        4                                     /*!< PWM CDR: PWM Counter Base-clock Divide for PWM1 */
#define PWM_CDR_CBD1_Msk        (0x7ul << PWM_CDR_CBD1_Pos)           /*!< PWM CDR: CBD1 Mask */
#define PWM_CDR_CBD2_Pos        8                                     /*!< PWM CDR: PWM Counter Base-clock Divide for PWM2 */
#define PWM_CDR_CBD2_Msk        (0x7ul << PWM_CDR_CBD2_Pos)           /*!< PWM CDR: CBD2 Mask */
#define PWM_CDR_CBD3_Pos        12                                    /*!< PWM CDR: PWM Counter Base-clock Divide for PWM3 */
#define PWM_CDR_CBD3_Msk        (0x7ul << PWM_CDR_CBD2_Pos)           /*!< PWM CDR: CBD3 Mask */
#define PWM_CDR_CBD4_Pos        16                                    /*!< PWM CDR: PWM Counter Base-clock Divide for PWM4 */
#define PWM_CDR_CBD4_Msk        (0x7ul << PWM_CDR_CBD2_Pos)           /*!< PWM CDR: CBD4 Mask */
#define PWM_CDR_CBD5_Pos        20                                    /*!< PWM CDR: PWM Counter Base-clock Divide for PWM5 */
#define PWM_CDR_CBD5_Msk        (0x7ul << PWM_CDR_CBD2_Pos)           /*!< PWM CDR: CBD5 Mask */

/* PWM_CONR Bit Field Definitions */
#define PWM_CONR_CMPINV_Pos     0                                     /*!< PWM CONR: PWM Comparator Output Inverter Enable */
#define PWM_CONR_CMPINV_Msk     (0x3Ful << PWM_CONR_CMPINV_Pos)       /*!< PWM CONR: CMPINV Mask */
#define PWM_CONR_OUTMD_Pos      6                                     /*!< PWM CONR: PWM Output Mode */
#define PWM_CONR_OUTMD_Msk      (0x1ul << PWM_CONR_OUTMD_Pos)         /*!< PWM CONR: OUTMD Mask */
#define PWM_CONR_GRP_EN_Pos     7                                     /*!< PWM CONR: Group Mode Enable */
#define PWM_CONR_GRP_EN_Msk     (0x1ul << PWM_CONR_GRP_EN_Pos)        /*!< PWM CONR: GRP_EN Mask */
#define PWM_CONR_PINV_Pos       8                                     /*!< PWM CONR: PWM Output Polar Inverse Enable */
#define PWM_CONR_PINV_Msk       (0x3Ful << PWM_CONR_PINV_Pos)         /*!< PWM CONR: PINV Mask */
#define PWM_CONR_SYNC_EN_Pos    15                                    /*!< PWM CONR: Synchronous Mode Enable */
#define PWM_CONR_SYNC_EN_Msk    (0x1ul << PWM_CONR_SYNC_EN_Pos)       /*!< PWM CONR: SYNC_EN Mask */
#define PWM_CONR_CNTMODE_Pos    16                                    /*!< PWM CONR: PWM Counter Operation Mode */
#define PWM_CONR_CNTMODE_Msk    (0x3Ful << PWM_CONR_CNTMODE_Pos)      /*!< PWM CONR: CNTMODE Mask */
#define PWM_CONR_CNTTYPE_Pos    24                                    /*!< PWM CONR: PWM Counter Operation Aligned Type */
#define PWM_CONR_CNTTYPE_Msk    (0x3Ful << PWM_CONR_CNTTYPE_Pos)      /*!< PWM CONR: CNTTYPE Mask */
#define PWM_CONR_SELFTEST_Pos 30                                    /*!< PWM CONR: Self Test Enable  */
#define PWM_CONR_SELFTEST_Msk (0x1ul << PWM_CONR_SELFTEST_Pos)    /*!< PWM CONR: SelfTest Mask */
#define PWM_CONR_DBGACK_PWM_Pos 31                                    /*!< PWM CONR: ICE debug mode acknowledge Disable  */
#define PWM_CONR_DBGACK_PWM_Msk (0x1ul << PWM_CONR_DBGACK_PWM_Pos)    /*!< PWM CONR: DBGACK_PWM Mask */

/* PWM_DZCR Bit Field Definitions */
#define PWM_DZCR_DZI01_Pos      0                                     /*!< PWM CONR: Dead-zone Interval for PWM Pair of Channel 0 and Channel 1 */
#define PWM_DZCR_DZI01_Msk      (0xFFul << PWM_DZCR_DZI01_Pos)        /*!< PWM CONR: DZI01 Mask */
#define PWM_DZCR_DZI23_Pos      8                                     /*!< PWM CONR: Dead-zone Interval for PWM Pair of Channel 2 and Channel 3 */
#define PWM_DZCR_DZI23_Msk      (0xFFul << PWM_DZCR_DZI23_Pos)        /*!< PWM CONR: DZI23 Mask */
#define PWM_DZCR_DZI45_Pos      16                                    /*!< PWM CONR: Dead-zone Interval for PWM Pair of Channel 4 and Channel 5 */
#define PWM_DZCR_DZI45_Msk      (0xFFul << PWM_DZCR_DZI45_Pos)        /*!< PWM CONR: DZI45 Mask */
#define PWM_DZCR_ZDDIV_Pos      24                                    /*!< Dead-zone Generator Divider */
#define PWM_DZCR_ZDDIV_Msk      (0x3ul << PWM_DZCR_ZDDIV_Pos)         /*!< PWM CONR: ZDDIV Mask */
#define PWM_DZCR_DZEN01_Pos     28                                    /*!< Dead-zone Enable for PWM Pair of Channel 0 and Channel 1 */
#define PWM_DZCR_DZEN01_Msk     (0x1ul << PWM_DZCR_DZEN01_Pos)        /*!< PWM CONR: DZEN01 Mask */
#define PWM_DZCR_DZEN23_Pos     29                                    /*!< Dead-zone Enable for PWM Pair of Channel 2 and Channel 3 */
#define PWM_DZCR_DZEN23_Msk     (0x1ul << PWM_DZCR_DZEN01_Pos)        /*!< PWM CONR: DZEN23 Mask */
#define PWM_DZCR_DZEN45_Pos     30                                    /*!< Dead-zone Enable for PWM Pair of Channel 4 and Channel 5 */
#define PWM_DZCR_DZEN45_Msk     (0x1ul << PWM_DZCR_DZEN01_Pos)        /*!< PWM CONR: DZEN45 Mask */

/* PWM_TCR Bit Field Definitions */
#define PWM_TCR_PTRG_EN_Pos     0                                     /*!< PWM TCR: PWM Period Point Trigger Enable */
#define PWM_TCR_PTRG_EN_Msk     (0x3Ful << PWM_TCR_PTRG_EN_Pos)       /*!< PWM TCR: PTRG_EN Mask */
#define PWM_TCR_CTRG_EN_Pos     8                                     /*!< PWM TCR: PWM Center Point Trigger Enable */
#define PWM_TCR_CTRG_EN_Msk     (0x3Ful << PWM_TCR_CTRG_EN_Pos)       /*!< PWM TCR: CTRG_EN Mask */
#define PWM_TCR_FETRG_EN_Pos    16                                    /*!< PWM TCR: PWM Falling Edge Point Trigger Enable */
#define PWM_TCR_FETRG_EN_Msk    (0x3Ful << PWM_TCR_CFETRG_EN_Pos)     /*!< PWM TCR: FETRG_EN Mask */
#define PWM_TCR_RETRG_EN_Pos    24                                    /*!< PWM TCR: PWM Rising Edge Point Trigger Enable */
#define PWM_TCR_RETRG_EN_Msk    (0x3Ful << PWM_TCR_CFETRG_EN_Pos)     /*!< PWM TCR: RETRG_EN Mask */

/* PWM_TIR Bit Field Definitions */
#define PWM_TIR_PTRGI_Pos       0                                     /*!< PWM TIR: PWM Period Point Trigger Indicator */
#define PWM_TIR_PTRGI_Msk       (0x3Ful << PWM_TIR_PTRGI_EN_Pos)      /*!< PWM TIR: PTRGI Mask */
#define PWM_TIR_CTRGI_Pos       8                                     /*!< PWM TIR: PWM Center Point Trigger Indicator */
#define PWM_TIR_CTRGI_Msk       (0x3Ful << PWM_TCR_CTRG_EN_Pos)       /*!< PWM TIR: CTRGI Mask */
#define PWM_TIR_FETRGI_Pos      16                                    /*!< PWM TIR: PWM Falling Edge Point Trigger Indicator */
#define PWM_TIR_FETRGI_Msk      (0x3Ful << PWM_TCR_CFETRG_EN_Pos)     /*!< PWM TIR: FETRGI Mask */
#define PWM_TIR_RETRGI_Pos      24                                    /*!< PWM TIR: PWM Rising Edge Point Trigger Indicator */
#define PWM_TIR_RETRGI_Msk      (0x3Ful << PWM_TCR_CFETRG_EN_Pos)     /*!< PWM TIR: RETRGI Mask */

/* PWM_BCR Bit Field Definitions */
#define PWM_BCR_BK0EN_Pos       0                                     /*!< PWM BCR: Brake0 Function Enable */
#define PWM_BCR_BK0EN_Msk       (0x1ul << PWM_BCR_BK0EN_Pos)          /*!< PWM BCR: BK0EN Mask */
#define PWM_BCR_BK0NF_DIS_Pos   1                                     /*!< PWM BCR: PWM Brake 0 Noise Filter Disable */
#define PWM_BCR_BK0NF_DIS_Msk   (0x1ul << PWM_BCR_BK0NF_DIS_Pos)      /*!< PWM BCR: BK0NF_DIS Mask */
#define PWM_BCR_BK0PINV_Pos     2                                     /*!< PWM BCR: Inverse BKP0 State */
#define PWM_BCR_BK0PINV_Msk     (0x1ul << PWM_BCR_BK0PINV_Pos)        /*!< PWM BCR: BK0PINV Mask */
#define PWM_BCR_BK0FSEL_Pos     6                                     /*!< PWM BCR: Brake 0 (BKPx0 pin) Edge Detector Filter Clock Selection */
#define PWM_BCR_BK0FSEL_Msk     (0x3ul << PWM_BCR_BK0FSEL_Pos)        /*!< PWM BCR: BK0FSEL Mask */
#define PWM_BCR_BK1EN_Pos       8                                     /*!< PWM BCR: Brake1 Function Enable */
#define PWM_BCR_BK1EN_Msk       (0x1ul << PWM_BCR_BK1EN_Pos)          /*!< PWM BCR: BK1EN Mask */
#define PWM_BCR_BK1NF_DIS_Pos   9                                     /*!< PWM BCR: PWM Brake 1 Noise Filter Disable */
#define PWM_BCR_BK1NF_DIS_Msk   (0x1ul << PWM_BCR_BK1NF_DIS_Pos)      /*!< PWM BCR: BK1NF_DIS Mask */
#define PWM_BCR_BK1PINV_Pos     10                                    /*!< PWM BCR: Inverse BKP1 State */
#define PWM_BCR_BK1PINV_Msk     (0x1ul << PWM_BCR_BK1PINV_Pos)        /*!< PWM BCR: BK1PINV Mask */
#define PWM_BCR_BK1SEL_Pos      12                                    /*!< PWM BCR: Brake Function 1 Source Selection */
#define PWM_BCR_BK1SEL_Msk      (0x3ul << PWM_BCR_BK1SEL_Pos)         /*!< PWM BCR: BK1SEL Mask */
#define PWM_BCR_BK1FSEL_Pos     14                                    /*!< PWM BCR: Brake 1 (BKPx1 pin) Edge Detector Filter Clock Selection */
#define PWM_BCR_BK1FSEL_Msk     (0x3ul << PWM_BCR_BK1FSEL_Pos)        /*!< PWM BCR: BK1FSEL Mask */
#define PWM_BCR_CPO0BKEN_Pos    16                                    /*!< PWM BCR: Enable CPO0 Digital Output as Brake0 Source */
#define PWM_BCR_CPO0BKEN_Msk    (0x1ul << PWM_BCR_CPO0BKEN_Pos)       /*!< PWM BCR: CPO0BKEN Mask */
#define PWM_BCR_CPO1BKEN_Pos    17                                    /*!< PWM BCR: Enable CPO1 Digital Output as Brake0 Source */
#define PWM_BCR_CPO1BKEN_Msk    (0x1ul << PWM_BCR_CPO1BKEN_Pos)       /*!< PWM BCR: CPO1BKEN Mask */
#define PWM_BCR_CPO2BKEN_Pos    18                                    /*!< PWM BCR: Enable CPO2 Digital Output as Brake0 Source */
#define PWM_BCR_CPO2BKEN_Msk    (0x1ul << PWM_BCR_CPO2BKEN_Pos)       /*!< PWM BCR: CPO2BKEN Mask */
#define PWM_BCR_LVDBKEN_Pos     19                                    /*!< PWM BCR: Low-level Detection Trigger PWM Brake Function 1 Enable */
#define PWM_BCR_LVDBKEN_Msk     (0x1ul << PWM_BCR_LVDBKEN_Pos)        /*!< PWM BCR: LVDBKEN Mask */
#define PWM_BCR_BKOD_Pos        24                                    /*!< PWM BCR: PWM Brake Output Data Register */
#define PWM_BCR_BKOD_Msk        (0x3Ful << PWM_BCR_BKOD_Pos)          /*!< PWM BCR: BKOD Mask */

