coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* PWM_ICR Bit Field Definitions */
#define PWM_ICR_PINTTYPE_Pos    0                                     /*!< PWM ICR: PWM Period Interrupt Type Selection */
#define PWM_ICR_PINTTYPE_Msk    (0x3Ful << PWM_IER_PINTTYPE_Pos)      /*!< PWM ICR: PINTTYPE Mask */
#define PWM_ICR_DINTTYPE_Pos    8                                     /*!< PWM ICR: PWM Duty Interrupt Type Selection */
#define PWM_ICR_DINTTYPE_Msk    (0x3Ful << PWM_IER_DINTTYPE_Pos)      /*!< PWM ICR: DINTTYPE Mask */

/* PWM_IER Bit Field Definitions */
#define PWM_IER_PPIE_Pos        0                                     /*!< PWM IER: PWM Period Interrupt Enable */
#define PWM_IER_PPIE_Msk        (0x3Ful << PWM_IER_PPIE_Pos)          /*!< PWM IER: PPIE Mask */
#define PWM_IER_BRKIE_Pos       6                                     /*!< PWM IER: Brake0 and Brake1 Interrupt Enable */
#define PWM_IER_BRKIE_Msk       (0x1ul << PWM_IER_PPIE_Pos)           /*!< PWM IER: BRKIE Mask */
#define PWM_IER_PDIE_Pos        8                                     /*!< PWM IER: PWM Duty Interrupt Enable */
#define PWM_IER_PDIE_Msk        (0x3Ful << PWM_IER_PDIE_Pos)          /*!< PWM IER: PDIE Mask */
#define PWM_IER_RLIE_Pos        16                                    /*!< PWM IER: Rising Latch Interrupt Enable */
#define PWM_IER_RLIE_Msk        (0x3Ful << PWM_IER_RLIE_Pos)          /*!< PWM IER: RLIE Mask */
#define PWM_IER_FLIE_Pos        24                                    /*!< PWM IER: Falling Latch Interrupt Enable */
#define PWM_IER_FLIE_Msk        (0x3Ful << PWM_IER_FLIE_Pos)          /*!< PWM IER: FLIE Mask */

/* PWM_IFR Bit Field Definitions */
#define PWM_IFR_PPIF_Pos        0                                     /*!< PWM IFR: PWM Period Interrupt Flag */
#define PWM_IFR_PPIF_Msk        (0x3Ful << PWM_IFR_PPIF_Pos)          /*!< PWM IFR: PPIF Mask */
#define PWM_IFR_BKIF0_Pos       6                                     /*!< PWM IFR: PWM Brake0 Flag */
#define PWM_IFR_BKIF0_Msk       (0x1ul << PWM_IFR_BKIF0_Pos)          /*!< PWM IFR: BKIF0 Mask */
#define PWM_IFR_BKIF1_Pos       7                                     /*!< PWM IFR: PWM Brake1 Flag*/
#define PWM_IFR_BKIF1_Msk       (0x1ul << PWM_IFR_BKIF1_Pos)          /*!< PWM IFR: BKIF1 Mask */
#define PWM_IFR_PDIF_Pos        8                                     /*!< PWM IFR: PWM Duty Interrupt Flag */
#define PWM_IFR_PDIF_Msk        (0x3Ful << PWM_IFR_PDIF_Pos)          /*!< PWM IFR: PDIF Mask */
#define PWM_IFR_BKLK0_Pos       14                                    /*!< PWM IFR: PWM Brake0 Locked */
#define PWM_IFR_BKLK0_Msk       (0x1ul << PWM_IFR_BKLK0_Pos)          /*!< PWM IFR: BKLK0 Mask */
#define PWM_IFR_CRLIF_Pos       16                                    /*!< PWM IFR: Capture Rising Latch Interrupt Flag */
#define PWM_IFR_CRLIF_Msk       (0x3Ful << PWM_IFR_CRLIF_Pos)         /*!< PWM IFR: CRLIF Mask */
#define PWM_IFR_CFLIF_Pos       24                                    /*!< PWM IFR: Capture Falling Latch Interrupt Flag */
#define PWM_IFR_CFLIF_Msk       (0x3Ful << PWM_IFR_CFLIF_Pos)         /*!< PWM IFR: CFLIF Mask */

/* PWM_CCR Bit Field Definitions */
#define PWM_CCR_CAPEN_Pos       0                                     /*!< PWM CCR: Capture Function Enable */
#define PWM_CCR_CAPEN_Msk       (0x3Ful << PWM_CCR_CAPEN_Pos)         /*!< PWM CCR: PTRGI Mask */
#define PWM_CCR_CAPINV_Pos      8                                     /*!< PWM CCR: PWM Center Point Trigger Indicator */
#define PWM_CCR_CAPINV_Msk      (0x3Ful << PWM_CCR_CAPINV_Pos)        /*!< PWM CCR: CTRGI Mask */
#define PWM_CCR_RLRLDEN_Pos     16                                    /*!< PWM CCR: PWM Falling Edge Point Trigger Indicator */
#define PWM_CCR_RLRLDEN_Msk     (0x3Ful << PWM_CCR_RLRLDEN_Pos)       /*!< PWM CCR: FETRGI Mask */
#define PWM_CCR_FLRLDEN_Pos     24                                    /*!< PWM CCR: PWM Rising Edge Point Trigger Indicator */
#define PWM_CCR_FLRLDEN_Msk     (0x3Ful << PWM_CCR_FLRLDEN_Pos)       /*!< PWM CCR: RETRGI Mask */

/* PWM_CAPSR Bit Field Definitions */
#define PWM_CAPSR_RLIFOV_Pos    0                                     /*!< PWM CAPSR: Rising Latch Interrupt Flag Overrun Status */
#define PWM_CAPSR_RLIFOV_Msk    (0x3Ful << PWM_CAPSR_RLIFOV_Pos)      /*!< PWM CAPSR: PTRGI Mask */
#define PWM_CAPSR_FLIFOV_Pos    8                                     /*!< PWM CAPSR: Falling Latch Interrupt Flag Overrun Status */
#define PWM_CAPSR_FLIFOV_Msk    (0x3Ful << PWM_CAPSR_FLIFOV_Pos)      /*!< PWM CAPSR: CTRGI Mask */

/*@}*/ /* end of group NUC400_PWM */
/*----------------------------- EPWM Controller ----------------------------*/
/** @addtogroup NUC400_EPWM NUC400 Enhanced PWM Control Register (EPWM)
  @{
*/
typedef struct {

    __IO uint32_t PWMCON;
    __IO uint32_t PWMSTS;
    __IO uint32_t PWMP;
    __IO uint32_t PWM0;
    __IO uint32_t PWM2;
    __IO uint32_t PWM4;
    __IO uint32_t PMSKE;
    __IO uint32_t PMSKD;
    __IO uint32_t ASPWM0;
    __IO uint32_t ASPWM2;
    __IO uint32_t ASPWM4;
    __IO uint32_t PDTC;
    __IO uint32_t PWMBO;
    __IO uint32_t PNP;
    __IO uint32_t ASPWMCON;
    __IO uint32_t PWMFCNT;
    __IO uint32_t PWMEIC;
    __IO uint32_t PWMOE;
} EPWM_T;

/* EPWM_PWMCON Bit Field Definitions */
#define EPWM_PWMCON_PWMMOD_Pos      0                                       /*!< EPWM PWMCON: PWM Mode Selection */
#define EPWM_PWMCON_PWMMOD_Msk      (0x3ul << EPWM_PWMCON_PWMMOD_Pos)       /*!< EPWM PWMCON: PWMMOD Mask */
#define EPWM_PWMCON_PWMDIV_Pos      2                                       /*!< EPWM PWMCON: PWM Clock Pre-divider Selection */
#define EPWM_PWMCON_PWMDIV_Msk      (0x3ul << EPWM_PWMCON_PWMDIV_Pos)       /*!< EPWM PWMCON: PWMDIV Mask */
#define EPWM_PWMCON_PWMI_EN_Pos     4                                       /*!< EPWM PWMCON: Enable PWM Interrupt */
#define EPWM_PWMCON_PWMI_EN_Msk     (0x1ul << EPWM_PWMCON_PWMI_EN_Pos)      /*!< EPWM PWMCON: PWMI_EN Mask */
#define EPWM_PWMCON_BRKI_EN_Pos     5                                       /*!< EPWM PWMCON: Enable Brake0 and Brake1 Interrupt */
#define EPWM_PWMCON_BRKI_EN_Msk     (0x1ul << EPWM_PWMCON_BRKI_EN_Pos)      /*!< EPWM PWMCON: BRKI_EN Mask */
#define EPWM_PWMCON_LOAD_Pos        6                                       /*!< EPWM PWMCON: Re-load PWM period registers (PWMP) and PWM duty registers (PWM0~3) control bit */
#define EPWM_PWMCON_LOAD_Msk        (0x1ul << EPWM_PWMCON_LOAD_Pos)         /*!< EPWM PWMCON: LOAD Mask */
#define EPWM_PWMCON_PWMRUN_Pos      7                                       /*!< EPWM PWMCON: Start PWMRUN Control Bit */
#define EPWM_PWMCON_PWMRUN_Msk      (0x1ul << EPWM_PWMCON_PWMRUN_Pos)       /*!< EPWM PWMCON: PWMRUN Mask */
#define EPWM_PWMCON_INT_TYPE_Pos    8                                       /*!< EPWM PWMCON: PWM Interrupt Type Selection Bit */
#define EPWM_PWMCON_INT_TYPE_Msk    (0x1ul << EPWM_PWMCON_INT_TYPE_Pos)     /*!< EPWM PWMCON: INT_TYPE Mask */
#define EPWM_PWMCON_PWMINV_Pos      9                                       /*!< EPWM PWMCON: Inverse PWM Comparator Output */
#define EPWM_PWMCON_PWMINV_Msk      ( 0x1ul << EPWM_PWMCON_PWMINV_Pos)      /*!< EPWM PWMCON: PWMINV Mask */
#define EPWM_PWMCON_CLRPWM_Pos      11                                      /*!< EPWM PWMCON: Clear PWM Counter Control Bit */
#define EPWM_PWMCON_CLRPWM_Msk      ( 0x1ul << EPWM_PWMCON_CLRPWM_Pos)      /*!< EPWM PWMCON: CLRPWM Mask */
#define EPWM_PWMCON_PWMTYPE_Pos     12                                      /*!< EPWM PWMCON: PWM Aligned Type Selection Bit */
#define EPWM_PWMCON_PWMTYPE_Msk     ( 0x1ul << EPWM_PWMCON_PWMTYPE_Pos)     /*!< EPWM PWMCON: PWMTYPE Mask */
#define EPWM_PWMCON_GRP_Pos         13                                      /*!< EPWM PWMCON: Group bit */
#define EPWM_PWMCON_GRP_Msk         ( 0x1ul << EPWM_PWMCON_GRP_Pos)         /*!< EPWM PWMCON: GRP Mask */
#define EPWM_PWMCON_INVBKP0_Pos     14                                      /*!< EPWM PWMCON: Inverse BKP0 State */
#define EPWM_PWMCON_INVBKP0_Msk     ( 0x1ul << EPWM_PWMCON_INVBKP0_Pos)     /*!< EPWM PWMCON: INVBKP0 Mask */
#define EPWM_PWMCON_INVBKP1_Pos     15                                      /*!< EPWM PWMCON: Inverse BKP1 State */
#define EPWM_PWMCON_INVBKP1_Msk     ( 0x1ul << EPWM_PWMCON_INVBKP1_Pos)     /*!< EPWM PWMCON: INVBKP1 Mask */
#define EPWM_PWMCON_BKEN0_Pos       16                                      /*!< EPWM PWMCON: BKPx0 Pin Trigger Brake Function0 Enable */
#define EPWM_PWMCON_BKEN0_Msk       ( 0x1ul << EPWM_PWMCON_BKEN0_Pos)       /*!< EPWM PWMCON: BKEN0 Mask */
#define EPWM_PWMCON_BKEN1_Pos       17                                      /*!< EPWM PWMCON: BKPx1 Pin Trigger Brake Function1 Enable */
#define EPWM_PWMCON_BKEN1_Msk       ( 0x1ul << EPWM_PWMCON_BKEN1_Pos)       /*!< EPWM PWMCON: BKEN1 Mask */
#define EPWM_PWMCON_BK1SEL_Pos      18                                      /*!< EPWM PWMCON: Brake Function 1 Source Selection */
#define EPWM_PWMCON_BK1SEL_Msk      ( 0x3ul << EPWM_PWMCON_BK1SEL_Pos)      /*!< EPWM PWMCON: BK1SEL Mask */
#define EPWM_PWMCON_BK0FILT_Pos     20                                      /*!< EPWM PWMCON: Brake 0 (BKPx0 pin) Edge Detector Filter Clock Selection */
#define EPWM_PWMCON_BK0FILT_Msk     ( 0x3ul << EPWM_PWMCON_BK0FILT_Pos)     /*!< EPWM PWMCON: BK0FILT Mask */
#define EPWM_PWMCON_BK1FILT_Pos     22                                      /*!< EPWM PWMCON: Brake 1 (BKPx1 pin) Edge Detector Filter Clock Selection */
#define EPWM_PWMCON_BK1FILT_Msk     ( 0x3ul << EPWM_PWMCON_BK1FILT_Pos)     /*!< EPWM PWMCON: BK1FILT Mask */
#define EPWM_PWMCON_CPO0BK_EN_Pos   24                                      /*!< EPWM PWMCON: Enable CPO0 Digital Output as Brake0 Source */
#define EPWM_PWMCON_CPO0BK_EN_Msk   ( 0x1ul << EPWM_PWMCON_CPO0BK_EN_Pos)   /*!< EPWM PWMCON: CPO0BK_EN Mask */
#define EPWM_PWMCON_CPO1BK_EN_Pos   25                                      /*!< EPWM PWMCON: Enable CPO1 Digital Output as Brake0 Source */
#define EPWM_PWMCON_CPO1BK_EN_Msk   ( 0x1ul << EPWM_PWMCON_CPO1BK_EN_Pos)   /*!< EPWM PWMCON: CPO1BK_EN Mask */
#define EPWM_PWMCON_CPO2BK_EN_Pos   26                                      /*!< EPWM PWMCON: Enable CPO2 Digital Output as Brake0 Source */
#define EPWM_PWMCON_CPO2BK_EN_Msk   ( 0x1ul << EPWM_PWMCON_CPO2BK_EN_Pos)   /*!< EPWM PWMCON: CPO2BK_EN Mask */
#define EPWM_PWMCON_LVDBK_EN_Pos    27                                      /*!< EPWM PWMCON: Low-level Detection Trigger PWM Brake Function 1 Enable */
#define EPWM_PWMCON_LVDBK_EN_Msk    ( 0x1ul << EPWM_PWMCON_LVDBK_EN_Pos)    /*!< EPWM PWMCON: LVDBK_EN Mask */
#define EPWM_PWMCON_BK0NF_DIS_Pos   28                                      /*!< EPWM PWMCON: PWM Brake 0 Noise Filter Disable */
#define EPWM_PWMCON_BK0NF_DIS_Msk   ( 0x1ul << EPWM_PWMCON_BK0NF_DIS_Pos)   /*!< EPWM PWMCON: BK0NF_DIS Mask */
#define EPWM_PWMCON_BK1NF_DIS_Pos   29                                      /*!< EPWM PWMCON: PWM Brake 1 Noise Filter Disable */
#define EPWM_PWMCON_BK1NF_DIS_Msk   ( 0x1ul << EPWM_PWMCON_BK1NF_DIS_Pos)   /*!< EPWM PWMCON: BK1NF_DIS Mask */
#define EPWM_PWMCON_CLDMD_Pos       31                                      /*!< EPWM PWMCON: Center Reload Mode Enable */
#define EPWM_PWMCON_CLDMD_Msk       ( 0x1ul << EPWM_PWMCON_CLDMD_Pos)       /*!< EPWM PWMCON: CLDMD Mask */

/* EPWM_PWMSTS Bit Field Definitions */
#define EPWM_PWMSTS_BKF0_Pos        0                                       /*!< EPWM PWMCON: PWM Brake0 Flag */
#define EPWM_PWMSTS_BKF0_Msk        (0x1ul << EPWM_PWMSTS_BKF0_Pos)         /*!< EPWM PWMCON: BKF0 Mask */
#define EPWM_PWMSTS_BKF1_Pos        0                                       /*!< EPWM PWMCON: PWM Brake1 Flag */
#define EPWM_PWMSTS_BKF1_Msk        (0x1ul << EPWM_PWMSTS_BKF1_Pos)         /*!< EPWM PWMCON: BKF1 Mask */
#define EPWM_PWMSTS_PWMF_Pos        0                                       /*!< EPWM PWMCON: PWM Period Flag */
#define EPWM_PWMSTS_PWMF_Msk        (0x1ul << EPWM_PWMSTS_PWMF_Pos)         /*!< EPWM PWMCON: PWMF Mask */
#define EPWM_PWMSTS_PWM0EF_Pos      0                                       /*!< EPWM PWMCON: PWMx0 Edge Flag */
#define EPWM_PWMSTS_PWM0EF_Msk      (0x1ul << EPWM_PWMSTS_PWM0EF_Pos)       /*!< EPWM PWMCON: PWM0EF Mask */
#define EPWM_PWMSTS_PWM2EF_Pos      0                                       /*!< EPWM PWMCON: PWMx2 Edge Flag */
#define EPWM_PWMSTS_PWM2EF_Msk      (0x1ul << EPWM_PWMSTS_PWM2EF_Pos)       /*!< EPWM PWMCON: PWM2EF Mask */
#define EPWM_PWMSTS_PWM4EF_Pos      0                                       /*!< EPWM PWMCON: PWMx4 Edge Flag */
#define EPWM_PWMSTS_PWM4EF_Msk      (0x1ul << EPWM_PWMSTS_PWM4EF_Pos)       /*!< EPWM PWMCON: PWM4EF Mask */
#define EPWM_PWMSTS_BKLK0_Pos       0                                       /*!< EPWM PWMCON: PWM Brake0 Locked */
#define EPWM_PWMSTS_BKLK0_Msk       (0x1ul << EPWM_PWMSTS_BKLK0_Pos)        /*!< EPWM PWMCON: BKLK0 Mask */

/* EPWM_ASPWMCON Bit Field Definitions */
#define EPWM_ASPWMCON_ASPWMEN_Pos   0                                       /*!< EPWM ASPWMEN: Asymmetric PWM Enable bit */
#define EPWM_ASPWMCON_ASPWMEN_Msk   (0x1ul << EPWM_ASPWMCON_ASPWMEN_Pos)    /*!< EPWM ASPWMEN: BKF0 Mask */
#define EPWM_ASPWMCON_ASPLDM0_Pos   8                                       /*!< EPWM ASPWMEN: Asymmetric PWMx0 Reload Mode Setting */
#define EPWM_ASPWMCON_ASPLDM0_Msk   (0x3ul << EPWM_ASPWMCON_ASPLDM0_Pos)    /*!< EPWM ASPWMEN: ASPLDM0 Mask */
#define EPWM_ASPWMCON_ASPLDM2_Pos   16                                      /*!< EPWM ASPWMEN: Asymmetric PWMx2 Reload Mode Setting */
#define EPWM_ASPWMCON_ASPLDM2_Msk   (0x3ul << EPWM_ASPWMCON_ASPLDM2_Pos)    /*!< EPWM ASPWMEN: ASPLDM2 Mask */
#define EPWM_ASPWMCON_ASPLDM4_Pos   24                                      /*!< EPWM ASPWMEN: Asymmetric PWMx4 Reload Mode Setting */
#define EPWM_ASPWMCON_ASPLDM4_Msk   (0x3ul << EPWM_ASPWMCON_ASPLDM4_Pos)    /*!< EPWM ASPWMEN: ASPLDM4 Mask */

/* EPWM_PDTC Bit Field Definitions */
#define EPWM_PDTC_DTCNT_Pos         0                                       /*!< EPWM PDTC: Dead-time counter */
#define EPWM_PDTC_DTCNT_Msk         (0x7FFul << EPWM_PDTC_DTCNT_Pos)        /*!< EPWM PDTC: DTCNT Mask */
#define EPWM_PDTC_DTEN0_Pos         16                                      /*!< EPWM PDTC: Enable dead-time insertion for PWMx pair (PWM0, PWM1) */
#define EPWM_PDTC_DTEN0_Msk         (0x1ul << EPWM_PDTC_DTEN0_Pos)          /*!< EPWM PDTC: DTEN0 Mask */
#define EPWM_PDTC_DTEN2_Pos         17                                      /*!< EPWM PDTC: Enable dead-time insertion for PWMx pair (PWM2, PWM3) */
#define EPWM_PDTC_DTEN2_Msk         (0x1ul << EPWM_PDTC_DTEN2_Pos)          /*!< EPWM PDTC: DTEN2 Mask */
#define EPWM_PDTC_DTEN4_Pos         18                                      /*!< EPWM PDTC: Enable dead-time insertion for PWMx pair (PWM4, PWM5) */
#define EPWM_PDTC_DTEN4_Msk         (0x1ul << EPWM_PDTC_DTEN4_Pos)          /*!< EPWM PDTC: DTEN4 Mask */

/* EPWM_PWMEIC Bit Field Definitions */
#define EPWM_PWMEIC_PWM0EI_EN_Pos   0                                       /*!< EPWM PWMEIC: Enable PWMx0 Edge Interrupt */
#define EPWM_PWMEIC_PWM0EI_EN_Msk   (0x7FFul << EPWM_PWMEIC_PWM0EI_EN_Pos)  /*!< EPWM PWMEIC: PWM0EI_EN Mask */
#define EPWM_PWMEIC_PWM2EI_EN_Pos   1                                       /*!< EPWM PWMEIC: Enable PWMx2 Edge Interrupt */
#define EPWM_PWMEIC_PWM2EI_EN_Msk   (0x7FFul << EPWM_PWMEIC_PWM2EI_EN_Pos)  /*!< EPWM PWMEIC: PWM2EI_EN Mask */
#define EPWM_PWMEIC_PWM4EI_EN_Pos   2                                       /*!< EPWM PWMEIC: Enable PWMx4 Edge Interrupt */
#define EPWM_PWMEIC_PWM4EI_EN_Msk   (0x7FFul << EPWM_PWMEIC_PWM4EI_EN_Pos)  /*!< EPWM PWMEIC: PWM4EI_EN Mask */
#define EPWM_PWMEIC_EINT0_TYPE_Pos  8                                       /*!< EPWM PWMEIC: PWMx0 Edge Interrupt Type */
#define EPWM_PWMEIC_EINT0_TYPE_Msk  (0x7FFul << EPWM_PWMEIC_EINT0_TYPE_Pos) /*!< EPWM PWMEIC: PWM0EI_EN Mask */
#define EPWM_PWMEIC_EINT2_TYPE_Pos  9                                       /*!< EPWM PWMEIC: PWMx2 Edge Interrupt Type */
#define EPWM_PWMEIC_EINT2_TYPE_Msk  (0x7FFul << EPWM_PWMEIC_EINT2_TYPE_Pos) /*!< EPWM PWMEIC: PWM2EI_EN Mask */
#define EPWM_PWMEIC_EINT4_TYPE_Pos  10                                      /*!< EPWM PWMEIC: PWMx4 Edge Interrupt Type */
#define EPWM_PWMEIC_EINT4_TYPE_Msk  (0x7FFul << EPWM_PWMEIC_EINT4_TYPE_Pos) /*!< EPWM PWMEIC: PWM4EI_EN Mask */
/*@}*/ /* end of group NUC400_EPWM */

/*----------------------------- QEI Controller ----------------------------*/
/** @addtogroup NUC400_QEI NUC400 QEI Control Register
  @{
*/
typedef struct {
    __IO uint32_t CNT;
    __IO uint32_t CNTHLD;
    __IO uint32_t CNTILAT;
    __IO uint32_t CNTCMP;
    uint32_t RESERVED0[1];
    __IO uint32_t MAXCNT;
    __IO uint32_t CTR;
    uint32_t RESERVED1[4];                       /*!< Offset: 0x001C ~ 0x0028  Reserved                                  */
    __IO uint32_t STS;
} QEI_T;

/* QEI_CTR Bit Field Definitions */
#define QEI_CTR_NFCLK_S_Pos         0                                     /*!< QEI CTR: Noise Filter Clock Pre-divided Selection */
#define QEI_CTR_NFCLK_S_Msk         (0x3ul << QEI_CTR_NFCLK_S_Pos)        /*!< QEI CTR: NFCLK_S Mask */
#define QEI_CTR_QEINF_DIS_Pos       3                                     /*!< QEI CTR: Disable QEI Controller Input Noise Filter */
#define QEI_CTR_QEINF_DIS_Msk       (0x1ul << QEI_CTR_QEINF_DIS_Pos)      /*!< QEI CTR: QEINF_DIS Mask */
#define QEI_CTR_QEA_EN_Pos          4                                     /*!< QEI CTR: Enable QEA Input to QEI Controller */
#define QEI_CTR_QEA_EN_Msk          (0x1ul << QEI_CTR_QEA_EN_Pos)         /*!< QEI CTR: QEA_EN Mask */
#define QEI_CTR_QEB_EN_Pos          5                                     /*!< QEI CTR: Enable QEB Input to QEI Controller */
#define QEI_CTR_QEB_EN_Msk          (0x1ul << QEI_CTR_QEB_EN_Pos)         /*!< QEI CTR: QEB_EN Mask */
#define QEI_CTR_IDX_EN_Pos          6                                     /*!< QEI CTR: Enable IDX Input to QEI Controller */
#define QEI_CTR_IDX_EN_Msk          (0x1ul << QEI_CTR_IDX_EN_Pos)         /*!< QEI CTR: IDX_EN Mask */
#define QEI_CTR_QEIMODE_Pos         8                                     /*!< QEI CTR: QEI Counting Mode Selection */
#define QEI_CTR_QEIMODE_Msk         (0x1ul << QEI_CTR_QEIMODE_Pos)        /*!< QEI CTR: QEIMODE Mask */
#define QEI_CTR_QEA_INV_Pos         12                                    /*!< QEI CTR: Inverse QEA Input Polarity */
#define QEI_CTR_QEA_INV_Msk         (0x1ul << QEI_CTR_QEA_INV_Pos)        /*!< QEI CTR: QEA_INV Mask */
#define QEI_CTR_QEB_INV_Pos         13                                    /*!< QEI CTR: Inverse QEB Input Polarity */
#define QEI_CTR_QEB_INV_Msk         (0x1ul << QEI_CTR_QEB_INV_Pos)        /*!< QEI CTR: QEB_INV Mask */
#define QEI_CTR_IDX_INV_Pos         14                                    /*!< QEI CTR: Inverse IDX Input Polarity */
#define QEI_CTR_IDX_INV_Msk         (0x1ul << QEI_CTR_IDX_INV_Pos)        /*!< QEI CTR: IDX_INV Mask */
#define QEI_CTR_OVUN_IEN_Pos        16                                    /*!< QEI CTR: Enable OVUNF Trigger QEI Interrupt */
#define QEI_CTR_OVUN_IEN_Msk        (0x1ul << QEI_CTR_OVUN_IEN_Pos)       /*!< QEI CTR: OVUN_IEN Mask */
#define QEI_CTR_DIR_IEN_Pos         17                                    /*!< QEI CTR: Enable DIRF Trigger QEI Interrupt */
#define QEI_CTR_DIR_IEN_Msk         (0x1ul << QEI_CTR_DIR_IEN_Pos)        /*!< QEI CTR: DIR_IEN Mask */
#define QEI_CTR_CMP_IEN_Pos         18                                    /*!< QEI CTR: Enable CMPF Trigger QEI Interrupt */
#define QEI_CTR_CMP_IEN_Msk         (0x1ul << QEI_CTR_CMP_IEN_Pos)        /*!< QEI CTR: CMP_IEN Mask */
#define QEI_CTR_IDX_IEN_Pos         19                                    /*!< QEI CTR: Enable IDXF Trigger QEI Interrupt */
#define QEI_CTR_IDX_IEN_Msk         (0x1ul << QEI_CTR_IDX_IEN_Pos)        /*!< QEI CTR: IDX_IEN Mask */
#define QEI_CTR_HOLDBYT0_Pos        20                                    /*!< QEI CTR: Hold QEI_CNT by Timer 0*/
#define QEI_CTR_HOLDBYT0_Msk        (0x1ul << QEI_CTR_HOLDBYT0_Pos)       /*!< QEI CTR: HOLDBYT0 Mask */
#define QEI_CTR_HOLDBYT1_Pos        21                                    /*!< QEI CTR: Hold QEI_CNT by Timer 1 */
#define QEI_CTR_HOLDBYT1_Msk        (0x1ul << QEI_CTR_HOLDBYT1_Pos)       /*!< QEI CTR: HOLDBYT1 Mask */
#define QEI_CTR_HOLDBYT2_Pos        22                                    /*!< QEI CTR: Hold QEI_CNT by Timer 2 */
#define QEI_CTR_HOLDBYT2_Msk        (0x1ul << QEI_CTR_HOLDBYT2_Pos)       /*!< QEI CTR: HOLDBYT2 Mask */
#define QEI_CTR_HOLDBYT3_Pos        23                                    /*!< QEI CTR: Hold QEI_CNT by Timer  */
#define QEI_CTR_HOLDBYT3_Msk        (0x1ul << QEI_CTR_HOLDBYT3_Pos)       /*!< QEI CTR: HOLDBYT3 Mask */
#define QEI_CTR_HOLDCNT_Pos         24                                    /*!< QEI CTR: Hold QEI_CNT Control Bit */
#define QEI_CTR_HOLDCNT_Msk         (0x1ul << QEI_CTR_HOLDCNT_Pos)        /*!< QEI CTR: HOLDCNT Mask */
#define QEI_CTR_IDXLAT_Pos          25                                    /*!< QEI CTR: Index Latch QEI_CNT Enable Bit */
#define QEI_CTR_IDXLAT_Msk          (0x1ul << QEI_CTR_IDXLAT_Pos)         /*!< QEI CTR: IDXLAT Mask */
#define QEI_CTR_IDXRLD_EN_Pos       27                                    /*!< QEI CTR: Index Trigger QEI_CNT Reload Enable Bit */
#define QEI_CTR_IDXRLD_EN_Msk       (0x1ul << QEI_CTR_IDXRLD_EN_Pos)      /*!< QEI CTR: IDXRLD_EN Mask */
#define QEI_CTR_CMP_EN_Pos          28                                    /*!< QEI CTR: The Compare Function Enable Bit*/
#define QEI_CTR_CMP_EN_Msk          (0x1ul << QEI_CTR_CMP_EN_Pos)         /*!< QEI CTR: CMP_EN Mask */
#define QEI_CTR_QEI_EN_Pos          29                                    /*!< QEI CTR: Quadrature Encoder Interface Controller Enable Bit */
#define QEI_CTR_QEI_EN_Msk          (0x1ul << QEI_CTR_QEI_EN_Pos)         /*!< QEI CTR: QEI_EN Mask */
/*@}*/ /* end of group NUC400_QEI */

/*----------------------------- ECAP Controller ----------------------------*/
/** @addtogroup NUC400_ECAP NUC400 Enhanced Capture Control Register (ECAP)
  @{
*/
typedef struct {
    __IO uint32_t CNT;
    __IO uint32_t HLD0;
    __IO uint32_t HLD1;
    __IO uint32_t HLD2;
    __IO uint32_t CNTCMP;
    __IO uint32_t CTR0;
    __IO uint32_t CTR1;
    __IO uint32_t STS;
} ECAP_T;

