coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* ECAP_CTR0 Bit Field Definitions */
#define ECAP_CTR0_NFCLK_S_Pos       0                                     /*!< ECAP CTR0: Noise Filter Clock Pre-divided Selection */
#define ECAP_CTR0_NFCLK_S_Msk       (0x3ul << ECAP_CTR0_NFCLK_S_Pos)      /*!< ECAP CTR0: NFCLK_S Mask */
#define ECAP_CTR0_CAPNF_DIS_Pos     3                                     /*!< ECAP CTR0: Disable Input Capture Noise Filter */
#define ECAP_CTR0_CAPNF_DIS_Msk     (0x1ul << ECAP_CTR0_CAPNF_DIS_Pos)    /*!< ECAP CTR0: CAPNF_DIS Mask */
#define ECAP_CTR0_IC0_EN_Pos        4                                     /*!< ECAP CTR0: Enable Port Pin IC0 Input to Input Capture Unit */
#define ECAP_CTR0_IC0_EN_Msk        (0x1ul << ECAP_CTR0_IC0_EN_Pos)       /*!< ECAP CTR0: IC0_EN Mask */
#define ECAP_CTR0_IC1_EN_Pos        5                                     /*!< ECAP CTR0: Enable Port Pin IC1 Input to Input Capture Unit */
#define ECAP_CTR0_IC1_EN_Msk        (0x1ul << ECAP_CTR0_IC1_EN_Pos)       /*!< ECAP CTR0: IC1_EN Mask */
#define ECAP_CTR0_IC2_EN_Pos        6                                     /*!< ECAP CTR0: Enable Port Pin IC2 Input to Input Capture Unit */
#define ECAP_CTR0_IC2_EN_Msk        (0x1ul << ECAP_CTR0_IC2_EN_Pos)       /*!< ECAP CTR0: IC2_EN Mask */
#define ECAP_CTR0_CAPSEL0_Pos       8                                     /*!< ECAP CTR0: CAP0 Input Source Selection Bit */
#define ECAP_CTR0_CAPSEL0_Msk       (0x3ul << ECAP_CTR0_CAPSEL0_Pos)      /*!< ECAP CTR0: CAPSEL0 Mask */
#define ECAP_CTR0_CAPSEL1_Pos       10                                    /*!< ECAP CTR0: CAP0 Input Source Selection Bit */
#define ECAP_CTR0_CAPSEL1_Msk       (0x3ul << ECAP_CTR0_CAPSEL1_Pos)      /*!< ECAP CTR0: CAPSEL1 Mask */
#define ECAP_CTR0_CAPSEL2_Pos       12                                    /*!< ECAP CTR0: CAP0 Input Source Selection Bit */
#define ECAP_CTR0_CAPSEL2_Msk       (0x3ul << ECAP_CTR0_CAPSEL2_Pos)      /*!< ECAP CTR0: CAPSEL2 Mask */
#define ECAP_CTR0_CAPTF0_IEN_Pos    16                                    /*!< ECAP CTR0: Enable Input Capture Channel 0 Interrupt */
#define ECAP_CTR0_CAPTF0_IEN_Msk    (0x1ul << ECAP_CTR0_CAPTF0_IEN_Pos)   /*!< ECAP CTR0: CAPTF0_IEN Mask */
#define ECAP_CTR0_CAPTF1_IEN_Pos    17                                    /*!< ECAP CTR0: Enable Input Capture Channel 1 Interrupt */
#define ECAP_CTR0_CAPTF1_IEN_Msk    (0x1ul << ECAP_CTR0_CAPTF1_IEN_Pos)   /*!< ECAP CTR0: CAPTF1_IEN Mask */
#define ECAP_CTR0_CAPTF2_IEN_Pos    18                                    /*!< ECAP CTR0: Enable Input Capture Channel 2 Interrupt */
#define ECAP_CTR0_CAPTF2_IEN_Msk    (0x1ul << ECAP_CTR0_CAPTF2_IEN_Pos)   /*!< ECAP CTR0: CAPTF2_IEN Mask */
#define ECAP_CTR0_CAPOV_IEN_Pos     20                                    /*!< ECAP CTR0: Enable CAPOVF Trigger Input Capture Interrupt */
#define ECAP_CTR0_CAPOV_IEN_Msk     (0x1ul << ECAP_CTR0_CAPOV_IEN_Pos)    /*!< ECAP CTR0: CAPOV_IEN Mask */
#define ECAP_CTR0_CAPCMP_IEN_Pos    21                                    /*!< ECAP CTR0: Enable CAPCMPF Trigger Input Capture Interrupt */
#define ECAP_CTR0_CAPCMP_IEN_Msk    (0x1ul << ECAP_CTR0_CAPCMP_IEN_Pos)   /*!< ECAP CTR0: CAPCMP_IEN Mask */
#define ECAP_CTR0_CPST_Pos          24                                    /*!< ECAP CTR0: Input Capture Counter Start Bit */
#define ECAP_CTR0_CPST_Msk          (0x1ul << ECAP_CTR0_CPST_Pos)         /*!< ECAP CTR0: CPST Mask */
#define ECAP_CTR0_CMPCLR_Pos        25                                    /*!< ECAP CTR0: Input Capture Counter Clear by Compare-match Control Bit */
#define ECAP_CTR0_CMPCLR_Msk        (0x1ul << ECAP_CTR0_CMPCLR_Pos)       /*!< ECAP CTR0: CMPCLR Mask */
#define ECAP_CTR0_CPTCLR_Pos        26                                    /*!< ECAP CTR0: Input Capture Counter Clear by Capture Events Control Bit */
#define ECAP_CTR0_CPTCLR_Msk        (0x1ul << ECAP_CTR0_CPTCLR_Pos)       /*!< ECAP CTR0: CPTCLR Mask */
#define ECAP_CTR0_RLD_EN_Pos        27                                    /*!< ECAP CTR0: The Reload Function Enable Bit */
#define ECAP_CTR0_RLD_EN_Msk        (0x1ul << ECAP_CTR0_RLD_EN_Pos)       /*!< ECAP CTR0: RLD_EN Mask */
#define ECAP_CTR0_CMP_EN_Pos        28                                    /*!< ECAP CTR0: The Compare Function Enable Bit */
#define ECAP_CTR0_CMP_EN_Msk        (0x1ul << ECAP_CTR0_CMP_EN_Pos)       /*!< ECAP CTR0: CMP_EN Mask */
#define ECAP_CTR0_CAP_EN_Pos        29                                    /*!< ECAP CTR0: Input Capture Timer/Counter Enable Bit */
#define ECAP_CTR0_CAP_EN_Msk        (0x1ul << ECAP_CTR0_CAP_EN_Pos)       /*!< ECAP CTR0: CAP_EN Mask */

/* ECAP_CTR1 Bit Field Definitions */
#define ECAP_CTR1_CAPEDG0_Pos       0                                     /*!< ECAP CTR1: Channel 0 Captured Edge Selection */
#define ECAP_CTR1_CAPEDG0_Msk       (0x3ul << ECAP_CTR1_CAPEDG0_Pos)      /*!< ECAP CTR1: CAPEDG0 Mask */
#define ECAP_CTR1_CAPEDG1_Pos       2                                     /*!< ECAP CTR1: Channel 1 Captured Edge Selection */
#define ECAP_CTR1_CAPEDG1_Msk       (0x3ul << ECAP_CTR1_CAPEDG1_Pos)      /*!< ECAP CTR1: CAPEDG1 Mask */
#define ECAP_CTR1_CAPEDG2_Pos       4                                     /*!< ECAP CTR1: Channel 2 Captured Edge Selection */
#define ECAP_CTR1_CAPEDG2_Msk       (0x3ul << ECAP_CTR1_CAPEDG2_Pos)      /*!< ECAP CTR1: CAPEDG2 Mask */
#define ECAP_CTR1_CPRLD_S_Pos       8                                     /*!< ECAP CTR1: CAPCNT Reload Trigger Source Selection */
#define ECAP_CTR1_CPRLD_S_Msk       (0x7ul << ECAP_CTR1_CPRLD_S_Pos)      /*!< ECAP CTR1: CPRLD_S Mask */
#define ECAP_CTR1_CAPDIV_Pos        12                                    /*!< ECAP CTR1: Capture Timer Clock Divide Selection */
#define ECAP_CTR1_CAPDIV_Msk        (0x7ul << ECAP_CTR1_CAPDIV_Pos)       /*!< ECAP CTR1: CAPDIV Mask */
#define ECAP_CTR1_CAPCNT_SRC_Pos    16                                    /*!< ECAP CTR1: Capture Timer/Counter Clock Source Select */
#define ECAP_CTR1_CAPCNT_SRC_Msk    (0x3ul << ECAP_CTR1_CAPCNT_SRC_Pos)   /*!< ECAP CTR1: CAPCNT_SRC Mask */

/* ECAP_STS Bit Field Definitions */
#define ECAP_STS_CAPTF0_Pos         0                                     /*!< ECAP STS: Input Capture Channel 0 Captured Flag */
#define ECAP_STS_CAPTF0_Msk         (0x1ul << ECAP_STS_CAPTF0_Pos)        /*!< ECAP STS: CAPTF0 Mask */
#define ECAP_STS_CAPTF1_Pos         1                                     /*!< ECAP STS: Input Capture Channel 1 Captured Flag */
#define ECAP_STS_CAPTF1_Msk         (0x1ul << ECAP_STS_CAPTF1_Pos)        /*!< ECAP STS: CAPTF1 Mask */
#define ECAP_STS_CAPTF2_Pos         2                                     /*!< ECAP STS: Input Capture Channel 2 Captured Flag */
#define ECAP_STS_CAPTF2_Msk         (0x1ul << ECAP_STS_CAPTF2_Pos)        /*!< ECAP STS: CAPTF2 Mask */
#define ECAP_STS_CAPCMPF_Pos        4                                     /*!< ECAP STS: Input Capture Compare-match Flag */
#define ECAP_STS_CAPCMPF_Msk        (0x1ul << ECAP_STS_CAPCMPF_Pos)       /*!< ECAP STS: CAPCMPF Mask */
#define ECAP_STS_CAPOVF_Pos         5                                     /*!< ECAP STS: Input Capture Counter Overflow Flag */
#define ECAP_STS_CAPOVF_Msk         (0x1ul << ECAP_STS_CAPOVF_Pos)        /*!< ECAP STS: CAPOVF Mask */
/*@}*/ /* end of group NUC400_ECAP */

