coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/*-------------------- Serial Peripheral Interface (SPI) ----------------------*/
/** @addtogroup NUC400_SPI NUC400 Serial Peripheral Interface (SPI)
  @{
 */
typedef struct {
    __IO uint32_t CTL;                        /*!< Offset: 0x0000   SPI Control Register                               */
    __IO uint32_t CLKDIV;                     /*!< Offset: 0x0004   SPI Clock Divider Register                         */
    __IO uint32_t SSCR;                       /*!< Offset: 0x0008   SPI Slave Select Control Register                  */
    __IO uint32_t PDMACTL;                    /*!< Offset: 0x000C   SPI PDMA Control Register                          */
    __IO uint32_t FIFOCTL;                    /*!< Offset: 0x0010   SPI FIFO Control Register                          */
    __IO uint32_t STATUS;                     /*!< Offset: 0x0014   SPI Status Register                                */
    __I  uint32_t RESERVED0[2];               /*!< Offset: 0x0018 ~ 0x001C   Reserved                                  */
    __O  uint32_t TX;                         /*!< Offset: 0x0020   Data Transmit Register                             */
    __I uint32_t RESERVE1[3];                 /*!< Offset: 0x0024 ~ 0x002C   Reserved                                  */
    __I  uint32_t RX;                         /*!< Offset: 0x0030   Data Receive Register                              */
} SPI_T;


/* SPI_CTL Bit Field Definitions */
#define SPI_CTL_SPIEN_Pos         0                            /*!< SPI CTL: SPIEN Position */
#define SPI_CTL_SPIEN_Msk         (1ul << SPI_CTL_SPIEN_Pos)   /*!< SPI CTL: SPIEN Mask */
#define SPI_CTL_RX_NEG_Pos        1                            /*!< SPI CTL: RX_NEG Position */
#define SPI_CTL_RX_NEG_Msk        (1ul << SPI_CTL_RX_NEG_Pos)  /*!< SPI CTL: RX_NEG Mask */
#define SPI_CTL_TX_NEG_Pos        2                            /*!< SPI CTL: TX_NEG Position */
#define SPI_CTL_TX_NEG_Msk        (1ul << SPI_CTL_TX_NEG_Pos)  /*!< SPI CTL: TX_NEG Mask */
#define SPI_CTL_CLKP_Pos          3                            /*!< SPI CTL: CLKP Position */
#define SPI_CTL_CLKP_Msk          (1ul << SPI_CTL_CLKP_Pos)    /*!< SPI CTL: CLKP Mask */
#define SPI_CTL_SP_CYCLE_Pos      4                            /*!< SPI CTL: SP_CYCLE Position */
#define SPI_CTL_SP_CYCLE_Msk      (0xFul << SPI_CTL_SP_CYCLE_Pos)    /*!< SPI CTL: SP_CYCLE Mask */
#define SPI_CTL_DWIDTH_Pos        8                                  /*!< SPI CTL: DWIDTH Position */
#define SPI_CTL_DWIDTH_Msk        (0x1Ful << SPI_CTL_DWIDTH_Pos)   /*!< SPI CTL: DWIDTH Mask */
#define SPI_CTL_LSB_Pos           13                                 /*!< SPI CTL: LSB Position */
#define SPI_CTL_LSB_Msk           (1ul << SPI_CTL_LSB_Pos)     /*!< SPI CTL: LSB Mask */
#define SPI_CTL_TWOB_Pos          16                           /*!< SPI CTL: TWOB Position */
#define SPI_CTL_TWOB_Msk          (1ul << SPI_CTL_TWOB_Pos)    /*!< SPI CTL: TWOB Mask */
#define SPI_CTL_UNIT_INTEN_Pos    17                           /*!< SPI CTL: UNIT_INTEN Position */
#define SPI_CTL_UNIT_INTEN_Msk    (1ul << SPI_CTL_UNIT_INTEN_Pos)    /*!< SPI CTL: UNIT_INTEN Mask */
#define SPI_CTL_SLAVE_Pos         18                                 /*!< SPI CTL: SLAVE Position */
#define SPI_CTL_SLAVE_Msk         (1ul << SPI_CTL_SLAVE_Pos)         /*!< SPI CTL: SLAVE Mask */
#define SPI_CTL_REORDER_Pos       19                                 /*!< SPI CTL: REORDER Position */
#define SPI_CTL_REORDER_Msk       (1ul << SPI_CTL_REORDER_Pos)       /*!< SPI CTL: REORDER Mask */
#define SPI_CTL_QD_IO_DIR_Pos     20                                 /*!< SPI CTL: QD_IO_DIR Position */
#define SPI_CTL_QD_IO_DIR_Msk     (1ul << SPI_CTL_QD_IO_DIR_Pos)     /*!< SPI CTL: QD_IO_DIR Mask */
#define SPI_CTL_DUAL_IO_EN_Pos    21                                 /*!< SPI CTL: DUAL_IO_EN Position */
#define SPI_CTL_DUAL_IO_EN_Msk    (1ul << SPI_CTL_DUAL_IO_EN_Pos)    /*!< SPI CTL: DUAL_IO_EN Mask */
#define SPI_CTL_QUAD_IO_EN_Pos    22                                 /*!< SPI CTL: QUAD_IO_EN Position */
#define SPI_CTL_QUAD_IO_EN_Msk    (1ul << SPI_CTL_QUAD_IO_EN_Pos)    /*!< SPI CTL: QUAD_IO_EN Mask */

/* SPI_CLKDIV Bit Field Definitions */
#define SPI_CLKDIV_DIVIDER_Pos    0                                  /*!< SPI CLKDIV: DIVIDER Position */
#define SPI_CLKDIV_DIVIDER_Msk    (0xFFul << SPI_CLKDIV_DIVIDER_Pos) /*!< SPI CLKDIV: DIVIDER Mask */

/* SPI_SSCR Bit Field Definitions */
#define SPI_SSCR_SS_Pos           0                                   /*!< SPI SSCR: SS Position */
#define SPI_SSCR_SS_Msk           (3ul << SPI_SSCR_SS_Pos)            /*!< SPI SSCR: SS Mask */
#define SPI_SSCR_SS_LVL_Pos       2                                   /*!< SPI SSCR: SS_LVL Position */
#define SPI_SSCR_SS_LVL_Msk       (1ul << SPI_SSCR_SS_LVL_Pos)        /*!< SPI SSCR: SS_LVL Mask */
#define SPI_SSCR_AUTOSS_Pos       3                                   /*!< SPI SSCR: AUTOSS Position */
#define SPI_SSCR_AUTOSS_Msk       (1ul << SPI_SSCR_AUTOSS_Pos)        /*!< SPI SSCR: AUTOSS Mask */
#define SPI_SSCR_SLV3WIRE_Pos     4                                   /*!< SPI SSCR: SLV3WIRE Position */
#define SPI_SSCR_SLV3WIRE_Msk     (1ul << SPI_SSCR_SLV3WIRE_Pos)      /*!< SPI SSCR: SLV3WIRE Mask */
#define SPI_SSCR_SLVTO_INTEN_Pos  5                                   /*!< SPI SSCR: SLVTO_INTEN Position */
#define SPI_SSCR_SLVTO_INTEN_Msk  (1ul << SPI_SSCR_SLVTO_INTEN_Pos)   /*!< SPI SSCR: SLVTO_INTEN Mask */
#define SPI_SSCR_SLVTO_FFCLR_Pos  6                                   /*!< SPI SSCR: SLVTO_FFCLR Position */
#define SPI_SSCR_SLVTO_FFCLR_Msk  (1ul << SPI_SSCR_SLVTO_FFCLR_Pos)   /*!< SPI SSCR: SLVTO_FFCLR Mask */
#define SPI_SSCR_SLVER0_INTEN_Pos 8                                   /*!< SPI SSCR: SLVER0_INTEN Position */
#define SPI_SSCR_SLVER0_INTEN_Msk (1ul << SPI_SSCR_SLVER0_INTEN_Pos)  /*!< SPI SSCR: SLVER0_INTEN Mask */
#define SPI_SSCR_SLVER1_INTEN_Pos 9                                   /*!< SPI SSCR: SLVER1_INTEN Position */
#define SPI_SSCR_SLVER1_INTEN_Msk (1ul << SPI_SSCR_SLVER1_INTEN_Pos)  /*!< SPI SSCR: SLVER1_INTEN Mask */
#define SPI_SSCR_SSACT_INTEN_Pos  12                                  /*!< SPI SSCR: SSACT_INTEN Position */
#define SPI_SSCR_SSACT_INTEN_Msk  (1ul << SPI_SSCR_SSACT_INTEN_Pos)   /*!< SPI SSCR: SSACT_INTEN Mask */
#define SPI_SSCR_SSINA_INTEN_Pos  13                                  /*!< SPI SSCR: SSINA_INTEN Position */
#define SPI_SSCR_SSINA_INTEN_Msk  (1ul << SPI_SSCR_SSINA_INTEN_Pos)   /*!< SPI SSCR: SSINA_INTEN Mask */
#define SPI_SSCR_SLVTOPRD_Pos     16                                  /*!< SPI SSCR: SLVTOPRD Position */
#define SPI_SSCR_SLVTOPRD_Msk     (0xFFFFul << SPI_SSCR_SLVTOPRD_Pos) /*!< SPI SSCR: SLVTOPRD Mask */

/* SPI_PDMACTL Bit Field Definitions */
#define SPI_PDMACTL_TXPDMA_EN_Pos   0                                   /*!< SPI PDMACTL: TXPDMA_EN Position */
#define SPI_PDMACTL_TXPDMA_EN_Msk   (1ul << SPI_PDMACTL_TXPDMA_EN_Pos)  /*!< SPI PDMACTL: TXPDMA_EN Mask */
#define SPI_PDMACTL_RXPDMA_EN_Pos   1                                   /*!< SPI PDMACTL: RXPDMA_EN Position */
#define SPI_PDMACTL_RXPDMA_EN_Msk   (1ul << SPI_PDMACTL_RXPDMA_EN_Pos)  /*!< SPI PDMACTL: RXPDMA_EN Mask */
#define SPI_PDMACTL_PDMA_RST_Pos    2                                   /*!< SPI PDMACTL: PDMA_RST Position */
#define SPI_PDMACTL_PDMA_RST_Msk    (1ul << SPI_PDMACTL_PDMA_RST_Pos)   /*!< SPI PDMACTL: PDMA_RST Mask */

/* SPI_FIFOCTL Bit Field Definitions */
#define SPI_FIFOCTL_RX_CLR_Pos         0                                      /*!< SPI FIFOCTL: RX_CLR Position */
#define SPI_FIFOCTL_RX_CLR_Msk         (1ul << SPI_FIFOCTL_RX_CLR_Pos)        /*!< SPI FIFOCTL: RX_CLR Mask */
#define SPI_FIFOCTL_TX_CLR_Pos         1                                      /*!< SPI FIFOCTL: TX_CLR Position */
#define SPI_FIFOCTL_TX_CLR_Msk         (1ul << SPI_FIFOCTL_TX_CLR_Pos)        /*!< SPI FIFOCTL: TX_CLR Mask */
#define SPI_FIFOCTL_RXTH_INTEN_Pos     2                                      /*!< SPI FIFOCTL: RXTH_INTEN Position */
#define SPI_FIFOCTL_RXTH_INTEN_Msk     (1ul << SPI_FIFOCTL_RXTH_INTEN_Pos)    /*!< SPI FIFOCTL: RXTH_INTEN Mask */
#define SPI_FIFOCTL_TXTH_INTEN_Pos     3                                      /*!< SPI FIFOCTL: TXTH_INTEN Position */
#define SPI_FIFOCTL_TXTH_INTEN_Msk     (1ul << SPI_FIFOCTL_TXTH_INTEN_Pos)    /*!< SPI FIFOCTL: TXTH_INTEN Mask */
#define SPI_FIFOCTL_RXTO_INTEN_Pos     4                                      /*!< SPI FIFOCTL: RXTO_INTEN Position */
#define SPI_FIFOCTL_RXTO_INTEN_Msk     (1ul << SPI_FIFOCTL_RXTO_INTEN_Pos)    /*!< SPI FIFOCTL: RXTO_INTEN Mask */
#define SPI_FIFOCTL_RXOV_INTEN_Pos     5                                      /*!< SPI FIFOCTL: RXOV_INTEN Position */
#define SPI_FIFOCTL_RXOV_INTEN_Msk     (1ul << SPI_FIFOCTL_RXOV_INTEN_Pos)    /*!< SPI FIFOCTL: RXOV_INTEN Mask */
#define SPI_FIFOCTL_TXUDR_DO_Pos       6                                      /*!< SPI FIFOCTL: TXUDR_DO Position */
#define SPI_FIFOCTL_TXUDR_DO_Msk       (1ul << SPI_FIFOCTL_TXUDR_DO_Pos)      /*!< SPI FIFOCTL: TXUDR_DO Mask */
#define SPI_FIFOCTL_TXUDR_INTEN_Pos    7                                      /*!< SPI FIFOCTL: TXUDR_INTEN Position */
#define SPI_FIFOCTL_TXUDR_INTEN_Msk    (1ul << SPI_FIFOCTL_TXUDR_INTEN_Pos)   /*!< SPI FIFOCTL: TXUDR_INTEN Mask */
#define SPI_FIFOCTL_RX_THRESHOLD_Pos   24                                     /*!< SPI FIFOCTL: RX_THRESHOLD Position */
#define SPI_FIFOCTL_RX_THRESHOLD_Msk   (7ul << SPI_FIFOCTL_RX_THRESHOLD_Pos)  /*!< SPI FIFOCTL: RX_THRESHOLD Mask */
#define SPI_FIFOCTL_TX_THRESHOLD_Pos   28                                     /*!< SPI FIFOCTL: TX_THRESHOLD Position */
#define SPI_FIFOCTL_TX_THRESHOLD_Msk   (7ul << SPI_FIFOCTL_TX_THRESHOLD_Pos)  /*!< SPI FIFOCTL: TX_THRESHOLD Mask */

/* SPI_STATUS Bit Field Definitions */
#define SPI_STATUS_BUSY_Pos            0                                       /*!< SPI STATUS: BUSY Position */
#define SPI_STATUS_BUSY_Msk            (1ul << SPI_STATUS_BUSY_Pos)            /*!< SPI STATUS: BUSY Mask */
#define SPI_STATUS_UNIT_INTSTS_Pos     1                                       /*!< SPI STATUS: UNIT_INTSTS Position */
#define SPI_STATUS_UNIT_INTSTS_Msk     (1ul << SPI_STATUS_UNIT_INTSTS_Pos)     /*!< SPI STATUS: UNIT_INTSTS Mask */
#define SPI_STATUS_SSACT_INTSTS_Pos    2                                       /*!< SPI STATUS: SSACT_INTSTS Position */
#define SPI_STATUS_SSACT_INTSTS_Msk    (1ul << SPI_STATUS_SSACT_INTSTS_Pos)    /*!< SPI STATUS: SSACT_INTSTS Mask */
#define SPI_STATUS_SSINA_INTSTS_Pos    3                                       /*!< SPI STATUS: SSINA_INTSTS Position */
#define SPI_STATUS_SSINA_INTSTS_Msk    (1ul << SPI_STATUS_SSINA_INTSTS_Pos)    /*!< SPI STATUS: SSINA_INTSTS Mask */
#define SPI_STATUS_SS_LINE_Pos         4                                       /*!< SPI STATUS: SS_LINE Position */
#define SPI_STATUS_SS_LINE_Msk         (1ul << SPI_STATUS_SS_LINE_Pos)         /*!< SPI STATUS: SS_LINE Mask */
#define SPI_STATUS_SLVTO_INTSTS_Pos    5                                       /*!< SPI STATUS: SLVTO_INTSTS Position */
#define SPI_STATUS_SLVTO_INTSTS_Msk    (1ul << SPI_STATUS_SLVTO_INTSTS_Pos)    /*!< SPI STATUS: SLVTO_INTSTS Mask */
#define SPI_STATUS_SLVER0_INTSTS_Pos   6                                       /*!< SPI STATUS: SLVER0_INTSTS Position */
#define SPI_STATUS_SLVER0_INTSTS_Msk   (1ul << SPI_STATUS_SLVER0_INTSTS_Pos)   /*!< SPI STATUS: SLVER0_INTSTS Mask */
#define SPI_STATUS_SLVER1_INTSTS_Pos   7                                       /*!< SPI STATUS: SLVER1_INTSTS Position */
#define SPI_STATUS_SLVER1_INTSTS_Msk   (1ul << SPI_STATUS_SLVER1_INTSTS_Pos)   /*!< SPI STATUS: SLVER1_INTSTS Mask */
#define SPI_STATUS_RX_EMPTY_Pos        8                                       /*!< SPI STATUS: RX_EMPTY Position */
#define SPI_STATUS_RX_EMPTY_Msk        (1ul << SPI_STATUS_RX_EMPTY_Pos)        /*!< SPI STATUS: RX_EMPTY Mask */
#define SPI_STATUS_RX_FULL_Pos         9                                       /*!< SPI STATUS: RX_FULL Position */
#define SPI_STATUS_RX_FULL_Msk         (1ul << SPI_STATUS_RX_FULL_Pos)         /*!< SPI STATUS: RX_FULL Mask */
#define SPI_STATUS_RXTH_INTSTS_Pos     10                                      /*!< SPI STATUS: RXTH_INTSTS Position */
#define SPI_STATUS_RXTH_INTSTS_Msk     (1ul << SPI_STATUS_RXTH_INTSTS_Pos)     /*!< SPI STATUS: RXTH_INTSTS Mask */
#define SPI_STATUS_RXOVR_INTSTS_Pos    11                                      /*!< SPI STATUS: RXOVR_INTSTS Position */
#define SPI_STATUS_RXOVR_INTSTS_Msk    (1ul << SPI_STATUS_RXOVR_INTSTS_Pos)    /*!< SPI STATUS: RXOVR_INTSTS Mask */
#define SPI_STATUS_RXTO_INTSTS_Pos     12                                      /*!< SPI STATUS: RXTO_INTSTS Position */
#define SPI_STATUS_RXTO_INTSTS_Msk     (1ul << SPI_STATUS_RXTO_INTSTS_Pos)     /*!< SPI STATUS: RXTO_INTSTS Mask */
#define SPI_STATUS_SPIEN_STS_Pos       15                                      /*!< SPI STATUS: SPIEN_STS Position */
#define SPI_STATUS_SPIEN_STS_Msk       (1ul << SPI_STATUS_SPIEN_STS_Pos)       /*!< SPI STATUS: SPIEN_STS Mask */
#define SPI_STATUS_TX_EMPTY_Pos        16                                      /*!< SPI STATUS: TX_EMPTY Position */
#define SPI_STATUS_TX_EMPTY_Msk        (1ul << SPI_STATUS_TX_EMPTY_Pos)        /*!< SPI STATUS: TX_EMPTY Mask */
#define SPI_STATUS_TX_FULL_Pos         17                                      /*!< SPI STATUS: TX_FULL Position */
#define SPI_STATUS_TX_FULL_Msk         (1ul << SPI_STATUS_TX_FULL_Pos)         /*!< SPI STATUS: TX_FULL Mask */
#define SPI_STATUS_TXTH_INTSTS_Pos     18                                      /*!< SPI STATUS: TXTH_INTSTS Position */
#define SPI_STATUS_TXTH_INTSTS_Msk     (1ul << SPI_STATUS_TXTH_INTSTS_Pos)     /*!< SPI STATUS: TXTH_INTSTS Mask */
#define SPI_STATUS_TXUDR_INTSTS_Pos    19                                      /*!< SPI STATUS: TXUDR_INTSTS Position */
#define SPI_STATUS_TXUDR_INTSTS_Msk    (1ul << SPI_STATUS_TXUDR_INTSTS_Pos)    /*!< SPI STATUS: TXUDR_INTSTS Mask */
#define SPI_STATUS_FFCLR_STS_Pos       23                                      /*!< SPI STATUS: FFCLR_STS Position */
#define SPI_STATUS_FFCLR_STS_Msk       (1ul << SPI_STATUS_FFCLR_STS_Pos)       /*!< SPI STATUS: FFCLR_STS Mask */
#define SPI_STATUS_RX_FIFO_COUNT_Pos   24                                      /*!< SPI STATUS: RX_FIFO_COUNT Position */
#define SPI_STATUS_RX_FIFO_COUNT_Msk   (0xFul << SPI_STATUS_RX_FIFO_COUNT_Pos) /*!< SPI STATUS: RX_FIFO_COUNT Mask */
#define SPI_STATUS_TX_FIFO_COUNT_Pos   28                                      /*!< SPI STATUS: TX_FIFO_COUNT Position */
#define SPI_STATUS_TX_FIFO_COUNT_Msk   (0xFul << SPI_STATUS_TX_FIFO_COUNT_Pos) /*!< SPI STATUS: TX_FIFO_COUNT Mask */

/*@}*/ /* end of group NUC400_SPI */


/*------------- UART -----------------------------*/
/** @addtogroup NUC400_UART NUC400 UART Control Register (UART)
  @{
*/
typedef struct {
    union {
        __IO uint32_t RBR;                        /*!< Offset: 0x0000   Receive Buffer Register                    */
        __IO uint32_t THR;                        /*!< Offset: 0x0000   Transmit Holding Register                  */
    };

