coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* I2C I2CON Bit Field Definitions */
#define I2C_I2CON_EI_Pos                        7                                       /*!< I2C I2CON: EI Position */
#define I2C_I2CON_EI_Msk                        (1ul << I2C_I2CON_EI_Pos)               /*!< I2C I2CON: EI Mask */

#define I2C_I2CON_ENS1_Pos                      6                                       /*!< I2C I2CON: ENS1 Position */
#define I2C_I2CON_ENS1_Msk                      (1ul << I2C_I2CON_ENS1_Pos)             /*!< I2C I2CON: ENS1 Mask */

#define I2C_I2CON_STA_Pos                       5                                       /*!< I2C I2CON: STA Position */
#define I2C_I2CON_STA_Msk                       (1ul << I2C_I2CON_STA_Pos)              /*!< I2C I2CON: STA Mask */

#define I2C_I2CON_STO_Pos                       4                                       /*!< I2C I2CON: STO Position */
#define I2C_I2CON_STO_Msk                       (1ul << I2C_I2CON_STO_Pos)              /*!< I2C I2CON: STO Mask */

#define I2C_I2CON_SI_Pos                        3                                       /*!< I2C I2CON: SI Position */
#define I2C_I2CON_SI_Msk                        (1ul << I2C_I2CON_SI_Pos)               /*!< I2C I2CON: SI Mask */

#define I2C_I2CON_AA_Pos                        2                                       /*!< I2C I2CON: AA Position */
#define I2C_I2CON_AA_Msk                        (1ul << I2C_I2CON_AA_Pos)               /*!< I2C I2CON: AA Mask */

/* I2C I2CADDR Bit Field Definitions */
#define I2C_I2CADDR_I2CADDR_Pos                 1                                       /*!< I2C I2CADDR: I2CADDR Position */
#define I2C_I2CADDR_I2CADDR_Msk                 (0x7Ful << I2C_I2CADDR_I2CADDR_Pos)     /*!< I2C I2CADDR: I2CADDR Mask */

#define I2C_I2CADDR_GC_Pos                      0                                       /*!< I2C I2CADDR: GC Position */
#define I2C_I2CADDR_GC_Msk                      (1ul << I2C_I2CADDR_GC_Pos)             /*!< I2C I2CADDR: GC Mask */

/* I2C I2CDAT Bit Field Definitions */
#define I2C_I2CDAT_I2CDAT_Pos                   0                                       /*!< I2C I2CDAT: I2CDAT Position */
#define I2C_I2CDAT_I2CDAT_Msk                   (0xFFul << I2C_I2CDAT_I2CDAT_Pos)       /*!< I2C I2CDAT: I2CDAT Mask */

/* I2C I2CSTATUS Bit Field Definitions */
#define I2C_I2CSTATUS_I2CSTATUS_Pos             0                                       /*!< I2C I2CSTATUS: I2CSTATUS Position */
#define I2C_I2CSTATUS_I2CSTATUS_Msk             (0xFFul << I2C_I2CSTATUS_I2CSTATUS_Pos) /*!< I2C I2CSTATUS: I2CSTATUS Mask */

/* I2C I2CLK Bit Field Definitions */
#define I2C_I2CLK_I2CLK_Pos                     0                                       /*!< I2C I2CLK: I2CLK Position */
#define I2C_I2CLK_I2CLK_Msk                     (0xFFul << I2C_I2CLK_I2CLK_Pos)         /*!< I2C I2CLK: I2CLK Mask */

/* I2C I2CTOC Bit Field Definitions */
#define I2C_I2CTOC_ENTI_Pos                     2                                       /*!< I2C I2CTOC: ENTI Position */
#define I2C_I2CTOC_ENTI_Msk                     (1ul << I2C_I2CTOC_ENTI_Pos)            /*!< I2C I2CTOC: ENTI Mask */

#define I2C_I2CTOC_DIV4_Pos                     1                                       /*!< I2C I2CTOC: DIV4 Position */
#define I2C_I2CTOC_DIV4_Msk                     (1ul << I2C_I2CTOC_DIV4_Pos)            /*!< I2C I2CTOC: DIV4 Mask */

#define I2C_I2CTOC_TIF_Pos                      0                                       /*!< I2C I2CTOC: TIF Position */
#define I2C_I2CTOC_TIF_Msk                      (1ul << I2C_I2CTOC_TIF_Pos)             /*!< I2C I2CTOC: TIF Mask */

/* I2C I2CADM Bit Field Definitions */
#define I2C_I2CADM_I2CADM_Pos                   1                                       /*!< I2C I2CADM: I2CADM Position */
#define I2C_I2CADM_I2CADM_Msk                   (0x7Ful << I2C_I2CADM_I2CADM_Pos)       /*!< I2C I2CADM: I2CADM Mask */

/* I2C I2CWKUPCON Bit Field Definitions */
#define I2C_I2CWKCON_WKUPEN_Pos                 0                                       /*!< I2C I2CWKUPCON: WKUPEN Position */
#define I2C_I2CWKCON_WKUPEN_Msk                 (1ul << I2C_I2CWKCON_WKUPEN_Pos)        /*!< I2C I2CWKUPCON: WKUPEN Mask */

/* I2C I2CWKUPSTS Bit Field Definitions */
#define I2C_I2CWKSTS_WKUPIF_Pos                 0                                       /*!< I2C I2CWKUPSTS: WKUPIF Position */
#define I2C_I2CWKSTS_WKUPIF_Msk                 (1ul << I2C_I2CWKSTS_WKUPIF_Pos)        /*!< I2C I2CWKUPSTS: WKUPIF Mask */

/*@}*/ /* end of group NUC400_I2C */

/*------------- Smart Card Control Register (SC) -----------------------------*/
/** @addtogroup NUC400_SC NUC400 Smart Card Control Register (SC)
  @{
*/
/**
  * @brief SC register map
  */
typedef struct {
    union {
        __I  uint32_t  RBR;                         /*!< Offset: 0x0000  SC Receiving Buffer Register                          */
        __O  uint32_t  THR;                         /*!< Offset: 0x0000  SC Transmit Holding Register                          */
    };
    __IO uint32_t  CTL;                         /*!< Offset: 0x0004  SC Control Register                                   */
    __IO uint32_t  ALTCTL;                      /*!< Offset: 0x0008  SC Alternate Control State Register                   */
    __IO uint32_t  EGTR;                        /*!< Offset: 0x000C  SC Extend Guard Time Register                         */
    __IO uint32_t  RFTMR;                       /*!< Offset: 0x0010  SC Receiver Buffer Time-Out Register                  */
    __IO uint32_t  ETUCR;                       /*!< Offset: 0x0014  SC ETU Control Register                               */
    __IO uint32_t  IER;                         /*!< Offset: 0x0018  SC Interrupt Enable Register                          */
    __IO uint32_t  ISR;                         /*!< Offset: 0x001C  SC Interrupt Status Register (Read Only)              */
    __IO uint32_t  SR;                          /*!< Offset: 0x0020  SC Status Register (Read Only)                        */
    __IO uint32_t  PINCSR;                      /*!< Offset: 0x0024  SC Pin Control State Register                         */
    __IO uint32_t  TMR0;                        /*!< Offset: 0x0028  SC Internal Timer Control Register 0                  */
    __IO uint32_t  TMR1;                        /*!< Offset: 0x002C  SC Internal Timer Control Register 1                  */
    __IO uint32_t  TMR2;                        /*!< Offset: 0x0030  SC Internal Timer Control Register 2                  */
    __IO uint32_t  UACTL;                       /*!< Offset: 0x0034  SC UART Control Register                              */
    __I  uint32_t  TDRA;                        /*!< Offset: 0x0038  SC Timer Current Data Register A                      */
    __I  uint32_t  TDRB;                        /*!< Offset: 0x003C  SC Timer Current Data Register B                      */
} SC_T;


/* SC RBR Bit Field Definitions */
#define SC_RBR_RBR_Pos                      0                                /*!< SC RBR: RBR Position */
#define SC_RBR_RBR_Msk                      (0xFFul << SC_RBR_RBR_Pos)       /*!< SC RBR: RBR Mask     */

