coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SC_SR_RX_ATV_Pos                  23                                /*!< SC SR: RX_ATV Position */
#define SC_SR_RX_ATV_Msk                  (1ul << SC_SR_RX_ATV_Pos)         /*!< SC SR: RX_ATV Mask     */

#define SC_SR_RX_OVER_REERR_Pos           22                                /*!< SC SR: RX_OVER_REERR Position */
#define SC_SR_RX_OVER_REERR_Msk           (1ul << SC_SR_RX_OVER_REERR_Pos)  /*!< SC SR: RX_OVER_REERR Mask     */

#define SC_SR_RX_REERR_Pos                21                                /*!< SC SR: RX_REERR Position */
#define SC_SR_RX_REERR_Msk                (1ul << SC_SR_RX_REERR_Pos)       /*!< SC SR: RX_REERR Mask     */

#define SC_SR_RX_POINT_F_Pos              16                                /*!< SC SR: RX_POINT_F Position */
#define SC_SR_RX_POINT_F_Msk              (7ul << SC_SR_RX_POINT_F_Pos)     /*!< SC SR: RX_POINT_F Mask     */

#define SC_SR_CD_PIN_ST_Pos               13                                /*!< SC SR: CD_PIN_ST Position */
#define SC_SR_CD_PIN_ST_Msk               (1ul << SC_SR_CD_PIN_ST_Pos)      /*!< SC SR: CD_PIN_ST Mask     */

#define SC_SR_CD_INS_F_Pos                12                                /*!< SC SR: CD_INS_F Position */
#define SC_SR_CD_INS_F_Msk                (1ul << SC_SR_CD_INS_F_Pos)       /*!< SC SR: CD_INS_F Mask     */

#define SC_SR_CD_REM_F_Pos                11                                /*!< SC SR: CD_REM_F Position */
#define SC_SR_CD_REM_F_Msk                (1ul << SC_SR_CD_REM_F_Pos)       /*!< SC SR: CD_REM_F Mask     */

#define SC_SR_TX_FULL_F_Pos               10                                /*!< SC SR: TX_FULL_F Position */
#define SC_SR_TX_FULL_F_Msk               (1ul << SC_SR_TX_FULL_F_Pos)      /*!< SC SR: TX_FULL_F Mask     */

#define SC_SR_TX_EMPTY_F_Pos              9                                 /*!< SC SR: TX_EMPTY_F Position */
#define SC_SR_TX_EMPTY_F_Msk              (1ul << SC_SR_TX_EMPTY_F_Pos)     /*!< SC SR: TX_EMPTY_F Mask     */

#define SC_SR_TX_OVER_F_Pos               8                                 /*!< SC SR: TX_OVER_F Position */
#define SC_SR_TX_OVER_F_Msk               (1ul << SC_SR_TX_OVER_F_Pos)      /*!< SC SR: TX_OVER_F Mask     */

#define SC_SR_RX_EBR_F_Pos                6                                 /*!< SC SR: RX_EBR_F Position */
#define SC_SR_RX_EBR_F_Msk                (1ul << SC_SR_RX_EBR_F_Pos)       /*!< SC SR: RX_EBR_F Mask     */

#define SC_SR_RX_EFR_F_Pos                5                                 /*!< SC SR: RX_EFR_F Position */
#define SC_SR_RX_EFR_F_Msk                (1ul << SC_SR_RX_EFR_F_Pos)       /*!< SC SR: RX_EFR_F Mask     */

#define SC_SR_RX_EPA_F_Pos                4                                 /*!< SC SR: RX_EPA_F Position */
#define SC_SR_RX_EPA_F_Msk                (1ul << SC_SR_RX_EPA_F_Pos)       /*!< SC SR: RX_EPA_F Mask     */

#define SC_SR_RX_FULL_F_Pos               2                                 /*!< SC SR: RX_FULL_F Position */
#define SC_SR_RX_FULL_F_Msk               (1ul << SC_SR_RX_FULL_F_Pos)      /*!< SC SR: RX_FULL_F Mask     */

#define SC_SR_RX_EMPTY_F_Pos              1                                 /*!< SC SR: RX_EMPTY_F Position */
#define SC_SR_RX_EMPTY_F_Msk              (1ul << SC_SR_RX_EMPTY_F_Pos)     /*!< SC SR: RX_EMPTY_F Mask     */

#define SC_SR_RX_OVER_F_Pos               0                                 /*!< SC SR: RX_OVER_F Position */
#define SC_SR_RX_OVER_F_Msk               (1ul << SC_SR_RX_OVER_F_Pos)      /*!< SC SR: RX_OVER_F Mask     */

/* SC PINCSR Bit Field Definitions */
#define SC_PINCSR_SYNC_Pos                  30                                  /*!< SC PINCSR: SYNC Position */
#define SC_PINCSR_SYNC_Msk                  (1ul << SC_PINCSR_SYNC_Pos)         /*!< SC PINCSR: SYNC Mask     */

#define SC_PINCSR_RST_ST_Pos                18                                  /*!< SC PINCSR: RST_ST Position */
#define SC_PINCSR_RST_ST_Msk                (1ul << SC_PINCSR_RST_ST_Pos)       /*!< SC PINCSR: RST_ST Mask     */

#define SC_PINCSR_PWR_ST_Pos                17                                  /*!< SC PINCSR: PWR_ST Position */
#define SC_PINCSR_PWR_ST_Msk                (1ul << SC_PINCSR_PWR_ST_Pos)       /*!< SC PINCSR: PWR_ST Mask     */

#define SC_PINCSR_DAT_ST_Pos                16                                  /*!< SC PINCSR: DAT_ST Position */
#define SC_PINCSR_DAT_ST_Msk                (1ul << SC_PINCSR_DAT_ST_Pos)       /*!< SC PINCSR: DAT_ST Mask     */

#define SC_PINCSR_POW_INV_Pos               11                                  /*!< SC PINCSR: POW_INV Position */
#define SC_PINCSR_POW_INV_Msk               (1ul << SC_PINCSR_POW_INV_Pos)      /*!< SC PINCSR: POW_INV Mask     */

#define SC_PINCSR_SC_DATA_O_Pos             9                                   /*!< SC PINCSR: SC_DATA_O Position */
#define SC_PINCSR_SC_DATA_O_Msk             (1ul << SC_PINCSR_SC_DATA_O_Pos)    /*!< SC PINCSR: SC_DATA_O Mask     */

#define SC_PINCSR_SC_OEN_ST_Pos             8                                   /*!< SC PINCSR: SC_OEN_ST Position */
#define SC_PINCSR_SC_OEN_ST_Msk             (1ul << SC_PINCSR_SC_OEN_ST_Pos)    /*!< SC PINCSR: SC_OEN_ST Mask     */

#define SC_PINCSR_CLK_KEEP_Pos              6                                   /*!< SC PINCSR: CLK_KEEP Position */
#define SC_PINCSR_CLK_KEEP_Msk              (1ul << SC_PINCSR_CLK_KEEP_Pos)     /*!< SC PINCSR: CLK_KEEP Mask     */

#define SC_PINCSR_SC_RST_Pos                1                                   /*!< SC PINCSR: SC_RST Position */
#define SC_PINCSR_SC_RST_Msk                (1ul << SC_PINCSR_SC_RST_Pos)       /*!< SC PINCSR: SC_RST Mask     */

#define SC_PINCSR_POW_EN_Pos                0                                   /*!< SC PINCSR: POW_EN Position */
#define SC_PINCSR_POW_EN_Msk                (1ul << SC_PINCSR_POW_EN_Pos)       /*!< SC PINCSR: POW_EN Mask     */

/* SC TMR0 Bit Field Definitions */
#define SC_TMR0_MODE_Pos                    24                              /*!< SC TMR0: MODE Position */
#define SC_TMR0_MODE_Msk                    (0xFul << SC_TMR0_MODE_Pos)     /*!< SC TMR0: MODE Mask     */

#define SC_TMR0_CNT_Pos                     0                               /*!< SC TMR0: CNT Position */
#define SC_TMR0_CNT_Msk                     (0xFFFFFFul << SC_TMR0_CNT_Pos) /*!< SC TMR0: CNT Mask     */

/* SC TMR1 Bit Field Definitions */
#define SC_TMR1_MODE_Pos                    24                              /*!< SC TMR1: MODE Position */
#define SC_TMR1_MODE_Msk                    (0xFul << SC_TMR1_MODE_Pos)     /*!< SC TMR1: MODE Mask     */

#define SC_TMR1_CNT_Pos                     0                               /*!< SC TMR1: CNT Position */
#define SC_TMR1_CNT_Msk                     (0xFFul << SC_TMR1_CNT_Pos)     /*!< SC TMR1: CNT Mask     */

/* SC TMR2 Bit Field Definitions */
#define SC_TMR2_MODE_Pos                    24                              /*!< SC TMR2: MODE Position */
#define SC_TMR2_MODE_Msk                    (0xFul << SC_TMR2_MODE_Pos)     /*!< SC TMR2: MODE Mask     */

