coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define SC_TMR2_CNT_Pos                     0                               /*!< SC TMR2: CNT Position */
#define SC_TMR2_CNT_Msk                     (0xFFul << SC_TMR2_CNT_Pos)     /*!< SC TMR2: CNT Mask     */

/* SC UACTL Bit Field Definitions */
#define SC_UACTL_OPE_Pos                    7                               /*!< SC UACTL: OPE Position */
#define SC_UACTL_OPE_Msk                    (0x1ul << SC_UACTL_OPE_Pos)     /*!< SC UACTL: OPE Mask     */

#define SC_UACTL_PBDIS_Pos                  6                               /*!< SC UACTL: PBDIS Position */
#define SC_UACTL_PBDIS_Msk                  (0x1ul << SC_UACTL_PBDIS_Pos)   /*!< SC UACTL: PBDIS Mask     */

#define SC_UACTL_DATA_LEN_Pos               5                                   /*!< SC UACTL: DATA_LEN Position */
#define SC_UACTL_DATA_LEN_Msk               (0x1ul << SC_UACTL_DATA_LEN_Pos)    /*!< SC UACTL: DATA_LEN Mask     */

#define SC_UACTL_UA_MODE_EN_Pos             0                                   /*!< SC UACTL: UA_MODE_EN Position */
#define SC_UACTL_UA_MODE_EN_Msk             (0x1ul << SC_UACTL_UA_MODE_EN_Pos)  /*!< SC UACTL: UA_MODE_EN Mask     */

/* SC TDRA Bit Field Definitions */
#define SC_TDRA_TDR0_Pos                    0                                   /*!< SC TDRA: TDR0 Position */
#define SC_TDRA_TDR0_Msk                    (0xFFFFFFul << SC_TDRA_TDR0_Pos)    /*!< SC TDRA: TDR0 Mask     */

/* SC TDRB Bit Field Definitions */
#define SC_TDRB_TDR2_Pos                    8                               /*!< SC TDRB: TDR2 Position */
#define SC_TDRB_TDR2_Msk                    (0xFFul << SC_TDRB_TDR2_Pos)    /*!< SC TDRB: TDR2 Mask     */

#define SC_TDRB_TDR1_Pos                    0                               /*!< SC TDRB: TDR1 Position */
#define SC_TDRB_TDR1_Msk                    (0xFFul << SC_TDRB_TDR1_Pos)    /*!< SC TDRB: TDR1 Mask     */

/*@}*/ /* end of group NUC400_SC */

/*--------------------------- C_CAN Controller (CAN) --------------------------*/
/** @addtogroup NUC400_CAN NUC400 C_CAN Control Register (CAN)
  @{
*/
typedef struct {
    __IO uint32_t CREQ;            /*!< Offset: 0x0000   IFn Command Request Registers */
    __IO uint32_t CMASK;           /*!< Offset: 0x0004   IFn Command Mask Registers    */
    __IO uint32_t MASK1;           /*!< Offset: 0x0008   IFn Mask 1 Register           */
    __IO uint32_t MASK2;           /*!< Offset: 0x000C   IFn Mask 2 Register           */
    __IO uint32_t ARB1;            /*!< Offset: 0x0010   IFn Arbitration 1 Register    */
    __IO uint32_t ARB2;            /*!< Offset: 0x0014   IFn Arbitration 2 Register    */
    __IO uint32_t MCON;            /*!< Offset: 0x0018   IFn Message Control Registers */
    __IO uint32_t DAT_A1;          /*!< Offset: 0x001C   IFn Data A1 Registers         */
    __IO uint32_t DAT_A2;          /*!< Offset: 0x0020   IFn Data A2 Registers         */
    __IO uint32_t DAT_B1;          /*!< Offset: 0x0024   IFn Data B1 Registers         */
    __IO uint32_t DAT_B2;          /*!< Offset: 0x0028   IFn Data B2 Registers         */
    __I uint32_t RESERVE0[13];

} CAN_IF_T;

typedef struct {
    __IO uint32_t CON;                        /*!< Offset: 0x0000   CAN Control Register                                  */
    __IO uint32_t STATUS;                        /*!< Offset: 0x0004   CAN Status Register                                   */
    __IO uint32_t ERR;                        /*!< Offset: 0x0008   Error Counter Register                               */
    __IO uint32_t BTIME;                        /*!< Offset: 0x000C   Bit Timing Register                                   */
    __IO uint32_t IIDR;                        /*!< Offset: 0x0010   Interrupt Identifier Register                      */
    __IO uint32_t TEST;                        /*!< Offset: 0x0014   Test Register                                       */
    __IO uint32_t BRPE;                        /*!< Offset: 0x0018   BRP Extension Register                               */
    __I  uint32_t RESERVED0[1];                /*!< Offset: 0x001C   Reserved                                           */
    CAN_IF_T      IF[2];                        /*!< Offset: 0x0020      IF1 Registers */
    /*!< Offset: 0x0080      IF2 Registers */
    uint32_t RESERVED1[8];                /*!< Offset: 0x00AC ~ 0x00FC   Reserved                                  */
    __I  uint32_t TXREQ1;                        /*!< Offset: 0x0100   Transmission Request Registers 1                     */
    __I  uint32_t TXREQ2;                        /*!< Offset: 0x0104   Transmission Request Registers 2                      */
    uint32_t RESERVED2[6];                /*!< Offset: 0x0108 ~ 0x011C   Reserved                                  */
    __I  uint32_t NDAT1;                        /*!< Offset: 0x0120   New Data Registers 1                                  */
    __I  uint32_t NDAT2;                        /*!< Offset: 0x0124   New Data Registers 2                                  */
    uint32_t RESERVED3[6];                /*!< Offset: 0x0128 ~ 0x013C   Reserved                                  */
    __I  uint32_t IPND1;                        /*!< Offset: 0x0140   Interrupt Pending Registers 1                      */
    __I  uint32_t IPND2;                        /*!< Offset: 0x0144   Interrupt Pending Registers 2                      */
    uint32_t RESERVED4[6];                /*!< Offset: 0x0148 ~ 0x015C   Reserved                                  */
    __I  uint32_t MVLD1;                        /*!< Offset: 0x0160   Message Valid Registers 1                          */
    __I  uint32_t MVLD2;                        /*!< Offset: 0x0164   Message Valid Registers 1                          */
    __IO uint32_t WU_IE;                        /*!< Offset: 0x0168   Wake Up Function Enable Registers                  */
    __IO uint32_t WU_STATUS;                    /*!< Offset: 0x016C   Wake Up Function Status Registers                  */
} CAN_T;

/* CAN CON Bit Field Definitions */
#define CAN_CON_TEST_Pos           7                                    /*!< CAN CON: TEST Position */
#define CAN_CON_TEST_Msk           (1ul << CAN_CON_TEST_Pos)            /*!< CAN CON: TEST Mask     */

#define CAN_CON_CCE_Pos            6                                    /*!< CAN CON: CCE Position  */
#define CAN_CON_CCE_Msk            (1ul << CAN_CON_CCE_Pos)             /*!< CAN CON: CCE Mask      */

#define CAN_CON_DAR_Pos            5                                    /*!< CAN CON: DAR Position  */
#define CAN_CON_DAR_Msk            (1ul << CAN_CON_DAR_Pos)             /*!< CAN CON: DAR Mask      */

#define CAN_CON_EIE_Pos            3                                    /*!< CAN CON: EIE Position  */
#define CAN_CON_EIE_Msk            (1ul << CAN_CON_EIE_Pos)             /*!< CAN CON: EIE Mask      */

#define CAN_CON_SIE_Pos            2                                    /*!< CAN CON: SIE Position  */
#define CAN_CON_SIE_Msk            (1ul << CAN_CON_SIE_Pos)             /*!< CAN CON: SIE Mask      */

