coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/*------------- Cryptographic Accelerator Register (CRYPTO) -----------------------------*/
/** @addtogroup NUC400_CRYPTO NUC400 Cryptographic Accelerator Controller (CRYPTO)
  @{
*/
typedef struct {
    __IO uint32_t CRYPTO_INT_EN;              /*!< Offset: 0x0000   CRYPTO interrupt enable                             */
    __IO uint32_t CRYPTO_INT_FLAG;            /*!< Offset: 0x0004   CRYPTO interrupt flag                               */
    __IO uint32_t PRNG_CTL;                   /*!< Offset: 0x0008   PRNG  control register                             */
    __IO uint32_t PRNG_SEED;                  /*!< Offset: 0x000C   Store  random seed                                 */
    __IO uint32_t PRNG_key0;                  /*!< Offset: 0x0010   PRNG  generated  Key0                              */
    __IO uint32_t PRNG_key1;                  /*!< Offset: 0x0014   PRNG  generated  Key1                              */
    __IO uint32_t PRNG_key2;                  /*!< Offset: 0x0018   PRNG  generated  Key2                              */
    __IO uint32_t PRNG_key3;                  /*!< Offset: 0x001C   PRNG  generated  Key3                              */
    __IO uint32_t PRNG_key4;                  /*!< Offset: 0x0020   PRNG  generated  Key4                              */
    __IO uint32_t PRNG_key5;                  /*!< Offset: 0x0024   PRNG  generated  Key5                              */
    __IO uint32_t PRNG_key6;                  /*!< Offset: 0x0028   PRNG  generated  Key6                              */
    __IO uint32_t PRNG_key7;                  /*!< Offset: 0x002C   PRNG  generated  Key7                              */
    uint32_t RESERVED1[8];               /*!< Offset: 0x0030 ~ 0x004C   Reserved                                  */
    __IO uint32_t AES_FEEDBACK_0;             /*!< Offset: 0x0050   AES engine 0 Output feedback data after cryptographic operation */
    __IO uint32_t AES_FEEDBACK_1;             /*!< Offset: 0x0054   AES engine 1 Output feedback data after cryptographic operation */
    __IO uint32_t AES_FEEDBACK_2;             /*!< Offset: 0x0058   AES engine 2 Output feedback data after cryptographic operation */
    __IO uint32_t AES_FEEDBACK_3;             /*!< Offset: 0x005C   AES engine 3 Output feedback data after cryptographic operation */
    __IO uint32_t TDES_FEEDBACK_H;            /*!< Offset: 0x0060   Triple DES engine Output higher feedback data after cryptographic operation */
    __IO uint32_t TDES_FEEDBACK_L;            /*!< Offset: 0x0064   Triple DES engine Output lower feedback data after cryptographic operation */
    uint32_t RESERVED2[38];              /*!< Offset: 0x0068 ~ 0x00FC   Reserved                                  */
    __IO uint32_t AES_CTL;                    /*!< Offset: 0x0100   AES engine setting                                 */
    __IO uint32_t AES_FLAG;                   /*!< Offset: 0x0104   AES engine flag                                    */
    __IO uint32_t AES_DATAIN;                 /*!< Offset: 0x0108   AES engine data input port                         */
    __IO uint32_t AES_DATAOUT;                /*!< Offset: 0x010C   AES engine data output port                        */
    __IO uint32_t AES0_KEY_0;                 /*!< Offset: 0x0110   AES0 Key Word 0 Register                            */
    __IO uint32_t AES0_KEY_1;                 /*!< Offset: 0x0114   AES0 Key Word 1 Register                            */
    __IO uint32_t AES0_KEY_2;                 /*!< Offset: 0x0118   AES0 Key Word 2 Register                            */
    __IO uint32_t AES0_KEY_3;                 /*!< Offset: 0x011C   AES0 Key Word 3 Register                            */
    __IO uint32_t AES0_KEY_4;                 /*!< Offset: 0x0120   AES0 Key Word 4 Register                            */
    __IO uint32_t AES0_KEY_5;                 /*!< Offset: 0x0124   AES0 Key Word 5 Register                            */
    __IO uint32_t AES0_KEY_6;                 /*!< Offset: 0x0128   AES0 Key Word 6 Register                            */
    __IO uint32_t AES0_KEY_7;                 /*!< Offset: 0x012C   AES0 Key Word 7 Register                            */
    __IO uint32_t AES0_IV0;                   /*!< Offset: 0x0130   AES0 Initial Vector Word 0 Register                 */
    __IO uint32_t AES0_IV1;                   /*!< Offset: 0x0134   AES0 Initial Vector Word 1 Register                 */
    __IO uint32_t AES0_IV2;                   /*!< Offset: 0x0138   AES0 Initial Vector Word 2 Register                 */
    __IO uint32_t AES0_IV3;                   /*!< Offset: 0x013C   AES0 Initial Vector Word 3 Register                 */
    __IO uint32_t AES0_SADR;                  /*!< Offset: 0x0140   AES0 Source Address Register                        */
    __IO uint32_t AES0_DADR;                  /*!< Offset: 0x0144   AES0 Destination Address Register                   */
    __IO uint32_t AES0_CNT;                   /*!< Offset: 0x0148   AES0 Byte Count Register                            */
    __IO uint32_t AES1_KEY_0;                 /*!< Offset: 0x014C   AES1 Key Word 0 Register                           */
    __IO uint32_t AES1_KEY_1;                 /*!< Offset: 0x0150   AES1 Key Word 1 Register                           */
    __IO uint32_t AES1_KEY_2;                 /*!< Offset: 0x0154   AES1 Key Word 2 Register                           */
    __IO uint32_t AES1_KEY_3;                 /*!< Offset: 0x0158   AES1 Key Word 3 Register                           */
    __IO uint32_t AES1_KEY_4;                 /*!< Offset: 0x015C   AES1 Key Word 4 Register                           */
    __IO uint32_t AES1_KEY_5;                 /*!< Offset: 0x0160   AES1 Key Word 5 Register                           */
    __IO uint32_t AES1_KEY_6;                 /*!< Offset: 0x0164   AES1 Key Word 6 Register                           */
    __IO uint32_t AES1_KEY_7;                 /*!< Offset: 0x0168   AES1 Key Word 7 Register                           */
    __IO uint32_t AES1_IV0;                   /*!< Offset: 0x016C   AES1 Initial Vector Word 0 Register                */
    __IO uint32_t AES1_IV1;                   /*!< Offset: 0x0170   AES1 Initial Vector Word 1 Register                */
    __IO uint32_t AES1_IV2;                   /*!< Offset: 0x0174   AES1 Initial Vector Word 2 Register                */
    __IO uint32_t AES1_IV3;                   /*!< Offset: 0x0178   AES1 Initial Vector Word 3 Register                */
    __IO uint32_t AES1_SADR;                  /*!< Offset: 0x017C   AES1 Source Address Register                       */
    __IO uint32_t AES1_DADR;                  /*!< Offset: 0x0180   AES1 Destination Address Register                  */
    __IO uint32_t AES1_CNT;                   /*!< Offset: 0x0184   AES1 Byte Count Register                           */
    __IO uint32_t AES2_KEY_0;                 /*!< Offset: 0x0188   AES2 Key Word 0 Register                           */
    __IO uint32_t AES2_KEY_1;                 /*!< Offset: 0x018C   AES2 Key Word 1 Register                           */
    __IO uint32_t AES2_KEY_2;                 /*!< Offset: 0x0190   AES2 Key Word 2 Register                           */
    __IO uint32_t AES2_KEY_3;                 /*!< Offset: 0x0194   AES2 Key Word 3 Register                           */
    __IO uint32_t AES2_KEY_4;                 /*!< Offset: 0x0198   AES2 Key Word 4 Register                           */
    __IO uint32_t AES2_KEY_5;                 /*!< Offset: 0x019C   AES2 Key Word 5 Register                           */
    __IO uint32_t AES2_KEY_6;                 /*!< Offset: 0x01A0   AES2 Key Word 6 Register                           */
    __IO uint32_t AES2_KEY_7;                 /*!< Offset: 0x01A4   AES2 Key Word 7 Register                           */
    __IO uint32_t AES2_IV0;                   /*!< Offset: 0x01A8   AES2 Initial Vector Word 0 Register                */
    __IO uint32_t AES2_IV1;                   /*!< Offset: 0x01AC   AES2 Initial Vector Word 1 Register                */
    __IO uint32_t AES2_IV2;                   /*!< Offset: 0x01B0   AES2 Initial Vector Word 2 Register                */
    __IO uint32_t AES2_IV3;                   /*!< Offset: 0x01B4   AES2 Initial Vector Word 3 Register                */
    __IO uint32_t AES2_SADR;                  /*!< Offset: 0x01B8   AES2 Source Address Register                       */
    __IO uint32_t AES2_DADR;                  /*!< Offset: 0x01BC   AES2 Destination Address Register                  */
    __IO uint32_t AES2_CNT;                   /*!< Offset: 0x01C0   AES2 Byte Count Register                           */
    __IO uint32_t AES3_KEY_0;                 /*!< Offset: 0x01C4   AES3 Key Word 0 Register                           */
    __IO uint32_t AES3_KEY_1;                 /*!< Offset: 0x01C8   AES3 Key Word 1 Register                           */
    __IO uint32_t AES3_KEY_2;                 /*!< Offset: 0x01CC   AES3 Key Word 2 Register                           */
    __IO uint32_t AES3_KEY_3;                 /*!< Offset: 0x01D0   AES3 Key Word 3 Register                           */
    __IO uint32_t AES3_KEY_4;                 /*!< Offset: 0x01D4   AES3 Key Word 4 Register                           */
    __IO uint32_t AES3_KEY_5;                 /*!< Offset: 0x01D8   AES3 Key Word 5 Register                           */
    __IO uint32_t AES3_KEY_6;                 /*!< Offset: 0x01DC   AES3 Key Word 6 Register                           */
    __IO uint32_t AES3_KEY_7;                 /*!< Offset: 0x01E0   AES3 Key Word 7 Register                           */
    __IO uint32_t AES3_IV0;                   /*!< Offset: 0x01E4   AES3 Initial Vector Word 0 Register                */
    __IO uint32_t AES3_IV1;                   /*!< Offset: 0x01E8   AES3 Initial Vector Word 1 Register                */
    __IO uint32_t AES3_IV2;                   /*!< Offset: 0x01EC   AES3 Initial Vector Word 2 Register                */
    __IO uint32_t AES3_IV3;                   /*!< Offset: 0x01F0   AES3 Initial Vector Word 3 Register                */
    __IO uint32_t AES3_SADR;                  /*!< Offset: 0x01F4   AES3 Source Address Register                       */
    __IO uint32_t AES3_DADR;                  /*!< Offset: 0x01F8   AES3 Destination Address Register                  */
    __IO uint32_t AES3_CNT;                   /*!< Offset: 0x01FC   AES3 Byte Count Register                           */
    __IO uint32_t TDES_CTL;                   /*!< Offset: 0x0200   TDES engine parameter  setting                     */
    __IO uint32_t TDES_FLAG;                  /*!< Offset: 0x0204   TDES flag setting                                  */
    __IO uint32_t TDES0_KEY1H;                /*!< Offset: 0x0208   TDES0 Key 1 Higher Word Register                */
    __IO uint32_t TDES0_KEY1L;                /*!< Offset: 0x020C   TDES0 Key 1 Lower Word Register                 */
    __IO uint32_t TDES0_KEY2H;                /*!< Offset: 0x0210   TDES0 Key 2 Higher Word Register                    */
    __IO uint32_t TDES0_KEY2L;                /*!< Offset: 0x0214   TDES0 Key 2 Lower Word Register                     */
    __IO uint32_t TDES0_KEY3H;                /*!< Offset: 0x0218   TDES0 Key 3 Higher Word Register                    */
    __IO uint32_t TDES0_KEY3L;                /*!< Offset: 0x021C   TDES0 Key 3 Lower Word Register                     */
    __IO uint32_t TDES0_IVH;                  /*!< Offset: 0x0220   TDES0 Initial Vector Higher Word Register           */
    __IO uint32_t TDES0_IVL;                  /*!< Offset: 0x0224   TDES0 Initial Vector Lower Word Register            */
    __IO uint32_t TDES0_SADR;                 /*!< Offset: 0x0228   TDES0 Source Address Register                   */
    __IO uint32_t TDES0_DADR;                 /*!< Offset: 0x022C   TDES0 Destination Address Register              */
    __IO uint32_t TDES0_CNT;                  /*!< Offset: 0x0230   TDES0 Block Count Register                      */
    __IO uint32_t TDES_DATAIN;                /*!< Offset: 0x0234   TDES engine Input Word data Register           */
    __IO uint32_t TDES_DATAOUT;               /*!< Offset: 0x0238   TDES engine Output Word data Register          */
    uint32_t RESERVED3[3];               /*!< Offset: 0x023C ~ 0x0244   Reserved                                  */
    __IO uint32_t TDES1_KEY1H;                /*!< Offset: 0x0248   TDES1 Key 1 Higher Word Register                */
    __IO uint32_t TDES1_KEY1L;                /*!< Offset: 0x024C   TDES1 Key 1 Lower Word Register                 */
    __IO uint32_t TDES1_KEY2H;                /*!< Offset: 0x0250   TDES1 Key 2 Higher Word Register                    */
    __IO uint32_t TDES1_KEY2L;                /*!< Offset: 0x0254   TDES1 Key 2 Lower Word Register                     */
    __IO uint32_t TDES1_KEY3H;                /*!< Offset: 0x0258   TDES1 Key 3 Higher Word Register                    */
    __IO uint32_t TDES1_KEY3L;                /*!< Offset: 0x025C   TDES1 Key 3 Lower Word Register                     */
    __IO uint32_t TDES1_IVH;                  /*!< Offset: 0x0260   TDES1 Initial Vector Higher Word Register           */
    __IO uint32_t TDES1_IVL;                  /*!< Offset: 0x0264   TDES1 Initial Vector Lower Word Register            */
    __IO uint32_t TDES1_SADR;                 /*!< Offset: 0x0268   TDES1 Source Address Register                   */
    __IO uint32_t TDES1_DADR;                 /*!< Offset: 0x026C   TDES1 Destination Address Register              */
    __IO uint32_t TDES1_CNT;                  /*!< Offset: 0x0270   TDES1 Block Count Register                      */
    uint32_t RESERVED4[5];               /*!< Offset: 0x0274 ~ 0x0284   Reserved                                  */
    __IO uint32_t TDES2_KEY1H;                /*!< Offset: 0x0288   TDES2 Key 1 Higher Word Register                */
    __IO uint32_t TDES2_KEY1L;                /*!< Offset: 0x028C   TDES2 Key 1 Lower Word Register                 */
    __IO uint32_t TDES2_KEY2H;                /*!< Offset: 0x0290   TDES2 Key 2 Higher Word Register                    */
    __IO uint32_t TDES2_KEY2L;                /*!< Offset: 0x0294   TDES2 Key 2 Lower Word Register                     */
    __IO uint32_t TDES2_KEY3H;                /*!< Offset: 0x0298   TDES2 Key 3 Higher Word Register                    */
    __IO uint32_t TDES2_KEY3L;                /*!< Offset: 0x029C   TDES2 Key 3 Lower Word Register                     */
    __IO uint32_t TDES2_IVH;                  /*!< Offset: 0x02A0   TDES2 Initial Vector Higher Word Register           */
    __IO uint32_t TDES2_IVL;                  /*!< Offset: 0x02A4   TDES2 Initial Vector Lower Word Register            */
    __IO uint32_t TDES2_SADR;                 /*!< Offset: 0x02A8   TDES2 Source Address Register                   */
    __IO uint32_t TDES2_DADR;                 /*!< Offset: 0x02AC   TDES2 Destination Address Register              */
    __IO uint32_t TDES2_CNT;                  /*!< Offset: 0x02B0   TDES2 Block Count Register                      */
    uint32_t RESERVED5[5];               /*!< Offset: 0x02B4 ~ 0x02C4   Reserved                                  */
    __IO uint32_t TDES3_KEY1H;                /*!< Offset: 0x02C8   TDES3 Key 1 Higher Word Register                */
    __IO uint32_t TDES3_KEY1L;                /*!< Offset: 0x02CC   TDES3 Key 1 Lower Word Register                 */
    __IO uint32_t TDES3_KEY2H;                /*!< Offset: 0x02D0   TDES3 Key 2 Higher Word Register                    */
    __IO uint32_t TDES3_KEY2L;                /*!< Offset: 0x02D4   TDES3 Key 2 Lower Word Register                     */
    __IO uint32_t TDES3_KEY3H;                /*!< Offset: 0x02D8   TDES3 Key 3 Higher Word Register                    */
    __IO uint32_t TDES3_KEY3L;                /*!< Offset: 0x02DC   TDES3 Key 3 Lower Word Register                     */
    __IO uint32_t TDES3_IVH;                  /*!< Offset: 0x02E0   TDES3 Initial Vector Higher Word Register           */
    __IO uint32_t TDES3_IVL;                  /*!< Offset: 0x02E4   TDES3 Initial Vector Lower Word Register            */
    __IO uint32_t TDES3_SADR;                 /*!< Offset: 0x02E8   TDES3 Source Address Register                   */
    __IO uint32_t TDES3_DADR;                 /*!< Offset: 0x02EC   TDES3 Destination Address Register              */
    __IO uint32_t TDES3_CNT;                  /*!< Offset: 0x02F0   TDES3 Block Count Register                      */
    uint32_t RESERVED6[3];               /*!< Offset: 0x02F4 ~ 0x02FC   Reserved                                  */
    __IO uint32_t SHA_CTL;                    /*!< Offset: 0x0300   SHA engine parameter  setting                      */
    __IO uint32_t SHA_FLAG;                   /*!< Offset: 0x0304   SHA status flag                                    */
    __IO uint32_t SHA_H0;                     /*!< Offset: 0x0308   SHA digest message 0                               */
    __IO uint32_t SHA_H1;                     /*!< Offset: 0x030C   SHA digest message 1                               */
    __IO uint32_t SHA_H2;                     /*!< Offset: 0x0310   SHA digest message 2                               */
    __IO uint32_t SHA_H3;                     /*!< Offset: 0x0314   SHA digest message 3                               */
    __IO uint32_t SHA_H4;                     /*!< Offset: 0x0318   SHA digest message 4                               */
    __IO uint32_t SHA_H5;                     /*!< Offset: 0x031C   SHA digest message 5                               */
    __IO uint32_t SHA_H6;                     /*!< Offset: 0x0320   SHA digest message 6                               */
    __IO uint32_t SHA_H7;                     /*!< Offset: 0x0324   SHA digest message 7                               */
    uint32_t RESERVED7[9];               /*!< Offset: 0x0328 ~ 0x0348   Reserved                                  */
    __IO uint32_t SHA_SADR;                   /*!< Offset: 0x034C   SHA DMA Source Address Register                    */
    __IO uint32_t SHA_DMA_CNT;                /*!< Offset: 0x0350   SHA DMA count                                      */
    __IO uint32_t SHA_DATAIN;                 /*!< Offset: 0x0354   SHA software write to engine port                  */
} CRYPTO_T;

/********************* Bit definition of CRYPTO_INT_EN register **********************/
#define CRYPTO_AES_INT_EN_Pos       0                                  /*!<CRYPTO CRYPTO_INT_EN: AES_INT_EN Position */
#define CRYPTO_AES_INT_EN_Msk       (1ul << CRYPTO_AES_INT_EN_Pos)     /*!<CRYPTO CRYPTO_INT_EN: AES_INT_EN Mask */
#define CRYPTO_AES_ERR_EN_Pos       1                                  /*!<CRYPTO CRYPTO_INT_EN: AES_ERR_EN Position */
#define CRYPTO_AES_ERR_EN_Msk       (1ul << CRYPTO_AES_ERR_EN_Pos)     /*!<CRYPTO CRYPTO_INT_EN: AES_ERR_EN Mask */
#define CRYPTO_TDES_INT_EN_Pos      8                                  /*!<CRYPTO CRYPTO_INT_EN: TDES_INT_EN Position */
#define CRYPTO_TDES_INT_EN_Msk      (1ul << CRYPTO_TDES_INT_EN_Pos)    /*!<CRYPTO CRYPTO_INT_EN: TDES_INT_EN Mask */
#define CRYPTO_TDES_ERR_EN_Pos      9                                  /*!<CRYPTO CRYPTO_INT_EN: TDES_ERR_EN Position */
#define CRYPTO_TDES_ERR_EN_Msk      (1ul << CRYPTO_TDES_ERR_EN_Pos)    /*!<CRYPTO CRYPTO_INT_EN: TDES_ERR_EN Mask */
#define CRYPTO_PRNG_INT_EN_Pos      16                                 /*!<CRYPTO CRYPTO_INT_EN: PRNG_INT_EN Position */
#define CRYPTO_PRNG_INT_EN_Msk      (1ul << CRYPTO_PRNG_INT_EN_Pos)    /*!<CRYPTO CRYPTO_INT_EN: PRNG_INT_EN Mask */
#define CRYPTO_SHA_INT_EN_Pos       24                                 /*!<CRYPTO CRYPTO_INT_EN: SHA_INT_EN Position */
#define CRYPTO_SHA_INT_EN_Msk       (1ul << CRYPTO_SHA_INT_EN_Pos)     /*!<CRYPTO CRYPTO_INT_EN: SHA_INT_EN Mask */
#define CRYPTO_SHA_ERR_EN_Pos       25                                 /*!<CRYPTO CRYPTO_INT_EN: SHA_ERR_EN Position */
#define CRYPTO_SHA_ERR_EN_Msk       (1ul << CRYPTO_SHA_ERR_EN_Pos)     /*!<CRYPTO CRYPTO_INT_EN: SHA_ERR_EN Mask */

/********************* Bit definition of CRYPTO_INT_FLAG register **********************/
#define CRYPTO_AES_INT_FLAG_Pos     0                                  /*!<CRYPTO CRYPTO_INT_FLAG: AES_INT_FLAG Position */
#define CRYPTO_AES_INT_FLAG_Msk     (1ul << CRYPTO_AES_INT_FLAG_Pos)   /*!<CRYPTO CRYPTO_INT_FLAG: AES_INT_FLAG Mask */
#define CRYPTO_AES_ERR_FLAG_Pos     1                                  /*!<CRYPTO CRYPTO_INT_FLAG: AES_ERR_FLAG Position */
#define CRYPTO_AES_ERR_FLAG_Msk     (1ul << CRYPTO_AES_ERR_FLAG_Pos)   /*!<CRYPTO CRYPTO_INT_FLAG: AES_ERR_FLAG Mask */
#define CRYPTO_TDES_INT_FLAG_Pos    8                                  /*!<CRYPTO CRYPTO_INT_FLAG: TDES_INT_FLAG Position */
#define CRYPTO_TDES_INT_FLAG_Msk    (1ul << CRYPTO_TDES_INT_FLAG_Pos)  /*!<CRYPTO CRYPTO_INT_FLAG: TDES_INT_FLAG Mask */
#define CRYPTO_TDES_ERR_FLAG_Pos    9                                  /*!<CRYPTO CRYPTO_INT_FLAG: TDES_ERR_FLAG Position */
#define CRYPTO_TDES_ERR_FLAG_Msk    (1ul << CRYPTO_TDES_ERR_FLAG_Pos)  /*!<CRYPTO CRYPTO_INT_FLAG: TDES_ERR_FLAG Mask */
#define CRYPTO_PRNG_INT_FLAG_Pos    16                                 /*!<CRYPTO CRYPTO_INT_FLAG: PRNG_INT_FLAG Position */
#define CRYPTO_PRNG_INT_FLAG_Msk    (1ul << CRYPTO_PRNG_INT_FLAG_Pos)  /*!<CRYPTO CRYPTO_INT_FLAG: PRNG_INT_FLAG Mask */
#define CRYPTO_SHA_INT_FLAG_Pos     24                                 /*!<CRYPTO CRYPTO_INT_FLAG: SHA_INT_FLAG Position */
#define CRYPTO_SHA_INT_FLAG_Msk     (1ul << CRYPTO_SHA_INT_FLAG_Pos)   /*!<CRYPTO CRYPTO_INT_FLAG: SHA_INT_FLAG Mask */
#define CRYPTO_SHA_ERR_FLAG_Pos     25                                 /*!<CRYPTO CRYPTO_INT_FLAG: SHA_ERR_FLAG Position */
#define CRYPTO_SHA_ERR_FLAG_Msk     (1ul << CRYPTO_SHA_ERR_FLAG_Pos)   /*!<CRYPTO CRYPTO_INT_FLAG: SHA_ERR_FLAG Mask */

/********************* Bit definition of PRNG_CTL register **********************/
#define CRYPTO_PRNG_START_Pos       0                                  /*!<CRYPTO PRNG_CTL: PRNG_START Position */
#define CRYPTO_PRNG_START_Msk       (1ul << CRYPTO_PRNG_START_Pos)     /*!<CRYPTO PRNG_CTL: PRNG_START Mask */
#define CRYPTO_PRNG_SEED_RELOAD_Pos 1                                  /*!<CRYPTO PRNG_CTL: PRNG_SEDD_RELOAD Position */
#define CRYPTO_PRNG_SEED_RELOAD_Msk (1ul << CRYPTO_PRNG_SEED_RELOAD_Pos) /*!<CRYPTO PRNG_CTL: PENG_SEDD_RELOAD Mask */
#define CRYPTO_PRNG_KEY_SIZE_Pos    2                                  /*!<CRYPTO PRNG_CTL: PRNG_KEY_SIZE Position */
#define CRYPTO_PRNG_KEY_SIZE_Msk    (3ul << CRYPTO_PRNG_KEY_SIZE_Pos)  /*!<CRYPTO PRNG_CTL: PRNG_KEY_SIZE Mask */
#define CRYPTO_PRNG_BUSY_Pos        8                                  /*!<CRYPTO PRNG_CTL: PRNG_BUSY Position */
#define CRYPTO_PRNG_BUSY_Msk        (1ul << CRYPTO_PRNG_BUSY_Pos)      /*!<CRYPTO PRNG_CTL: PRNG_BUSY Mask */

