coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/********************* Bit definition of AES_CTL register **********************/
#define CRYPTO_AES_START_Pos        0                                  /*!<CRYPTO AES_CTL: AES_START Position */
#define CRYPTO_AES_START_Msk        (1ul << CRYPTO_AES_START_Pos)      /*!<CRYPTO AES_CTL: AES_START Mask */
#define CRYPTO_AES_STOP_Pos         1                                  /*!<CRYPTO AES_CTL: AES_STOP Position */
#define CRYPTO_AES_STOP_Msk         (1ul << CRYPTO_AES_STOP_Pos)       /*!<CRYPTO AES_CTL: AES_STOP Mask */
#define CRYPTO_AES_KEY_SIZE_Pos     2                                  /*!<CRYPTO AES_CTL: AES_KEY_SIZE Position */
#define CRYPTO_AES_KEY_SIZE_Msk     (3ul << CRYPTO_AES_KEY_SIZE_Pos)   /*!<CRYPTO AES_CTL: AES_KEY_SIZE Mask */
#define CRYPTO_AES_LAST_Pos         5                                  /*!<CRYPTO AES_CTL: AES_LAST Position */
#define CRYPTO_AES_LAST_Msk         (1ul << CRYPTO_AES_LAST_Pos)       /*!<CRYPTO AES_CTL: AES_LAST Mask */
#define CRYPTO_AES_DMA_CASCADE_Pos  6                                  /*!<CRYPTO AES_CTL: AES_DMA_CASCADE Position */
#define CRYPTO_AES_DMA_CASCADE_Msk  (1ul << CRYPTO_AES_DMA_CASCADE_Pos)/*!<CRYPTO AES_CTL: AES_DMA_CASCADE Mask */
#define CRYPTO_AES_DMA_EN_Pos       7                                  /*!<CRYPTO AES_CTL: AES_DMA_EN Position */
#define CRYPTO_AES_DMA_EN_Msk       (1ul << CRYPTO_AES_DMA_EN_Pos)     /*!<CRYPTO AES_CTL: AES_DMA_EN Mask */
#define CRYPTO_AES_OP_MODE_Pos      8                                  /*!<CRYPTO AES_CTL: AES_OP_MODE Position */
#define CRYPTO_AES_OP_MODE_Msk      (0xfful << CRYPTO_AES_OP_MODE_Pos) /*!<CRYPTO AES_CTL: AES_OP_MODE Mask */
#define CRYPTO_AES_E_D_Pos          16                                 /*!<CRYPTO AES_CTL: AES_E_D Position */
#define CRYPTO_AES_E_D_Msk          (1ul << CRYPTO_AES_E_D_Pos)        /*!<CRYPTO AES_CTL: AES_E_D Mask */
#define CRYPTO_AES_OUT_SWAP_Pos     22                                 /*!<CRYPTO AES_CTL: AES_OUT_SWAP Position */
#define CRYPTO_AES_OUT_SWAP_Msk     (1ul << CRYPTO_AES_OUT_SWAP_Pos)   /*!<CRYPTO AES_CTL: AES_OUT_SWAP Mask */
#define CRYPTO_AES_IN_SWAP_Pos      23                                 /*!<CRYPTO AES_CTL: AES_IN_SWAP Position */
#define CRYPTO_AES_IN_SWAP_Msk      (1ul << CRYPTO_AES_IN_SWAP_Pos)    /*!<CRYPTO AES_CTL: AES_IN_SWAP Mask */
#define CRYPTO_AES_CHANNEL_Pos      24                                 /*!<CRYPTO AES_CTL: AES_CHANNEL Position */
#define CRYPTO_AES_CHANNEL_Msk      (3ul << CRYPTO_AES_CHANNEL_Pos)    /*!<CRYPTO AES_CTL: AES_CHANNEL Mask */
#define CRYPTO_AES_KEY_UNPROTECT_Pos 26                                /*!<CRYPTO AES_CTL: AES_KEY_UNPROTECT Position */
#define CRYPTO_AES_KEY_UNPROTECT_Msk (0x1ful << CRYPTO_AES_KEY_UNPROTECT_Pos) /*!<CRYPTO AES_CTL: AES_KEY_UNPROTECT Mask */
#define CRYPTO_AES_KEY_PROTECT_Pos  31                                 /*!<CRYPTO AES_CTL: AES_KEY_PROTECT Position */
#define CRYPTO_AES_KEY_PROTECT_Msk  (1ul << CRYPTO_AES_KEY_PROTECT_Pos)/*!<CRYPTO AES_CTL: AES_KEY_PROTECT Mask */

/********************* Bit definition of AES_FLAG register **********************/
#define CRYPTO_AES_BUSY_Pos           0                                /*!<CRYPTO AES_FLAG: AES_BUSY Position */
#define CRYPTO_AES_BUSY_Msk           (1ul << CRYPTO_AES_BUSY_Pos)     /*!<CRYPTO AES_FLAG: AES_BUSY Mask */
#define CRYPTO_AES_IN_BUFF_EMPTY_Pos  8                                /*!<CRYPTO AES_FLAG: AES_IN_BUFFER_EMPTY Position */
#define CRYPTO_AES_IN_BUFF_EMPTY_Msk  (1ul << CRYPTO_AES_IN_BUFF_EMPTY_Pos)  /*!<CRYPTO AES_FLAG: AES_IN_BUFFER_EMPTY Mask */
#define CRYPTO_AES_IN_BUFF_FULL_Pos   9                                /*!<CRYPTO AES_FLAG: AES_IN_BUFFER_FULL Position */
#define CRYPTO_AES_IN_BUFF_FULL_Msk   (1ul << CRYPTO_AES_IN_BUFF_FULL_Pos)   /*!<CRYPTO AES_FLAG: AES_IN_BUFFER_FULL Mask */
#define CRYPTO_AES_IN_BUFF_ERR_Pos    10                               /*!<CRYPTO AES_FLAG: AES_IN_BUFFER_ERROR Position */
#define CRYPTO_AES_IN_BUFF_ERR_Msk    (1ul << CRYPTO_AES_IN_BUFF_ERR_Pos)    /*!<CRYPTO AES_FLAG: AES_IN_BUFFER_ERROR Mask */
#define CRYPTO_AES_CNT_ERR_Pos        12                               /*!<CRYPTO AES_FLAG: AES_CNT_ERR Position */
#define CRYPTO_AES_CNT_ERR_Msk        (1ul << CRYPTO_AES_CNT_ERR_Pos)  /*!<CRYPTO AES_FLAG: AES_CNT_ERR Mask */
#define CRYPTO_AES_OUT_BUFF_EMPTY_Pos 16                               /*!<CRYPTO AES_FLAG: AES_OUT_BUFFER_EMPTY Position */
#define CRYPTO_AES_OUT_BUFF_EMPTY_Msk (1ul << CRYPTO_AES_OUT_BUFF_EMPTY_Pos) /*!<CRYPTO AES_FLAG: AES_OUT_BUFFER_EMPTY Mask */
#define CRYPTO_AES_OUT_BUFF_FULL_Pos  17                               /*!<CRYPTO AES_FLAG: AES_OUT_BUFFER_FULL Position */
#define CRYPTO_AES_OUT_BUFF_FULL_Msk  (1ul << CRYPTO_AES_OUT_BUFF_FULL_Pos)  /*!<CRYPTO AES_FLAG: AES_OUT_BUFFER_FULL Mask */
#define CRYPTO_AES_OUT_BUFF_ERR_Pos   18                               /*!<CRYPTO AES_FLAG: AES_OUT_BUFFER_ERROR Position */
#define CRYPTO_AES_OUT_BUFF_ERR_Msk   (1ul << CRYPTO_AES_OUT_BUFF_ERR_Pos)   /*!<CRYPTO AES_FLAG: AES_OUT_BUFFER_ERROR Mask */
#define CRYPTO_AES_BUS_ERR_Pos        20                               /*!<CRYPTO AES_FLAG: AES_BUS_ERR Position */
#define CRYPTO_AES_BUS_ERR_Msk        (1ul << CRYPTO_AES_BUS_ERR_Pos)  /*!<CRYPTO AES_FLAG: AES_BUS_ERR Mask */

/********************* Bit definition of TDES_CTL register **********************/
#define CRYPTO_TDES_START_Pos       0                                  /*!<CRYPTO TDES_CTL: TDES_START Position */
#define CRYPTO_TDES_START_Msk       (1ul << CRYPTO_TDES_START_Pos)     /*!<CRYPTO TDES_CTL: TDES_START Mask */
#define CRYPTO_TDES_STOP_Pos        1                                  /*!<CRYPTO TDES_CTL: TDES_STOP Position */
#define CRYPTO_TDES_STOP_Msk        (1ul << CRYPTO_TDES_STOP_Pos)      /*!<CRYPTO TDES_CTL: TDES_STOP Mask */
#define CRYPTO_TDES_TRIPLE_MODE_Pos 2                                  /*!<CRYPTO TDES_CTL: TDES_TRIPLE_MODE Position */
#define CRYPTO_TDES_TRIPLE_MODE_Msk (1ul << CRYPTO_TDES_TRIPLE_MODE_Pos)   /*!<CRYPTO TDES_CTL: TDES_TRIPLE_MODE Mask */
#define CRYPTO_TDES_3KEYS_Pos       3                                  /*!<CRYPTO TDES_CTL: TDES_3KEYS Position */
#define CRYPTO_TDES_3KEYS_Msk       (1ul << CRYPTO_TDES_3KEYS_Pos)     /*!<CRYPTO TDES_CTL: TDES_3KEYS Mask */
#define CRYPTO_TDES_LAST_START_Pos  5                                  /*!<CRYPTO TDES_CTL: TDES_LAST_START Position */
#define CRYPTO_TDES_LAST_START_Msk  (1ul << CRYPTO_TDES_LAST_START_Pos)/*!<CRYPTO TDES_CTL: TDES_LAST_START Mask */
#define CRYPTO_TDES_CASCADE_Pos     6                                  /*!<CRYPTO TDES_CTL: TDES_CASCADE Position */
#define CRYPTO_TDES_CASCADE_Msk     (1ul << CRYPTO_TDES_CASCADE_Pos)   /*!<CRYPTO TDES_CTL: TDES_CASCADE Mask */
#define CRYPTO_TDES_DMA_EN_Pos      7                                  /*!<CRYPTO TDES_CTL: TDES_DMA_EN Position */
#define CRYPTO_TDES_DMA_EN_Msk      (1ul << CRYPTO_TDES_DMA_EN_Pos)    /*!<CRYPTO TDES_CTL: TDES_DMA_EN Mask */
#define CRYPTO_TDES_OP_MODE_Pos     8                                  /*!<CRYPTO TDES_CTL: TDES_OP_MODE Position */
#define CRYPTO_TDES_OP_MODE_Msk     (7ul << CRYPTO_TDES_DMA_EN_Pos)    /*!<CRYPTO TDES_CTL: TDES_OP_MODE Mask */
#define CRYPTO_TDES_E_D_Pos         16                                 /*!<CRYPTO TDES_CTL: TDES_E_D Position */
#define CRYPTO_TDES_E_D_Msk         (1ul << CRYPTO_TDES_E_D_Pos)       /*!<CRYPTO TDES_CTL: TDES_E_D Mask */
#define CRYPTO_TDES_BLK_FMT_Pos     21                                 /*!<CRYPTO TDES_CTL: TDES_BLOCK_FORMAT Position */
#define CRYPTO_TDES_BLK_FMT_Msk     (1ul << CRYPTO_TDES_BLK_FMT_Pos)   /*!<CRYPTO TDES_CTL: TDES_BLOCK_FORMAT Mask */
#define CRYPTO_TDES_OUT_SWAP_Pos    22                                 /*!<CRYPTO TDES_CTL: TDES_OUT_SWAP Position */
#define CRYPTO_TDES_OUT_SWAP_Msk    (1ul << CRYPTO_TDES_OUT_SWAP_Pos)  /*!<CRYPTO TDES_CTL: TDES_OUT_SWAP Mask */
#define CRYPTO_TDES_IN_SWAP_Pos     23                                 /*!<CRYPTO TDES_CTL: TDES_IN_SWAP Position */
#define CRYPTO_TDES_IN_SWAP_Msk     (1ul << CRYPTO_TDES_IN_SWAP_Pos)   /*!<CRYPTO TDES_CTL: TDES_IN_SWAP Mask */
#define CRYPTO_TDES_CHANNEL_Pos     24                                 /*!<CRYPTO TDES_CTL: TDES_CHANNEL Position */
#define CRYPTO_TDES_CHANNEL_Msk     (3ul << CRYPTO_TDES_CHANNEL_Pos)   /*!<CRYPTO TDES_CTL: TDES_CHANNEL Mask */
#define CRYPTO_TDES_KEY_UNPROTECT_Pos 26                               /*!<CRYPTO TDES_CTL: TDES_KEY_UNPROTECT Position */
#define CRYPTO_TDES_KEY_UNPROTECT_Msk (0x1ful << CRYPTO_TDES_KEY_UNPROTECT_Pos) /*!<CRYPTO TDES_CTL: TDES_KEY_UNPROTECT Mask */
#define CRYPTO_TDES_KEY_PROTECT_Pos 31                                 /*!<CRYPTO TDES_CTL: TDES_KEY_PROTECT Position */
#define CRYPTO_TDES_KEY_PROTECT_Msk (1ul << CRYPTO_TDES_KEY_PROTECT_Pos)    /*!<CRYPTO TDES_CTL: TDES_KEY_PROTECT Mask */

/********************* Bit definition of TDES_FLAG register **********************/
#define CRYPTO_TDES_BUSY_Pos          0                                /*!<CRYPTO TDES_FLAG: TDES_BUSY Position */
#define CRYPTO_TDES_BUSY_Msk          (1ul << CRYPTO_TDES_BUSY_Pos)    /*!<CRYPTO TDES_FLAG: TDES_BUSY Mask */
#define CRYPTO_TDES_IN_BUFF_EMPTY_Pos 8                                /*!<CRYPTO TDES_FLAG: TDES_IN_BUFFER_EMPTY Position */
#define CRYPTO_TDES_IN_BUFF_EMPTY_Msk (1ul << CRYPTO_TDES_IN_BUFF_EMPTY_Pos)  /*!<CRYPTO TDES_FLAG: TDES_IN_BUFFER_EMPTY Mask */
#define CRYPTO_TDES_IN_BUFF_FULL_Pos  9                                /*!<CRYPTO TDES_FLAG: TDES_IN_BUFFER_FULL Position */
#define CRYPTO_TDES_IN_BUFF_FULL_Msk  (1ul << CRYPTO_TDES_IN_BUFF_FULL_Pos)   /*!<CRYPTO TDES_FLAG: TDES_IN_BUFFER_FULL Mask */
#define CRYPTO_TDES_IN_BUFF_ERR_Pos   10                               /*!<CRYPTO TDES_FLAG: TDES_IN_BUFFER_ERROR Position */
#define CRYPTO_TDES_IN_BUFF_ERR_Msk   (1ul << CRYPTO_TDES_IN_BUFF_ERR_Pos)    /*!<CRYPTO TDES_FLAG: TDES_IN_BUFFER_ERROR Mask */
#define CRYPTO_TDES_OUT_BUFF_EMPTY_Pos 16                              /*!<CRYPTO TDES_FLAG: TDES_OUT_BUFFER_EMPTY Position */
#define CRYPTO_TDES_OUT_BUFF_EMPTY_Msk (1ul << CRYPTO_TDES_OUT_BUFF_EMPTY_Pos)/*!<CRYPTO TDES_FLAG: TDES_OUT_BUFFER_EMPTY Mask */
#define CRYPTO_TDES_OUT_BUFF_FULL_Pos 17                               /*!<CRYPTO TDES_FLAG: TDES_OUT_BUFFER_FULL Position */
#define CRYPTO_TDES_OUT_BUFF_FULL_Msk (1ul << CRYPTO_TDES_OUT_BUFF_FULL_Pos)  /*!<CRYPTO TDES_FLAG: TDES_OUT_BUFFER_FULL Mask */
#define CRYPTO_TDES_OUT_BUFF_ERR_Pos  18                               /*!<CRYPTO TDES_FLAG: TDES_OUT_BUFFER_ERROR Position */
#define CRYPTO_TDES_OUT_BUFF_ERR_Msk  (1ul << CRYPTO_TDES_OUT_BUFF_ERR_Pos)   /*!<CRYPTO TDES_FLAG: TDES_OUT_BUFFER_ERROR Mask */

/********************* Bit definition of SHA_CTL register **********************/
#define CRYPTO_SHA_START_Pos        0                                  /*!<CRYPTO SHA_CTL: SHA_START Position */
#define CRYPTO_SHA_START_Msk        (1ul << CRYPTO_SHA_START_Pos)      /*!<CRYPTO SHA_CTL: SHA_START Mask */
#define CRYPTO_SHA_STOP_Pos         1                                  /*!<CRYPTO SHA_CTL: SHA_STOP Position */
#define CRYPTO_SHA_STOP_Msk         (1ul << CRYPTO_SHA_STOP_Pos)       /*!<CRYPTO SHA_CTL: SHA_STOP Mask */
#define CRYPTO_SHA_LAST_Pos         5                                  /*!<CRYPTO SHA_CTL: SHA_LAST Position */
#define CRYPTO_SHA_LAST_Msk         (1ul << CRYPTO_SHA_LAST_Pos)       /*!<CRYPTO SHA_CTL: SHA_LAST Mask */
#define CRYPTO_SHA_DMA_EN_Pos       7                                  /*!<CRYPTO SHA_CTL: SHA_DMA_EN Position */
#define CRYPTO_SHA_DMA_EN_Msk       (1ul << CRYPTO_SHA_DMA_EN_Pos)     /*!<CRYPTO SHA_CTL: SHA_DMA_EN Mask */
#define CRYPTO_SHA_OP_MODE_Pos      8                                  /*!<CRYPTO SHA_CTL: SHA_OP_MODE Position */
#define CRYPTO_SHA_OP_MODE_Msk      (7ul << CRYPTO_SHA_OP_MODE_Pos)    /*!<CRYPTO SHA_CTL: SHA_OP_MODE Mask */
#define CRYPTO_SHA_OUT_SWAP_Pos     22                                 /*!<CRYPTO SHA_CTL: SHA_OUT_SWAP Position */
#define CRYPTO_SHA_OUT_SWAP_Msk     (1ul << CRYPTO_SHA_OUT_SWAP_Pos)   /*!<CRYPTO SHA_CTL: SHA_OUT_SWAP Mask */
#define CRYPTO_SHA_IN_SWAP_Pos      23                                 /*!<CRYPTO SHA_CTL: SHA_IN_SWAP Position */
#define CRYPTO_SHA_IN_SWAP_Msk      (1ul << CRYPTO_SHA_IN_SWAP_Pos)    /*!<CRYPTO SHA_CTL: SHA_IN_SWAP Mask */

/********************* Bit definition of SHA_FLAG register **********************/
#define CRYPTO_SHA_BUSY_Pos         0                                  /*!<CRYPTO SHA_FLAG: SHA_BUSY Position */
#define CRYPTO_SHA_BUSY_Msk         (1ul << CRYPTO_SHA_BUSY_Pos)       /*!<CRYPTO SHA_FLAG: SHA_BUSY Mask */
#define CRYPTO_SHA_DMA_BUSY_Pos     1                                  /*!<CRYPTO SHA_FLAG: SHA_DMA_BUSY Position */
#define CRYPTO_SHA_DMA_BUSY_Msk     (1ul << CRYPTO_SHA_DMA_BUSY_Pos)   /*!<CRYPTO SHA_FLAG: SHA_DMA_BUSY Mask */
#define CRYPTO_SHA_DMA_ERR_Pos      8                                  /*!<CRYPTO SHA_FLAG: SHA_DMA_ERR Position */
#define CRYPTO_SHA_DMA_ERR_Msk      (1ul << CRYPTO_SHA_DMA_ERR_Pos)    /*!<CRYPTO SHA_FLAG: SHA_DMA_ERR Mask */
#define CRYPTO_SHA_DIN_REQ_Pos      16                                 /*!<CRYPTO SHA_FLAG: SHA_DIN_REQ Position */
#define CRYPTO_SHA_DIN_REQ_Msk      (1ul << CRYPTO_SHA_DIN_REQ_Pos)    /*!<CRYPTO SHA_FLAG: SHA_DIN_REQ Mask */

/*@}*/ /* end of group NUC400_CRYPTO */


