coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/*------------- Image Capture Interface Register (CAP) -----------------------------*/
/** @addtogroup NUC400_CAP NUC400 Image Capture Interface Register (CAP)
  @{
*/
typedef struct {
    __IO uint32_t CAPCTL;                /*!< Offset: 0x0000  Image Capture Control Register */
    __IO uint32_t CAPPAR;                /*!< Offset: 0x0004  Image Capture Parameter Register */
    __IO uint32_t CAPINT;                /*!< Offset: 0x0008  Image Capture Interrupt Register */
    __IO uint32_t POSTERIZE;             /*!< Offset: 0x000C  YUV Component Posterizing Factor Register */
    __IO uint32_t MD;                    /*!< Offset: 0x0010  Motion Detection Register */
    __IO uint32_t MDADDR;                /*!< Offset: 0x0014  Motion Detection Output Address Register */
    __IO uint32_t MDYADDR;               /*!< Offset: 0x0018  Motion Detection Temp Y Output Address Register */
    __IO uint32_t SEPIA;                 /*!< Offset: 0x001C  Sepia Effect Control Register */
    __IO uint32_t CWSP;                  /*!< Offset: 0x0020  Cropping Window Starting Address Register */
    __IO uint32_t CWS;                   /*!< Offset: 0x0024  Cropping Window Size Register */
    __IO uint32_t PKDSL;                 /*!< Offset: 0x0028  Packet Scaling Vertical/Horizontal Factor Register (LSB)*/
    __IO uint32_t PNDSL;                 /*!< Offset: 0x002C  Planar Scaling Vertical/Horizontal Factor Register (LSB)*/
    __IO uint32_t FRC;                   /*!< Offset: 0x0030  Scaling Frame Rate Factor Register*/
    __IO uint32_t STRIDE;                /*!< Offset: 0x0034  Frame Output Pixel Stride Width Register*/
    uint32_t RESERVED0[1];          /*!< Offset: 0x0038  Reserved */
    __IO uint32_t FIFO_THD;              /*!< Offset: 0x003C  FIFO Threshold Register*/
    __IO uint32_t CMPADDR;               /*!< Offset: 0x0040  Compare Memory Base Address Register */
    uint32_t RESERVED1[1];          /*!< Offset: 0x0044  Reserved */
    __IO uint32_t PKDSH;                 /*!< Offset: 0x0048  Packet Scaling Vertical/Horizontal Factor Register (MSB)*/
    __IO uint32_t PNDSH;                 /*!< Offset: 0x004C  Planar Scaling Vertical/Horizontal Factor Register (MSB)*/
    __IO uint32_t CURADDRP;              /*!< Offset: 0x0050  Current Packet Output Memory Size Register */
    __IO uint32_t CURADDRY;              /*!< Offset: 0x0054  Current Planar Y Output Memory Size Register */
    __IO uint32_t CURADDRU;              /*!< Offset: 0x0058  Current Planar U Output Memory Size Register */
    __IO uint32_t CURADDRV;              /*!< Offset: 0x005C  Current Planar V Output Memory Size Register */
    __IO uint32_t PACBA0;                /*!< Offset: 0x0060  System Memory Packet Base Address 0 Register */
    __IO uint32_t PACBA1;                /*!< Offset: 0x0064  System Memory Packet Base Address 1 Register */
    uint32_t RESERVED2[6];          /*!< Offset: 0x0068 ~0x7C Reserved */
    __IO uint32_t YBA0;                  /*!< Offset: 0x0080  System Memory Planar Y Base Address Register */
    __IO uint32_t UBA0;                  /*!< Offset: 0x0084  System Memory Planar U Base Address Register */
    __IO uint32_t VBA0;                  /*!< Offset: 0x0088  System Memory Planar V Base Address Register */
} CAP_T;

/* CAP CAPCTL Bit Field Definitions */
#define CAP_CAPCTL_CAPEN_Pos      0                                   /*!< CAP CAPCTL: CAPEN Position */
#define CAP_CAPCTL_CAPEN_Msk      (1ul<<CAP_CAPCTL_CAPEN_Pos)         /*!< CAP CAPCTL: CAPEN Mask */

#define CAP_CAPCTL_ADDRSW_Pos     3                                   /*!< CAP CAPCTL: ADDRSW Position */
#define CAP_CAPCTL_ADDRSW_Msk     (1ul<<CAP_CAPCTL_ADDRSW_Pos)        /*!< CAP CAPCTL: ADDRSW Mask */

#define CAP_CAPCTL_PNEN_Pos       5                                   /*!< CAP CAPCTL: PNEN Position */
#define CAP_CAPCTL_PNEN_Msk       (1ul<<CAP_CAPCTL_PNEN_Pos)          /*!< CAP CAPCTL: PNEN Mask */

#define CAP_CAPCTL_PKEN_Pos       6                                   /*!< CAP CAPCTL: PKEN Position */
#define CAP_CAPCTL_PKEN_Msk       (1ul<<CAP_CAPCTL_PKEN_Pos)          /*!< CAP CAPCTL: PKEN Mask */

#define CAP_CAPCTL_BIST_Pos       8                                   /*!< CAP CAPCTL: BIST Position */
#define CAP_CAPCTL_BIST_Msk       (1ul<<CAP_CAPCTL_BIST_Pos)          /*!< CAP CAPCTL: BIST Mask */

#define CAP_CAPCTL_SHUTTER_Pos    16                                  /*!< CAP CAPCTL: SHUTTER Position */
#define CAP_CAPCTL_SHUTTER_Msk    (1ul<<CAP_CAPCTL_SHUTTER_Pos)       /*!< CAP CAPCTL: SHUTTER Mask */

#define CAP_CAPCTL_UPDATE_Pos     20                                  /*!< CAP CAPCTL: UPDATE Position */
#define CAP_CAPCTL_UPDATE_Msk     (1ul<<CAP_CAPCTL_UPDATE_Pos)        /*!< CAP CAPCTL: UPDATE Mask */

#define CAP_CAPCTL_VPRST_Pos      24                                  /*!< CAP CAPCTL: VPRST Position */
#define CAP_CAPCTL_VPRST_Msk      (1ul<<CAP_CAPCTL_VPRST_Pos)         /*!< CAP CAPCTL: VPRST Mask */

/* CAP CAPPAR Bit Field Definitions */
#define CAP_CAPPAR_INFMT_Pos      0                                   /*!< CAP CAPPAR: INFMT Position */
#define CAP_CAPPAR_INFMT_Msk      (1ul<<CAP_CAPPAR_INFMT_Pos)         /*!< CAP CAPPAR: INFMT Mask */

#define CAP_CAPPAR_SNRTYPE_Pos    1                                   /*!< CAP CAPPAR: SNRTYPE Position */
#define CAP_CAPPAR_SNRTYPE_Msk    (1ul<<CAP_CAPPAR_SNRTYPE_Pos)       /*!< CAP CAPPAR: SNRTYPE Mask */

#define CAP_CAPPAR_PDORD_Pos      2                                   /*!< CAP CAPPAR: PDORD Position */
#define CAP_CAPPAR_PDORD_Msk      (0x3ul<<CAP_CAPPAR_PDORD_Pos)       /*!< CAP CAPPAR: PDORD Mask */

#define CAP_CAPPAR_OUTFMT_Pos     4                                   /*!< CAP CAPPAR: OUTFMT Position */
#define CAP_CAPPAR_OUTFMT_Msk     (0x3ul<<CAP_CAPPAR_OUTFMT_Pos)      /*!< CAP CAPPAR: OUTFMT Mask */

#define CAP_CAPPAR_RANGE_Pos      6                                   /*!< CAP CAPPAR: RANGE Position */
#define CAP_CAPPAR_RANGE_Msk      (1ul<<CAP_CAPPAR_RANGE_Pos)         /*!< CAP CAPPAR: RANGE Mask */

#define CAP_CAPPAR_PNFMT_Pos      7                                   /*!< CAP CAPPAR: PNFMT Position */
#define CAP_CAPPAR_PNFMT_Msk      (1ul<<CAP_CAPPAR_PNFMT_Pos)         /*!< CAP CAPPAR: PNFMT Mask */

#define CAP_CAPPAR_PCLKP_Pos      8                                   /*!< CAP CAPPAR: PCLKP Position */
#define CAP_CAPPAR_PCLKP_Msk      (1ul<<CAP_CAPPAR_PCLKP_Pos)         /*!< CAP CAPPAR: PCLKP Mask */

#define CAP_CAPPAR_HSP_Pos        9                                   /*!< CAP CAPPAR: HSP Position */
#define CAP_CAPPAR_HSP_Msk        (1ul<<CAP_CAPPAR_HSP_Pos)           /*!< CAP CAPPAR: HSP Mask */

