coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define CAP_CAPPAR_VSP_Pos        10                                  /*!< CAP CAPPAR: VSP Position */
#define CAP_CAPPAR_VSP_Msk        (1ul<<CAP_CAPPAR_VSP_Pos)           /*!< CAP CAPPAR: VSP Mask */

#define CAP_CAPPAR_Color_Effect_Pos    11                                          /*!< CAP CAPPAR: Color_Effect Position */
#define CAP_CAPPAR_Color_Effect_Msk    (0x3ul<<CAP_CAPPAR_VColor_EFFect_Pos)       /*!< CAP CAPPAR: Color_Effect Mask */

#define CAP_CAPPAR_FBB_Pos        18                                  /*!< CAP CAPPAR: FBB Position */
#define CAP_CAPPAR_FBB_Msk        (1ul<<CAP_CAPPAR_FBB_Pos)           /*!< CAP CAPPAR: FBB Mask */

#define CAP_CAPPAR_BFAIL_Pos      24                                  /*!< CAP CAPPAR: FBB Position */
#define CAP_CAPPAR_BFAIL_Msk      (0xFul<<CAP_CAPPAR_BFAIL_Pos)       /*!< CAP CAPPAR: FBB Mask */

#define CAP_CAPPAR_BFIN_Pos       28                                  /*!< CAP CAPPAR: BFIN Position */
#define CAP_CAPPAR_BFIN_Msk       (1ul<<CAP_CAPPAR_CAPBFIN_Pos)       /*!< CAP CAPPAR: BFIN Mask */

/* CAP CAPINT Bit Field Definitions */
#define CAP_CAPINT_VINT_Pos    0                                      /*!< CAP CAPINT: VINT Position */
#define CAP_CAPINT_VINT_Msk    (1ul<<CAP_CAPINT_VINT_Pos)             /*!< CAP CAPINT: VINT Mask */

#define CAP_CAPINT_MEINT_Pos    1                                     /*!< CAP CAPINT: MEINT Position */
#define CAP_CAPINT_MEINT_Msk    (1ul<<CAP_CAPINT_MEINT_Pos)           /*!< CAP CAPINT: MEINT Mask */

#define CAP_CAPINT_ADDRMINT_Pos    3                                  /*!< CAP CAPINT: ADDRMINT Position */
#define CAP_CAPINT_ADDRMINT_Msk    (1ul<<CAP_CAPINT_ADDRMINT_Pos)     /*!< CAP CAPINT: ADDRMINT Mask */

#define CAP_CAPINT_MDINT_Pos    4                                     /*!< CAP CAPINT: MDINT Position */
#define CAP_CAPINT_MDINT_Msk    (1ul<<CAP_CAPINT_MDINT_Pos)           /*!< CAP CAPINT: MDINT Mask */

#define CAP_CAPINT_VINTEN_Pos    16                                   /*!< CAP CAPINT: VINTEN Position */
#define CAP_CAPINT_VINTEN_Msk    (1ul<<CAP_CAPINT_VINTEN_Pos)         /*!< CAP CAPINT: VINTEN Mask */

#define CAP_CAPINT_MEINTEN_Pos    17                                  /*!< CAP CAPINT: MEINTEN Position */
#define CAP_CAPINT_MEINTEN_Msk    (1ul<<CAP_CAPINT_MEINTEN_Pos)       /*!< CAP CAPINT: MEINTEN Mask */

#define CAP_CAPINT_ADDRMEN_Pos    19                                  /*!< CAP CAPINT: ADDRMEN Position */
#define CAP_CAPINT_ADDRMEN_Msk    (1ul<<CAP_CAPINT_ADDRMEN_Pos)       /*!< CAP CAPINT: ADDRMEN Mask */

#define CAP_CAPINT_MDINTEN_Pos    20                                  /*!< CAP CAPINT: MDINTEN Position */
#define CAP_CAPINT_MDINTEN_Msk    (1ul<<CAP_CAPINT_MDINTEN_Pos)       /*!< CAP CAPINT: MDINTEN Mask */

/* CAP VPOSTERIZE Bit Field Definitions */

#define CAP_POSTERIZE_Y_Pos    0                                      /*!< CAP POSTERIZE: Y Position */
#define CAP_POSTERIZE_Y_Msk    (0xFFul<<CAP_POSTERIZE_Y_Pos)          /*!< CAP POSTERIZE: Y Mask */
#define CAP_POSTERIZE_U_Pos    8                                      /*!< CAP POSTERIZE: U Position */
#define CAP_POSTERIZE_U_Msk    (0xFFul<<CAP_POSTERIZE_U_Pos)          /*!< CAP POSTERIZE: U Mask */
#define CAP_POSTERIZE_V_Pos    16                                     /*!< CAP POSTERIZE: V Position */
#define CAP_POSTERIZE_V_Msk    (0xFFul<<CAP_POSTERIZE_V_Pos)          /*!< CAP POSTERIZE: V Mask */


/* CAP MD Bit Field Definitions */

#define CAP_MD_MDEN_Pos        0                                   /*!< CAP MD: MDEN Position */
#define CAP_MD_MDEN_Msk        (1ul<<CAP_MD_MDEN_Pos)              /*!< CAP MD: MDEN Mask */

#define CAP_MD_MDBS_Pos        8                                   /*!< CAP MD: MDBS Position */
#define CAP_MD_MDBS_Msk        (1ul<<CAP_MD_MDBS_Pos)              /*!< CAP MD: MDBS Mask */

#define CAP_MD_MDSM_Pos        9                                   /*!< CAP MD: MDSM Position */
#define CAP_MD_MDSM_Msk        (1ul<<CAP_MD_MDSM_Pos)              /*!< CAP MD: MDSM Mask */

#define CAP_MD_MDDF_Pos        10                                  /*!< CAP MD: MDDF Position */
#define CAP_MD_MDDF_Msk        (0x3ul<<CAP_MD_MDDF_Pos)            /*!< CAP MD: MDDF Mask */

#define CAP_MD_MDTHR_Pos       16                                  /*!< CAP MD: MDTHR  Position */
#define CAP_MD_MDTHR_Msk       (0x1Ful<<CAP_MD_MDTHR_Pos)          /*!< CAP MD: MDTHR  Mask */

/* CAP MDADDR Bit Field Definitions */
#define CAP_MDADDR_MDADDR_Pos  0                                           /*!< CAP MDADDR: MDADDR Position */
#define CAP_MDADDR_MDADDR_Msk  (0xFFFFFFFFul<<CAP_MDADDR_MDADDR_Pos)       /*!< CAP MDADDR: MDADDR Mask */

/* CAP MDYADDR Bit Field Definitions */
#define CAP_MDYADDR_MDYADDR_Pos 0                                          /*!< CAP MDYADDR: MDYADDR Position */
#define CAP_MDYADDR_MDYADDR_Msk (0xFFFFFFFFul<<CAP_MDYADDR_MDYADDR_Pos)    /*!< CAP MDYADDR: MDYADDR Mask */

/* CAP SEPIA Bit Field Definitions */
#define CAP_SEPIA_SepiaU_Pos    0                                  /*!< CAP SEPIA: SepiaU Position */
#define CAP_SEPIA_SepiaU_Msk    (0xFFul<<CAP_VSEPIA_SepiaU_Pos)    /*!< CAP SEPIA: SepiaU Mask */

#define CAP_SEPIA_SepiaV_Pos    8                                  /*!< CAP SEPIA: SepiaV Position */
#define CAP_SEPIA_SepiaV_Msk    (0xFFul<<CAP_VSEPIA_SepiaV_Pos)    /*!< CAP SEPIA: SepiaV Mask */

/* CAP CWSP Bit Field Definitions */
#define CAP_CWSP_CWSPH_Pos    0                                    /*!< CAP CWSP: CWSPH Position */
#define CAP_CWSP_CWSPH_Msk    (0x7FFul<<CAP_CWSP_CWSPH_Pos)        /*!< CAP CWSP: CWSPH Mask */

#define CAP_CWSP_CWSPV_Pos    16                                   /*!< CAP CWSP: CWSPV Position */
#define CAP_CWSP_CWSPV_Msk    (0x7FFul<<CAP_CWSP_CWSPV_Pos)        /*!< CAP CWSP: CWSPV Mask */

/* CAP CWS Bit Field Definitions */
#define CAP_CWS_CWSW_Pos    0                                      /*!< CAP CWS: CWSW Position */
#define CAP_CWS_CWSW_Msk    (0x7FFul<<CAP_CWS_CWSW_Pos)            /*!< CAP CWS: CWSW Mask */

#define CAP_CWS_CWSH_Pos    16                                     /*!< CAP CWS: CWSH Position */
#define CAP_CWS_CWSH_Msk    (0x7FFul<<CAP_CWS_CWSH_Pos)            /*!< CAP CWS: CWSH Mask */

/* CAP PKDSL Bit Field Definitions */
#define CAP_PKDSL_PKDSHML_Pos    0                                 /*!< CAP PKDSL: PKDSHML Position */
#define CAP_PKDSL_PKDSHML_Msk    (0xFFul<<CAP_PKDSL_PKDSHML_Pos)   /*!< CAP PKDSL: PKDSHML Mask */

#define CAP_PKDSL_PKDSHNL_Pos    8                                 /*!< CAP PKDSL: PKDSHNL Position */
#define CAP_PKDSL_PKDSHNL_Msk    (0xFFul<<CAP_PKDSL_PKDSHNL_Pos)   /*!< CAP PKDSL: PKDSHNL Mask */

#define CAP_PKDSL_PKDSVML_Pos    16                                /*!< CAP PKDSL: PKDSVML Position */
#define CAP_PKDSL_PKDSVML_Msk    (0xFFul<<CAP_PKDSL_PKDSVML_Pos)   /*!< CAP PKDSL: PKDSVML Mask */

