coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
#define CAP_PKDSL_PKDSVNL_Pos    24                                /*!< CAP PKDSL: PKDSVNL Position */
#define CAP_PKDSL_PKDSVNL_Msk    (0xFFul<<CAP_PKDSL_PKDSVNL_Pos)   /*!< CAP PKDSL: PKDSVNL Mask */

/* CAP PNDSL Bit Field Definitions */
#define CAP_PNDSL_PNDSHML_Pos    0                                 /*!< CAP PNDSL: PNDSHML Position */
#define CAP_PNDSL_PNDSHML_Msk    (0xFFul<<CAP_PNDSL_PNDSHML_Pos)   /*!< CAP PNDSL: PNDSHML Mask */

#define CAP_PNDSL_PNDSHNL_Pos    8                                 /*!< CAP PNDSL: PNDSHNL Position */
#define CAP_PNDSL_PNDSHNL_Msk    (0xFFul<<CAP_PNDSL_PNDSHNL_Pos)   /*!< CAP PNDSL: PNDSHNL Mask */

#define CAP_PNDSL_PNDSVML_Pos    16                                /*!< CAP PNDSL: PNDSVML Position */
#define CAP_PNDSL_PNDSVML_Msk    (0xFFul<<CAP_PNDSL_PNDSVML_Pos)   /*!< CAP PNDSL: PNDSVML Mask */

#define CAP_PNDSL_PNDSVNL_Pos    24                                /*!< CAP PNDSL: PNDSVNL Position */
#define CAP_PNDSL_PNDSVNL_Msk    (0xFFul<<CAP_PNDSL_PNDSVNL_Pos)   /*!< CAP PNDSL: PNDSVNL Mask */

/* CAP PKDSH Bit Field Definitions */
#define CAP_PKDSH_PKDSHMH_Pos    0                                 /*!< CAP PKDSH: PKDSHMH Position */
#define CAP_PKDSH_PKDSHMH_Msk    (0xFFul<<CAP_PKDSH_PKDSHMH_Pos)   /*!< CAP PKDSH: PKDSHMH Mask */

#define CAP_PKDSH_PKDSHNH_Pos    8                                 /*!< CAP PKDSH: PKDSHNH Position */
#define CAP_PKDSH_PKDSHNH_Msk    (0xFFul<<CAP_PKDSH_PKDSHNH_Pos)   /*!< CAP PKDSH: PKDSHNH Mask */

#define CAP_PKDSH_PKDSVMH_Pos    16                                /*!< CAP PKDSH: PKDSVMH Position */
#define CAP_PKDSH_PKDSVMH_Msk    (0xFFul<<CAP_PKDSH_PKDSVMH_Pos)   /*!< CAP PKDSH: PKDSVMH Mask */

#define CAP_PKDSH_PKDSVNH_Pos    24                                /*!< CAP PKDSH: PKDSVNH Position */
#define CAP_PKDSH_PKDSVNH_Msk    (0xFFul<<CAP_PKDSH_PKDSVNH_Pos)   /*!< CAP PKDSH: PKDSVNH Mask */

/* CAP PNDSH Bit Field Definitions */
#define CAP_PNDSH_PNDSHMH_Pos    0                                 /*!< CAP PNDSH: PNDSHMH Position */
#define CAP_PNDSH_PNDSHMH_Msk    (0xFFul<<CAP_PNDSH_PNDSHMH_Pos)   /*!< CAP PNDSH: PNDSHMH Mask */

#define CAP_PNDSH_PNDSHNH_Pos    8                                 /*!< CAP PNDSH: PNDSHNH Position */
#define CAP_PNDSH_PNDSHNH_Msk    (0xFFul<<CAP_PNDSH_PNDSHNH_Pos)   /*!< CAP PNDSH: PNDSHNH Mask */

#define CAP_PNDSH_PNDSVMH_Pos    16                                /*!< CAP PNDSH: PNDSVMH Position */
#define CAP_PNDSH_PNDSVMH_Msk    (0xFFul<<CAP_PNDSH_PNDSVMH_Pos)   /*!< CAP PNDSH: PNDSVMH Mask */

#define CAP_PNDSH_PNDSVNH_Pos    24                                /*!< CAP PNDSH: PNDSVNH Position */
#define CAP_PNDSH_PNDSVNH_Msk    (0xFFul<<CAP_PNDSH_PNDSVNH_Pos)   /*!< CAP PNDSH: PNDSVNH Mask */

/* CAP FRC Bit Field Definitions */
#define CAP_FRC_FRCM_Pos    0                                      /*!< CAP FRC: FRCM Position */
#define CAP_FRC_FRCM_Msk    (0x3Ful<<CAP_FRC_FRCM_Pos)             /*!< CAP FRC: FRCM Mask */

#define CAP_FRC_FRCN_Pos    8                                      /*!< CAP FRC: FRCN Position */
#define CAP_FRC_FRCN_Msk    (0x3Ful<<CAP_FRC_FRCN_Pos)             /*!< CAP FRC: FRCN Mask */

/* CAP STRIDE Bit Field Definitions */
#define CAP_STRIDE_PKSTRIDE_Pos    0                                          /*!< CAP STRIDE: PKSTRIDE  Position */
#define CAP_STRIDE_PKSTRIDE_Msk    (0x3FFFul<<CAP_STRIDE_PKSTRIDE_Pos)        /*!< CAP STRIDE: PKSTRIDE  Mask */

#define CAP_STRIDE_PNSTRIDE_Pos    16                                         /*!< CAP STRIDE: PNSTRIDE Position */
#define CAP_STRIDE_PNSTRIDE_Msk    (0x3FFFul<<CAP_STRIDE_PNSTRIDE_Pos)        /*!< CAP STRIDE: PNSTRIDE Mask */

/* CAP FIFO_THD Bit Field Definitions */
#define CAP_FIFO_THD_FTHV_Pos    0                                  /*!< CAP FIFO_THD: FTHV Position */
#define CAP_FIFO_THD_FTHV_Msk    (0xFul<<CAP_FIFO_THD_FTHV_Pos)     /*!< CAP FIFO_THD: FTHV Mask */

#define CAP_FIFO_THD_FTHU_Pos    8                                  /*!< CAP FIFO_THD: FTHU Position */
#define CAP_FIFO_THD_FTHU_Msk    (0xFul<<CAP_FIFO_THD_FTHU_Pos)     /*!< CAP FIFO_THD: FTHU Mask */

#define CAP_FIFO_THD_FTHY_Pos    16                                 /*!< CAP FIFO_THD: FTHY Position */
#define CAP_FIFO_THD_FTHY_Msk    (0xFul<<CAP_FIFO_THD_FTHY_Pos)     /*!< CAP FIFO_THD: FTHY Mask */

#define CAP_FIFO_THD_FTHP_Pos    24                                 /*!< CAP FIFO_THD: FTHP Position */
#define CAP_FIFO_THD_FTHP_Msk    (0xFul<<CAP_FIFO_THD_FTHP_Pos)     /*!< CAP FIFO_THD: FTHP Mask */

#define CAP_VFIFO_OVFL_Pos       31                                 /*!< CAP FIFO_THD: OVFL Position */
#define CAP_VFIFO_OVFL_Msk       (1ul<<CAP_FIFO_THD_OVFL_Pos)       /*!< CAP FIFO_THD: OVFL Mask */

/* CAP CMPADDR Bit Field Definitions */
#define CAP_CMPADDR_CMPADDR_Pos    0                                              /*!< CAP CMPADDR: CMPADDR Position */
#define CAP_CMPADDR_CMPADDR_Msk    (0xFFFFFFFFul<<CAP_CMPADDR_CMPADDR_Pos)        /*!< CAP CMPADDR: CMPADDR Mask */

/* CAP CURADDRP Bit Field Definitions */
#define CAP_CURADDRP_CURADDRP_Pos    0                                            /*!< CAP CURADDRP: CURADDRP Position */
#define CAP_CURADDRP_CURADDRP_Msk    (0xFFFFFFFFul<<CAP_CURADDRP_CURADDRP_Pos)    /*!< CAP CURADDRP: CURADDRP Mask */

/* CAP CURADDRY Bit Field Definitions */
#define CAP_CURADDRY_CURADDRY_Pos    0                                            /*!< CAP CURADDRY: CURADDRY Position */
#define CAP_CURADDRY_CURADDRY_Msk    (0xFFFFFFFFul<<CAP_CURADDRY_CURADDRY_Pos)    /*!< CAP CURADDRY: CURADDRY Mask */

/* CAP CURADDRU Bit Field Definitions */
#define CAP_CURADDRU_CURADDRU_Pos    0                                            /*!< CAP CURADDRU: CURADDRU Position */
#define CAP_CURADDRU_CURADDRU_Msk    (0xFFFFFFFFul<<CAP_CURADDRU_CURADDRU_Pos)    /*!< CAP CURADDRU: CURADDRU Mask */

/* CAP CURADDRV Bit Field Definitions */
#define CAP_CURADDRV_CURADDRV_Pos    0                                            /*!< CAP CURADDRV: CURADDRV Position */
#define CAP_CURADDRV_CURADDRV_Msk    (0xFFFFFFFFul<<CAP_CURADDRV_CURADDRV_Pos)    /*!< CAP CURADDRV: CURADDRV Mask */

