coocox/Mplib/Nuvoton/NUC440/CMSIS_Lib/lib/cmsis_boot/NUC400Series.h
/* CAP PACBA0 Bit Field Definitions */
#define CAP_PACBA0_PACBA0_Pos    0                                                /*!< CAP PACBA0: PACBA0 Position */
#define CAP_PACBA0_PACBA0_Msk    (0xFFFFFFFFul<<CAP_PACBA0_PACBA0_Pos)            /*!< CAP PACBA0: PACBA0 Mask */

/* CAP PACBA1 Bit Field Definitions */
#define CAP_PACBA1_PACBA1_Pos    0                                                /*!< CAP PACBA1: PACBA1 Position */
#define CAP_PACBA1_PACBA1_Msk    (0xFFFFFFFFul<<CAP_PACBA1_PACBA1_Pos)            /*!< CAP PACBA1: PACBA1 Mask */

/* CAP YBA0 Bit Field Definitions */
#define CAP_YBA0_YBA0_Pos    0                                                    /*!< CAP YBA0: YBA0 Position */
#define CAP_YBA0_YBA0_Msk    (0xFFFFFFFFul<<CAP_YBA0_YBA0_Pos)                    /*!< CAP YBA0: YBA0 Mask */

/* CAP UBA0 Bit Field Definitions */
#define CAP_UBA0_UBA0_Pos    0                                                    /*!< CAP UBA0: UBA0 Position */
#define CAP_UBA0_UBA0_Msk    (0xFFFFFFFFul<<CAP_UBA0_UBA0_Pos)                    /*!< CAP UBA0: UBA0 Mask */

/* CAP VBA0 Bit Field Definitions */
#define CAP_VBA0_VBA0_Pos    0                                                    /*!< CAP VBA0: VBA0 Position */
#define CAP_VBA0_VBA0_Msk    (0xFFFFFFFFul<<CAP_VBA0_VBA0_Pos)                    /*!< CAP VBA0: VBA0 Mask */


/*@}*/ /* end of group NUC400_CAP */


#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif



/** @addtogroup NUC400_PERIPHERAL_MEM_MAP NUC400 Peripheral Memory Map
  Memory Mapped Structure for NUC400 Series Peripheral
  @{
 */
/* Peripheral and SRAM base address */
#define FLASH_BASE           ((uint32_t)0x00000000)      /*!< Flash base address      */
#define SRAM_BASE            ((uint32_t)0x20000000)      /*!< SRAM Base Address       */
#define PERIPH_BASE          ((uint32_t)0x40000000)      /*!< Peripheral Base Address */
#define AHBPERIPH_BASE       PERIPH_BASE                 /*!< AHB Base Address */
#define APBPERIPH_BASE       (PERIPH_BASE + 0x00040000)  /*!< APB Base Address */

/*!< AHB peripherals */
#define GCR_BASE               (AHBPERIPH_BASE + 0x00000)
#define CLK_BASE               (AHBPERIPH_BASE + 0x00200)
#define GPIOA_BASE             (AHBPERIPH_BASE + 0x04000)
#define GPIOB_BASE             (AHBPERIPH_BASE + 0x04040)
#define GPIOC_BASE             (AHBPERIPH_BASE + 0x04080)
#define GPIOD_BASE             (AHBPERIPH_BASE + 0x040C0)
#define GPIOE_BASE             (AHBPERIPH_BASE + 0x04100)
#define GPIOF_BASE             (AHBPERIPH_BASE + 0x04140)
#define GPIOG_BASE             (AHBPERIPH_BASE + 0x04180)
#define GPIOH_BASE             (AHBPERIPH_BASE + 0x041C0)
#define GPIOI_BASE             (AHBPERIPH_BASE + 0x04200)
#define GPIO_DBNCECON_BASE     (AHBPERIPH_BASE + 0x04440)
#define GPIO_PIN_DATA_BASE     (AHBPERIPH_BASE + 0x04800)
#define PDMA_BASE              (AHBPERIPH_BASE + 0x08000)
#define USBH_BASE              (AHBPERIPH_BASE + 0x09000)
#define EMAC_BASE              (AHBPERIPH_BASE + 0x0B000)
#define FMC_BASE               (AHBPERIPH_BASE + 0x0C000)
#define SD_BASE                (AHBPERIPH_BASE + 0x0D000)
#define EBI_BASE               (AHBPERIPH_BASE + 0x10000)
#define UDC20_BASE             (AHBPERIPH_BASE + 0x19000)
#define CAP_BASE               (AHBPERIPH_BASE + 0x30000)
#define CRC_BASE               (AHBPERIPH_BASE + 0x31000)
#define TAMPER_BASE            (AHBPERIPH_BASE + 0xE1000)

/*!< APB2 peripherals */
#define WDT_BASE              (APBPERIPH_BASE + 0x00000)
#define WWDT_BASE             (APBPERIPH_BASE + 0x00100)
#define OPA_BASE              (APBPERIPH_BASE + 0x06000)
#define I2S0_BASE             (APBPERIPH_BASE + 0x08000)
#define TIMER0_BASE           (APBPERIPH_BASE + 0x10000)
#define TIMER1_BASE           (APBPERIPH_BASE + 0x10020)
#define PWM0_BASE             (APBPERIPH_BASE + 0x18000)
#define EPWM0_BASE            (APBPERIPH_BASE + 0x1C000)
#define SPI0_BASE             (APBPERIPH_BASE + 0x20000)
#define SPI2_BASE             (APBPERIPH_BASE + 0x22000)
#define UART0_BASE            (APBPERIPH_BASE + 0x30000)
#define UART2_BASE            (APBPERIPH_BASE + 0x32000)
#define UART4_BASE            (APBPERIPH_BASE + 0x34000)
#define I2C0_BASE             (APBPERIPH_BASE + 0x40000)
#define I2C2_BASE             (APBPERIPH_BASE + 0x42000)
#define I2C4_BASE             (APBPERIPH_BASE + 0x44000)
#define SC0_BASE              (APBPERIPH_BASE + 0x50000)
#define SC2_BASE              (APBPERIPH_BASE + 0x52000)
#define SC4_BASE              (APBPERIPH_BASE + 0x54000)
#define CAN0_BASE             (APBPERIPH_BASE + 0x60000)
#define QEI0_BASE             (APBPERIPH_BASE + 0x70000)
#define ECAP0_BASE            (APBPERIPH_BASE + 0x74000)
#define PS2D_BASE             (APBPERIPH_BASE + 0xA0000)

/*!< APB1 peripherals */
#define RTC_BASE              (APBPERIPH_BASE + 0x01000)
#define ADC_BASE              (APBPERIPH_BASE + 0x03000)
#define ACMP_BASE             (APBPERIPH_BASE + 0x05000)
#define I2S1_BASE             (APBPERIPH_BASE + 0x09000)
#define OTG_BASE              (APBPERIPH_BASE + 0x0D000)
#define TIMER2_BASE           (APBPERIPH_BASE + 0x11000)
#define TIMER3_BASE           (APBPERIPH_BASE + 0x11020)
#define PWM1_BASE             (APBPERIPH_BASE + 0x19000)
#define EPWM1_BASE            (APBPERIPH_BASE + 0x1D000)
#define SPI1_BASE             (APBPERIPH_BASE + 0x21000)
#define SPI3_BASE             (APBPERIPH_BASE + 0x23000)
#define UART1_BASE            (APBPERIPH_BASE + 0x31000)
#define UART3_BASE            (APBPERIPH_BASE + 0x33000)
#define UART5_BASE            (APBPERIPH_BASE + 0x35000)
#define I2C1_BASE             (APBPERIPH_BASE + 0x41000)
#define I2C3_BASE             (APBPERIPH_BASE + 0x43000)
#define SC1_BASE              (APBPERIPH_BASE + 0x51000)
#define SC3_BASE              (APBPERIPH_BASE + 0x53000)
#define SC5_BASE              (APBPERIPH_BASE + 0x55000)
#define CAN1_BASE             (APBPERIPH_BASE + 0x61000)
#define QEI1_BASE             (APBPERIPH_BASE + 0x71000)
#define ECAP1_BASE            (APBPERIPH_BASE + 0x75000)
#define CRYPTO_BASE           (0x50080000UL)

/*@}*/ /* end of group NUC400_PERIPHERAL_MEM_MAP */


/** @addtogroup NUC400_PERIPHERAL_DECLARATION NUC400 Peripheral Declaration
  The Declaration of NUC400 Series Peripheral
  @{
 */

#define SYS                  ((GCR_T *)   GCR_BASE)
#define CLK                  ((CLK_T *)   CLK_BASE)
#define PA                   ((GPIO_T *)  GPIOA_BASE)
#define PB                   ((GPIO_T *)  GPIOB_BASE)
#define PC                   ((GPIO_T *)  GPIOC_BASE)
#define PD                   ((GPIO_T *)  GPIOD_BASE)
#define PE                   ((GPIO_T *)  GPIOE_BASE)
#define PF                   ((GPIO_T *)  GPIOF_BASE)
#define PG                   ((GPIO_T *)  GPIOG_BASE)
#define PH                   ((GPIO_T *)  GPIOH_BASE)
#define PI                   ((GPIO_T *)  GPIOI_BASE)
#define GPIO                 ((GPIO_DBNCECON_T *) GPIO_DBNCECON_BASE)
#define PDMA                 ((PDMA_T *)  PDMA_BASE)
#define USBH                 ((USBH_T *)  USBH_BASE)
#define EMAC                 ((EMAC_T *)  EMAC_BASE)
#define FMC                  ((FMC_T *)   FMC_BASE)
#define SD                   ((SD_T *)    SD_BASE)
#define SIC                  ((SIC_T *)   SIC_BASE)
#define EBI                  ((EBI_T *)   EBI_BASE)
#define CAP                  ((CAP_T *)   CAP_BASE)
#define SPACC                ((SPACC_T *) SPACC_BASE)
#define CRC                  ((CRC_T *)   CRC_BASE)
#define TAMPER               ((TAMPER_T *) TAMPER_BASE)

#define WDT                  ((WDT_T *)   WDT_BASE)
#define WWDT                 ((WWDT_T *)  WWDT_BASE)
#define RTC                  ((RTC_T *)   RTC_BASE)
#define ADC                  ((ADC_T *)   ADC_BASE)
#define ACMP                 ((ACMP_T *)  ACMP_BASE)

#define I2S0                 ((I2S_T *)   I2S0_BASE)
#define I2S1                 ((I2S_T *)   I2S1_BASE)
#define USBD                 ((USBD_T *)  UDC20_BASE)
#define OTG                  ((OTG_T *)   OTG_BASE)
#define TIMER0               ((TIMER_T *) TIMER0_BASE)
#define TIMER1               ((TIMER_T *) TIMER1_BASE)
#define TIMER2               ((TIMER_T *) TIMER2_BASE)
#define TIMER3               ((TIMER_T *) TIMER3_BASE)
#define PWM0                 ((PWM_T *)   PWM0_BASE)
#define PWM1                 ((PWM_T *)   PWM1_BASE)
#define EPWM0                ((EPWM_T *)  EPWM0_BASE)
#define EPWM1                ((EPWM_T *)  EPWM1_BASE)
#define ECAP0                ((ECAP_T *)  ECAP0_BASE)
#define ECAP1                ((ECAP_T *)  ECAP1_BASE)
#define QEI0                 ((QEI_T *)   QEI0_BASE)
#define QEI1                 ((QEI_T *)   QEI1_BASE)
#define SPI0                 ((SPI_T *)   SPI0_BASE)
#define SPI1                 ((SPI_T *)   SPI1_BASE)
#define SPI2                 ((SPI_T *)   SPI2_BASE)
#define SPI3                 ((SPI_T *)   SPI3_BASE)
#define UART0                ((UART_T *)  UART0_BASE)
#define UART1                ((UART_T *)  UART1_BASE)
#define UART2                ((UART_T *)  UART2_BASE)
#define UART3                ((UART_T *)  UART3_BASE)
#define UART4                ((UART_T *)  UART4_BASE)
#define UART5                ((UART_T *)  UART5_BASE)
#define I2C0                 ((I2C_T *)   I2C0_BASE)
#define I2C1                 ((I2C_T *)   I2C1_BASE)
#define I2C2                 ((I2C_T *)   I2C2_BASE)
#define I2C3                 ((I2C_T *)   I2C3_BASE)
#define I2C4                 ((I2C_T *)   I2C4_BASE)
#define SC0                  ((SC_T *)    SC0_BASE)
#define SC1                  ((SC_T *)    SC1_BASE)
#define SC2                  ((SC_T *)    SC2_BASE)
#define SC3                  ((SC_T *)    SC3_BASE)
#define SC4                  ((SC_T *)    SC4_BASE)
#define SC5                  ((SC_T *)    SC5_BASE)
#define CAN0                 ((CAN_T *)   CAN0_BASE)
#define CAN1                 ((CAN_T *)   CAN1_BASE)
#define PS2D                 ((PS2D_T *)  PS2D_BASE)
#define CRYPTO               ((CRYPTO_T *) CRYPTO_BASE)
/*@}*/ /* end of group NUC400_PERIPHERAL_DECLARATION */
/*@}*/ /* end of group NUC400_Peripherals */

/** @addtogroup NUC400_IO_ROUTINE NUC400 I/O routines
  The Declaration of NUC400 I/O routines
  @{
 */

typedef volatile unsigned char  vu8;        ///< Define 8-bit unsigned volatile data type
typedef volatile unsigned short vu16;       ///< Define 16-bit unsigned volatile data type
typedef volatile unsigned long  vu32;       ///< Define 32-bit unsigned volatile data type

/**
  * @brief Get a 8-bit unsigned value from specified address
  * @param[in] addr Address to get 8-bit data from
  * @return  8-bit unsigned value stored in specified address
  */
#define M8(addr)  (*((vu8  *) (addr)))

/**
  * @brief Get a 16-bit unsigned value from specified address
  * @param[in] addr Address to get 16-bit data from
  * @return  16-bit unsigned value stored in specified address
  * @note The input address must be 16-bit aligned
  */
#define M16(addr) (*((vu16 *) (addr)))

/**
  * @brief Get a 32-bit unsigned value from specified address
  * @param[in] addr Address to get 32-bit data from
  * @return  32-bit unsigned value stored in specified address
  * @note The input address must be 32-bit aligned
  */
#define M32(addr) (*((vu32 *) (addr)))

/**
  * @brief Set a 32-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 32-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 32-bit aligned
  */
#define outpw(port,value)     *((volatile unsigned int *)(port)) = value

/**
  * @brief Get a 32-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 32-bit data from
  * @return  32-bit unsigned value stored in specified I/O port
  * @note The input port must be 32-bit aligned
  */
#define inpw(port)            (*((volatile unsigned int *)(port)))

/**
  * @brief Set a 16-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 16-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 16-bit aligned
  */
#define outps(port,value)     *((volatile unsigned short *)(port)) = value

/**
  * @brief Get a 16-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 16-bit data from
  * @return  16-bit unsigned value stored in specified I/O port
  * @note The input port must be 16-bit aligned
  */
#define inps(port)            (*((volatile unsigned short *)(port)))

/**
  * @brief Set a 8-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 8-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  */
#define outpb(port,value)     *((volatile unsigned char *)(port)) = value

/**
  * @brief Get a 8-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 8-bit data from
  * @return  8-bit unsigned value stored in specified I/O port
  */
#define inpb(port)            (*((volatile unsigned char *)(port)))

/**
  * @brief Set a 32-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 32-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 32-bit aligned
  */
#define outp32(port,value)    *((volatile unsigned int *)(port)) = value

/**
  * @brief Get a 32-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 32-bit data from
  * @return  32-bit unsigned value stored in specified I/O port
  * @note The input port must be 32-bit aligned
  */
#define inp32(port)           (*((volatile unsigned int *)(port)))

/**
  * @brief Set a 16-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 16-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 16-bit aligned
  */
#define outp16(port,value)    *((volatile unsigned short *)(port)) = value

/**
  * @brief Get a 16-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 16-bit data from
  * @return  16-bit unsigned value stored in specified I/O port
  * @note The input port must be 16-bit aligned
  */
#define inp16(port)           (*((volatile unsigned short *)(port)))

/**
  * @brief Set a 8-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 8-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  */
#define outp8(port,value)     *((volatile unsigned char *)(port)) = value

/**
  * @brief Get a 8-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 8-bit data from
  * @return  8-bit unsigned value stored in specified I/O port
  */
#define inp8(port)            (*((volatile unsigned char *)(port)))


